// BSLLS:UnusedParameters-off

// Создает экземпляр пользовательской числовой колонки для тестов.
//
// Возвращаемое значение:
//   КолонкаОтчетаБенчмарков
Функция Создать() Экспорт

	Колонка = Новый КолонкаОтчетаБенчмарков("ПользовательскаяЧисловая");
	Колонка.Заголовок = "Custom Number";
	Колонка.Описание = "Пользовательская числовая колонка";

	Возврат Колонка;

КонецФункции

// Возвращает значение пользовательской числовой колонки.
//
// Параметры:
//   РезультатЗапускаКейса - РезультатЗапускаКейса
//   Колонка - КолонкаОтчетаБенчмарков
//
// Возвращаемое значение:
//   Число
Функция Значение(РезультатЗапускаКейса, Колонка) Экспорт

	Возврат 42;

КонецФункции
