// BSLLS:UnusedParameters-off

// Создает экземпляр пользовательской колонки для тестов.
//
// Возвращаемое значение:
//   КолонкаОтчетаБенчмарков
Функция Создать() Экспорт

	Колонка = Новый КолонкаОтчетаБенчмарков("Пользовательская");
	Колонка.Заголовок = "Custom";
	Колонка.Описание = "Пользовательская колонка";

	Возврат Колонка;

КонецФункции

// Возвращает значение пользовательской колонки.
//
// Параметры:
//   РезультатЗапускаКейса - РезультатЗапускаКейса
//   Колонка - КолонкаОтчетаБенчмарков
//
// Возвращаемое значение:
//   Строка
Функция Значение(РезультатЗапускаКейса, Колонка) Экспорт

	Возврат "custom";

КонецФункции

// Возвращает представление значения пользовательской колонки.
//
// Параметры:
//   Значение - Произвольный
//   РезультатЗапускаКейса - РезультатЗапускаКейса
//   ПараметрыПредставленияКолонки - ПараметрыПредставленияКолонкиОтчетаБенчмарков
//
// Возвращаемое значение:
//   Строка
Функция ПредставлениеЗначения(Значение, РезультатЗапускаКейса, ПараметрыПредставленияКолонки) Экспорт

	Возврат СтрШаблон(
		"%1|%2|%3",
		Значение,
		РезультатЗапускаКейса.Статистика.Среднее,
		ПараметрыПредставленияКолонки.ФорматнаяСтрока
	);

КонецФункции
