Перем _Диспетчер;   // ДиспетчерСобытийВыполненияБенчмарков
Перем _Наблюдатель; // Произвольный
Перем _Добавлен;    // Булево

#Область ОбработчикиСобытий

Процедура ПриСозданииОбъекта(Диспетчер, Наблюдатель)

	_Диспетчер = Диспетчер;
	_Наблюдатель = Наблюдатель;
	_Добавлен = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ОбработатьСобытие(Событие) Экспорт

	Если _Добавлен Тогда
		Возврат;
	КонецЕсли;

	_Диспетчер.ДобавитьНаблюдатель(_Наблюдатель);
	_Добавлен = Истина;

КонецПроцедуры

#КонецОбласти
