#Использовать benchmark
#Использовать "../benchmarks"

Тип = Тип("БенчмаркБазовый");

Конфигурация = Новый КонфигурацияБенчмарков(Тип)
	.ДобавитьОбработчикСобытия("ОбработчикиСобытийБенчмарковПример.Инициализация", СобытияБенчмарков.ПередВсеми())
	.ДобавитьОбработчикСобытия("ОбработчикиСобытийБенчмарковПример.Завершение", СобытияБенчмарков.ПослеВсех())
	.ДобавитьОбработчикСобытия("ОбработчикиСобытийБенчмарковПример.ПередЗапуском", СобытияБенчмарков.ПередКаждымКейсом())
	.ДобавитьОбработчикСобытия("ОбработчикиСобытийБенчмарковПример.ПослеЗапуска", СобытияБенчмарков.ПослеКаждогоКейса());

Бенчмаркинг.Запустить(Тип, Конфигурация);