#Использовать asserts
#Использовать "helpers"

Перем _ПарсерПараметровБенчмарковCLI; // ПарсерПараметровБенчмарковCLI

&Инициализация
Процедура Инициализация() Экспорт

	_ПарсерПараметровБенчмарковCLI = Новый ПарсерПараметровБенчмарковCLI();

КонецПроцедуры

&Тест
&Параметры("field=1", "field", 1)
&Параметры("field=test", "field", "test")
&Параметры("field=true", "field", Истина)
&Параметры("field=Истина", "field", Истина)
&Параметры("field=test value", "field", "test value")
&Параметры("field=1.5", "field", 1.5)
&Параметры("field=1,5", "field", 1.5)
&Параметры("field=", "field", "")
&Параметры("field", "field", Неопределено)
Процедура ТестДолжен_РазобратьПараметрCLI(ПараметрCLI, ОжидаемоеИмяПоля, ОжидаемоеЗначение) Экспорт

	// Действие
	Параметр = _ПарсерПараметровБенчмарковCLI.РазобратьПараметр(ПараметрCLI);

	// Проверка
	Ожидаем.Что(Параметр.ИмяПоля).Равно(ОжидаемоеИмяПоля);
	Ожидаем.Что(Параметр.Значение).Равно(ОжидаемоеЗначение);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеЕслиНеУказаноИмяПоля() Экспорт

	// Подготовка
	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить("=1");

	// Действие и Проверка
	Ожидаем
		.Что(_ПарсерПараметровБенчмарковCLI)
		.Метод("РазобратьПараметр", ПараметрыМетода)
		.ВыбрасываетИсключение("В значении опции -p, --param <=1> не указано имя поля");

КонецПроцедуры
