// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

&Тест
Процедура ТестДолжен_ИзмеритьВыделяемуюПамятьБуфераДвоичныхДанных() Экспорт

	// Подготовка
	РазмерВБайтах = 1024 * 1024;
	Тип = Тип("БенчмаркБуферДвоичныхДанных");
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	ДескрипторБенчмарка = ДескрипторыБенчмарков.НайтиПоИмени("Бенчмарк");
	ДескрипторБенчмарка.ДобавитьПараметры(РазмерВБайтах);

	// Действие
	Результат = Бенчмаркинг.Запустить(ДескрипторБенчмарка);

	// Проверка
	ВыделеноБайт = Результат.Запуски[0].Статистика.ВыделяемаяПамять;
	Коэффициент = РазмерВБайтах / ВыделеноБайт;

	Ожидаем.Что(Коэффициент).Между(0.99, 1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИзмеритьВыделяемуюПамятьПустогоБенчмарка() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");
	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьКоличествоИтераций(5)
		.УстановитьКоличествоПрогревочныхИтераций(0)
		.ДобавитьМониторингПамяти();

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски[0].Статистика.ВыделяемаяПамять).Между(1, 2000);

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеЗаполнятьВыделяемуюПамятьБезПрофилированияПамяти() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");
	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьКоличествоИтераций(5)
		.УстановитьКоличествоПрогревочныхИтераций(0);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски[0].Статистика.ВыделяемаяПамять).Равно(0);

КонецПроцедуры

&Тест
Процедура ТестДолжен_РассчитатьПоказателиПроизводительности() Экспорт

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип("БенчмаркиСЗадержкой"));

	// Проверка
	Запуски = Результат.Запуски;
	Отчет = Результат.Отчет;
	Статистика1 = Запуски[0].Статистика.ВМиллисекунды();
	Статистика2 = Запуски[1].Статистика.ВМиллисекунды();

	Ожидаем.Что(Статистика1.Среднее).Больше(10);
	Ожидаем.Что(Статистика2.Среднее).Больше(20);
	Ожидаем.Что(Статистика1.СтандартноеОтклонение).Больше(0);
	Ожидаем.Что(Статистика2.СтандартноеОтклонение).Больше(0);
	Ожидаем.Что(Статистика1.СтандартнаяОшибкаСреднего).Больше(0);
	Ожидаем.Что(Статистика2.СтандартнаяОшибкаСреднего).Больше(0);
	Ожидаем.Что(Статистика1.Медиана).Больше(10);
	Ожидаем.Что(Статистика2.Медиана).Больше(20);
	Ожидаем.Что(Отчет.Таблица[0][КолонкиОтчетаБенчмарков.КоэффициентПроизводительности]).Равно(1);
	Ожидаем.Что(Отчет.Таблица[1][КолонкиОтчетаБенчмарков.КоэффициентПроизводительности]).Больше(1);

КонецПроцедуры
