#Использовать asserts
#Использовать fs
#Использовать logos
#Использовать "helpers"
#Использовать ".."

Перем Диспетчер;
Перем НаблюдательСОшибкой;
Перем НаблюдательПолучатель;
Перем НаблюдательДобавляющий;

#Область ОбработчикиСобытий

&Перед
Процедура ПередКаждым() Экспорт
	Диспетчер = Новый ДиспетчерСобытийВыполненияБенчмарков();
	НаблюдательСОшибкой = Новый НаблюдательСОшибкойСобытийВыполненияБенчмарков();
	НаблюдательПолучатель = Новый НаблюдательСобытийВыполненияБенчмарков();
	НаблюдательДобавляющий = Новый ДобавляющийНаблюдательСобытийВыполненияБенчмарков(Диспетчер, НаблюдательПолучатель);
КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ПрименитьПодпискуНаблюдателяПослеПубликацииСобытия() Экспорт

	// Подготовка
	Диспетчер.ДобавитьНаблюдатель(НаблюдательДобавляющий);
	Событие = Новый СобытиеВыполненияБенчмарков(ТипыСобытийВыполненияБенчмарков.ЗапускБенчмарковНачат(), Новый Структура());

	// Действие
	Диспетчер.Опубликовать(Событие);

	// Проверка
	Ожидаем.Что(НаблюдательПолучатель.События()).ИмеетДлину(0);

	// Действие
	Диспетчер.Опубликовать(Событие);

	// Проверка
	Ожидаем.Что(НаблюдательПолучатель.События()).ИмеетДлину(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПродолжитьПубликациюПослеОшибкиНаблюдателя() Экспорт

	// Подготовка
	КонтекстЛога = ПодключитьАппендерЛога(
		"oscript.lib.benchmark.ДиспетчерСобытийВыполненияБенчмарков",
		УровниЛога.Ошибка
	);
	Диспетчер.ДобавитьНаблюдатель(НаблюдательСОшибкой);
	Диспетчер.ДобавитьНаблюдатель(НаблюдательПолучатель);

	// Действие
	Событие = Новый СобытиеВыполненияБенчмарков(ТипыСобытийВыполненияБенчмарков.ЗапускБенчмарковНачат(), Новый Структура());
	
	Попытка
		Диспетчер.Опубликовать(Событие);
		СообщенияЛога = КонтекстЛога.Аппендер.ПолучитьСообщения();
	Исключение
		ОтключитьАппендерЛога(КонтекстЛога);
		ВызватьИсключение;
	КонецПопытки;

	ОтключитьАппендерЛога(КонтекстЛога);

	// Проверка
	Ожидаем.Что(НаблюдательПолучатель.События()).ИмеетДлину(1);
	Ожидаем.Что(Событие.ТипСобытия()).Равно(ТипыСобытийВыполненияБенчмарков.ЗапускБенчмарковНачат());
	Ожидаем.Что(СообщенияЛога[0]).Содержит("Ошибка наблюдателя при обработке события выполнения");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодключитьАппендерЛога(ИмяЛога, Уровень)

	Лог = Логирование.ПолучитьЛог(ИмяЛога);

	ПутьКАппендеру = ФС.НормализоватьПуть(ОбъединитьПути(ТекущийКаталог(), "tests/fixtures/АппендерЛога.os"));
	Аппендер = ЗагрузитьСценарий(ПутьКАппендеру);

	ПредыдущийУровень = Лог.Уровень();

	Лог.УстановитьУровень(Уровень);
	Лог.ДобавитьСпособВывода(Аппендер, Уровень);

	Возврат Новый Структура("Лог, Аппендер, ПредыдущийУровень", Лог, Аппендер, ПредыдущийУровень);

КонецФункции

Процедура ОтключитьАппендерЛога(КонтекстЛога)
	КонтекстЛога.Лог.УдалитьСпособВывода(КонтекстЛога.Аппендер);
	КонтекстЛога.Лог.УстановитьУровень(КонтекстЛога.ПредыдущийУровень);
КонецПроцедуры

#КонецОбласти
