#Использовать asserts
#Использовать "helpers"

Перем _ПарсерПараметровБенчмарковCLI; // ПарсерПараметровБенчмарковCLI

&Инициализация
Процедура Инициализация() Экспорт

	_ПарсерПараметровБенчмарковCLI = Новый ПарсерПараметровБенчмарковCLI();

КонецПроцедуры

&Тест
&Параметры("field=1", 1)
&Параметры("field=test", "test")
&Параметры("field=true", Истина)
&Параметры("field=Истина", Истина)
&Параметры("field=test value", "test value")
&Параметры("field=1.5", 1.5)
&Параметры("field=1,5", 1.5)
&Параметры("field=", "")
&Параметры("field", Неопределено)
&Параметры("field=false", Ложь)
&Параметры("field=ложь", Ложь)
&Параметры("field=-5", -5)
&Параметры("field=a=b", "a=b")
Процедура ТестДолжен_РазобратьПараметрCLI(ПараметрCLI, ОжидаемоеЗначение) Экспорт

	// Действие
	Параметр = _ПарсерПараметровБенчмарковCLI.РазобратьПараметр(ПараметрCLI);

	// Проверка
	Ожидаем.Что(Параметр.ИмяПоля).Равно("field");
	Ожидаем.Что(Параметр.Значение).Равно(ОжидаемоеЗначение);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеЕслиНеУказаноИмяПоля() Экспорт

	// Подготовка
	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить("=1");

	// Действие и Проверка
	Ожидаем
		.Что(_ПарсерПараметровБенчмарковCLI)
		.Метод("РазобратьПараметр", ПараметрыМетода)
		.ВыбрасываетИсключение("В значении опции -p, --param <=1> не указано имя поля");

КонецПроцедуры
