// BSLLS:LineLength-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать fluent
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

#Область Тесты

&Тест
Процедура ТестДолжен_ЗапуститьТолькоВыбранныйКейсПоИдентификатору() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиМетода");
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	Исполнитель = Новый ИсполнительБенчмарков(Тип, Конфигурация);

	ИдентификаторыКейсов = Новый Массив();
	ИдентификаторыКейсов.Добавить(2);

	// Действие
	Результат = Исполнитель.Запустить(ИдентификаторыКейсов);

	// Проверка
	Ожидаем.Что(Результат.Запуски, "Запуски").ИмеетДлину(1);
	Ожидаем.Что(Результат.Отчет.Таблица, "Отчет").ИмеетДлину(1);

	Кейс = Результат.Запуски[0].Кейс;

	Ожидаем.Что(Кейс.Идентификатор(), "Идентификатор кейса").Равно(2);
	Ожидаем.Что(Кейс.Параметры()[0].Значение(), "Параметр 1").Равно(20);
	Ожидаем.Что(Кейс.Параметры()[1].Значение(), "Параметр 2").Равно(200);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПропуститьКейсыДоЧекпоинта() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиМетода");
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);
	Конфигурация.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск);

	Исполнитель = Новый ИсполнительБенчмарков(Тип, Конфигурация);

	Чекпоинт = Новый ЧекпоинтЗапускаБенчмарков();
	Чекпоинт.ИмяМетода = "Бенчмарк";
	Чекпоинт.ИдентификаторКейса = 2;
	Чекпоинт.Этап = ЭтапыБенчмарка.Измерение;
	Чекпоинт.НомерИтерации = 1;

	Исполнитель.УстановитьЧекпоинт(Чекпоинт);

	// Действие
	Результат = Исполнитель.Запустить();

	// Проверка
	Ожидаем.Что(Результат.Запуски, "Запуски").ИмеетДлину(1);
	Ожидаем.Что(Результат.Чекпоинт, "Чекпоинт").ЭтоНеопределено();

	Кейс = Результат.Запуски[0].Кейс;

	Ожидаем.Что(Кейс.Идентификатор(), "Идентификатор кейса").Равно(2);
	Ожидаем.Что(Кейс.Параметры()[0].Значение(), "Параметр 1").Равно(20);
	Ожидаем.Что(Кейс.Параметры()[1].Значение(), "Параметр 2").Равно(200);
	Ожидаем.Что(Результат.Запуски[0].Замеры[0].НомерИтерации, "Номер итерации").Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПродолжитьХолодныйЗапускПоЧекпоинтуИзмерения() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);
	Конфигурация
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск)
		.УстановитьКоличествоИтераций(3);

	// Действие
	ПервыйИсполнитель = Новый ИсполнительБенчмарков(Тип, Конфигурация);
	ПервыйРезультат = ПервыйИсполнитель.Запустить();

	ВторойИсполнитель = Новый ИсполнительБенчмарков(Тип, Конфигурация);
	ВторойИсполнитель.УстановитьЧекпоинт(ПервыйРезультат.Чекпоинт);
	ВторойРезультат = ВторойИсполнитель.Запустить();

	ТретийИсполнитель = Новый ИсполнительБенчмарков(Тип, Конфигурация);
	ТретийИсполнитель.УстановитьЧекпоинт(ВторойРезультат.Чекпоинт);
	ТретийРезультат = ТретийИсполнитель.Запустить();

	// Проверка
	Ожидаем.Что(ПервыйРезультат.Чекпоинт, "Чекпоинт первого запуска").Заполнено();
	Ожидаем.Что(ПервыйРезультат.Чекпоинт.Этап, "Этап первого запуска").Равно(ЭтапыБенчмарка.Измерение);
	Ожидаем.Что(ПервыйРезультат.Чекпоинт.НомерИтерации, "Номер итерации первого запуска").Равно(2);
	Ожидаем.Что(ПервыйРезультат.Запуски[0].Замеры[0].НомерИтерации, "Первая выполненная итерация").Равно(1);

	Ожидаем.Что(ВторойРезультат.Чекпоинт, "Чекпоинт второго запуска").Заполнено();
	Ожидаем.Что(ВторойРезультат.Чекпоинт.Этап, "Этап второго запуска").Равно(ЭтапыБенчмарка.Измерение);
	Ожидаем.Что(ВторойРезультат.Чекпоинт.НомерИтерации, "Номер итерации второго запуска").Равно(3);
	Ожидаем.Что(ВторойРезультат.Запуски[0].Замеры[0].НомерИтерации, "Вторая выполненная итерация").Равно(2);

	Ожидаем.Что(ТретийРезультат.Чекпоинт, "Чекпоинт третьего запуска").ЭтоНеопределено();
	Ожидаем.Что(ТретийРезультат.Запуски[0].Замеры[0].НомерИтерации, "Третья выполненная итерация").Равно(3);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПродолжитьХолодныйЗапускПоЧекпоинтуПамяти() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");
	
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);
	Конфигурация
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск)
		.УстановитьКоличествоИтераций(1)
		.ДобавитьМониторингПамяти();

	// Действие
	ПервыйИсполнитель = Новый ИсполнительБенчмарков(Тип, Конфигурация);
	ПервыйРезультат = ПервыйИсполнитель.Запустить();

	ВторойИсполнитель = Новый ИсполнительБенчмарков(Тип, Конфигурация);
	ВторойИсполнитель.УстановитьЧекпоинт(ПервыйРезультат.Чекпоинт);
	ВторойРезультат = ВторойИсполнитель.Запустить();

	// Проверка
	Ожидаем.Что(ПервыйРезультат.Чекпоинт, "Чекпоинт первого запуска").Заполнено();
	Ожидаем.Что(ПервыйРезультат.Чекпоинт.Этап, "Этап первого запуска").Равно(ЭтапыБенчмарка.Память);
	Ожидаем.Что(ПервыйРезультат.Чекпоинт.НомерИтерации, "Номер итерации первого запуска").Равно(1);
	Ожидаем.Что(ПервыйРезультат.Запуски[0].Замеры, "Замеры первого запуска").ИмеетДлину(1);
	Ожидаем.Что(ПервыйРезультат.Запуски[0].Замеры[0].Этап, "Этап замера первого запуска").Равно(ЭтапыБенчмарка.Измерение);

	Ожидаем.Что(ВторойРезультат.Чекпоинт, "Чекпоинт второго запуска").ЭтоНеопределено();
	Ожидаем.Что(ВторойРезультат.Запуски[0].Замеры, "Замеры второго запуска").ИмеетДлину(1);
	Ожидаем.Что(ВторойРезультат.Запуски[0].Замеры[0].Этап, "Этап замера второго запуска").Равно(ЭтапыБенчмарка.Память);

КонецПроцедуры

#КонецОбласти
