// BSLLS:LineLength-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать fluent
#Использовать fs
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

&Тест
Процедура ТестДолжен_ЗапуститьОдинБенчмаркОднойИтерациейБезПараметровБезПамяти() Экспорт
	
	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск)
		.УстановитьКоличествоИтераций(1)
		.УдалитьМониторингПамяти();

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски, "Запуски").ИмеетДлину(1);
	Ожидаем.Что(Результат.Запуски[0].Замеры, "Замеры").ИмеетДлину(1);

	ПроверитьЗамеры(Результат.Запуски[0].Замеры, 1, 1, ЭтапыБенчмарка.Измерение);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьОдинБенчмаркОднойИтерациейБезПараметровСПамятью() Экспорт
	
	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск)
		.УстановитьКоличествоИтераций(1)
		.ДобавитьМониторингПамяти();

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски, "Запуски").ИмеетДлину(1);
	Ожидаем.Что(Результат.Запуски[0].Замеры, "Замеры").ИмеетДлину(2);

	ПроверитьЗамеры(Результат.Запуски[0].Замеры, 1, 1, ЭтапыБенчмарка.Измерение);
	ПроверитьЗамеры(Результат.Запуски[0].Замеры, 2, 2, ЭтапыБенчмарка.Память);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьОдинБенчмаркТремяИтерациямиБезПараметровБезПамяти() Экспорт
	
	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск)
		.УстановитьКоличествоИтераций(3)
		.УдалитьМониторингПамяти();

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски, "Запуски").ИмеетДлину(1);
	Ожидаем.Что(Результат.Запуски[0].Замеры, "Замеры").ИмеетДлину(3);

	ПроверитьЗамеры(Результат.Запуски[0].Замеры, 1, 3, ЭтапыБенчмарка.Измерение);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьОдинБенчмаркСТремяИтерациямиБезПараметровСПамятью() Экспорт
	
	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск)
		.УстановитьКоличествоИтераций(3)
		.ДобавитьМониторингПамяти();

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски, "Запуски").ИмеетДлину(1);
	Ожидаем.Что(Результат.Запуски[0].Замеры, "Замеры").ИмеетДлину(6);

	ПроверитьЗамеры(Результат.Запуски[0].Замеры, 1, 3, ЭтапыБенчмарка.Измерение);
	ПроверитьЗамеры(Результат.Запуски[0].Замеры, 4, 6, ЭтапыБенчмарка.Память);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьОдинБенчмаркОднойИтерациейДвумяПараметрамиБезПамяти() Экспорт
	
	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиПоля");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск)
		.УстановитьКоличествоИтераций(1)
		.УдалитьМониторингПамяти();

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски, "Запуски").ИмеетДлину(2);
	Ожидаем.Что(Результат.Запуски[0].Замеры, "Замеры 1").ИмеетДлину(1);
	Ожидаем.Что(Результат.Запуски[1].Замеры, "Замеры 2").ИмеетДлину(1);

	Для Каждого Запуск Из Результат.Запуски Цикл
		ПроверитьЗамеры(Запуск.Замеры, 1, 1, ЭтапыБенчмарка.Измерение);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьОдинБенчмаркОднойИтерациейДвумяПараметрамиСПамятью() Экспорт
	
	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиПоля");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск)
		.УстановитьКоличествоИтераций(1)
		.ДобавитьМониторингПамяти();

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски, "Запуски").ИмеетДлину(2);
	Ожидаем.Что(Результат.Запуски[0].Замеры, "Замеры 1").ИмеетДлину(2);
	Ожидаем.Что(Результат.Запуски[1].Замеры, "Замеры 2").ИмеетДлину(2);

	Для Каждого Запуск Из Результат.Запуски Цикл
		ПроверитьЗамеры(Запуск.Замеры, 1, 1, ЭтапыБенчмарка.Измерение);
		ПроверитьЗамеры(Запуск.Замеры, 2, 2, ЭтапыБенчмарка.Память);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьДваБенчмаркаТремяИтерациямиБезПараметровБезПамяти() Экспорт
	
	// Подготовка
	Тип = Тип("БенчмаркиСЭталоном");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск)
		.УстановитьКоличествоИтераций(3)
		.УдалитьМониторингПамяти();

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски, "Запуски").ИмеетДлину(2);
	Ожидаем.Что(Результат.Запуски[0].Замеры, "Замеры 1").ИмеетДлину(3);
	Ожидаем.Что(Результат.Запуски[0].ДескрипторБенчмарка.Метод(), "Дескриптор 1").Равно("Бенчмарк");
	Ожидаем.Что(Результат.Запуски[1].Замеры, "Замеры 2").ИмеетДлину(3);
	Ожидаем.Что(Результат.Запуски[1].ДескрипторБенчмарка.Метод(), "Дескриптор 2").Равно("БенчмаркЭталон");

	Для Каждого Запуск Из Результат.Запуски Цикл
		ПроверитьЗамеры(Запуск.Замеры, 1, 3, ЭтапыБенчмарка.Измерение);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьТриБенчмаркаОднойИтерациейСПараметрамиБезПамяти() Экспорт
	
	// Подготовка
	Тип = Тип("БенчмаркиСЭталономИПараметрами");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск)
		.УстановитьКоличествоИтераций(1)
		.УдалитьМониторингПамяти();

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски, "Запуски").ИмеетДлину(4);
	Ожидаем.Что(Результат.Запуски[0].Замеры, "Замеры 1").ИмеетДлину(1);
	Ожидаем.Что(Результат.Запуски[0].ДескрипторБенчмарка.Метод(), "Дескриптор 1").Равно("БенчмаркА");
	Ожидаем.Что(Результат.Запуски[0].Параметры[0].Имя(), "Параметр 1.1").Равно("ОбщееПоле");
	Ожидаем.Что(Результат.Запуски[0].Параметры[1].Имя(), "Параметр 1.2").Равно("Перем1");
	Ожидаем.Что(Результат.Запуски[1].Замеры, "Замеры 2").ИмеетДлину(1);
	Ожидаем.Что(Результат.Запуски[1].ДескрипторБенчмарка.Метод(), "Дескриптор 2").Равно("БенчмаркБ");
	Ожидаем.Что(Результат.Запуски[1].Параметры[0].Имя(), "Параметр 2.1").Равно("ОбщееПоле");
	Ожидаем.Что(Результат.Запуски[1].Параметры[1].Имя(), "Параметр 2.2").Равно("Перем1");
	Ожидаем.Что(Результат.Запуски[2].Замеры, "Замеры 3").ИмеетДлину(1);
	Ожидаем.Что(Результат.Запуски[2].ДескрипторБенчмарка.Метод(), "Дескриптор 3").Равно("БенчмаркБ");
	Ожидаем.Что(Результат.Запуски[2].Параметры[0].Имя(), "Параметр 3.1").Равно("ОбщееПоле");
	Ожидаем.Что(Результат.Запуски[2].Параметры[1].Имя(), "Параметр 3.2").Равно("Перем1");
	Ожидаем.Что(Результат.Запуски[3].Замеры, "Замеры 4").ИмеетДлину(1);
	Ожидаем.Что(Результат.Запуски[3].ДескрипторБенчмарка.Метод(), "Дескриптор 4").Равно("БенчмаркВ");
	Ожидаем.Что(Результат.Запуски[3].Параметры[0].Имя(), "Параметр 4.1").Равно("ОбщееПоле");
	Ожидаем.Что(Результат.Запуски[3].Параметры[1].Имя(), "Параметр 4.2").Равно("Перем2");

	Для Каждого Запуск Из Результат.Запуски Цикл
		ПроверитьЗамеры(Запуск.Замеры, 1, 1, ЭтапыБенчмарка.Измерение);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьСРазнымиСредамиОднойИтерациейБезПараметровБезПамяти() Экспорт
	
	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	ТестированиеБенчмарков.ПодготовитьСреду("dev,stable");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск)
		.УстановитьКоличествоИтераций(1)
		.ДобавитьВерсиюИсполняющейСреды("dev")
		.ДобавитьВерсиюИсполняющейСреды("stable")
		.УдалитьМониторингПамяти();

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски, "Запуски").ИмеетДлину(2);
	Ожидаем.Что(Результат.Запуски[0].Замеры, "Замеры 1").ИмеетДлину(1);
	Ожидаем.Что(Результат.Запуски[0].ИсполняющаяСреда.Алиас, "Исполняющая среда 1").Равно("dev");
	Ожидаем.Что(Результат.Запуски[1].Замеры, "Замеры 2").ИмеетДлину(1);
	Ожидаем.Что(Результат.Запуски[1].ИсполняющаяСреда.Алиас, "Исполняющая среда 2").Равно("stable");

	Для Каждого Запуск Из Результат.Запуски Цикл
		ПроверитьЗамеры(Запуск.Замеры, 1, 1, ЭтапыБенчмарка.Измерение);
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьЗамеры(Замеры, Нач, Кон, Этап)
		
	Для ИндексЗамера = Нач - 1 По Кон - 1 Цикл
		Ожидаем.Что(Замеры[ИндексЗамера].Этап).Равно(Этап);

		Если Этап = ЭтапыБенчмарка.Измерение Тогда
			Ожидаем.Что(Замеры[ИндексЗамера].Наносекунд).Заполнено();
		Иначе
			Ожидаем.Что(Замеры[ИндексЗамера].Наносекунд).Не_().Заполнено();
		КонецЕсли;

		Если Этап = ЭтапыБенчмарка.Память Тогда
			Ожидаем.Что(Замеры[ИндексЗамера].ВыделяемаяПамять).Заполнено();
		Иначе
			Ожидаем.Что(Замеры[ИндексЗамера].ВыделяемаяПамять).Не_().Заполнено();
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры