// BSLLS:LineLength-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать fluent
#Использовать fs
#Использовать tempfiles
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

Перем _МенеджерВременныхФайлов; // МенеджерВременныхФайлов

#Область ОбработчикиСобытий

&Инициализация
Процедура ПередВсеми() Экспорт

	_МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов();

КонецПроцедуры

&После
Процедура ПослеЗапускаТеста() Экспорт

	КаталогАртефактов = ".\BenchmarkArtifacts";

	ФС.УдалитьФайлы(КаталогАртефактов);

КонецПроцедуры

&Завершение
Процедура ПослеВсех() Экспорт

	_МенеджерВременныхФайлов.Удалить();	

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ЗапуститьБенчмаркиИзКаталога() Экспорт

	// Подготовка
	Каталог = "./tests/fixtures/БенчмаркиЧерезКаталог";

	// Действие
	Результат = Бенчмаркинг.ЗапуститьИзКаталога(Каталог);

	// Проверка
	Ожидаем.Что(Результат).ИмеетДлину(2);
	Ожидаем.Что(Результат.Найти("БенчмаркИзКаталога1", "ИмяФайла")).Заполнено();
	Ожидаем.Что(Результат.Найти("БенчмаркИзКаталога2", "ИмяФайла")).Заполнено();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьБенчмаркиИзКаталогаРекурсивно() Экспорт

	// Подготовка
	Каталог = "./tests/fixtures/БенчмаркиЧерезКаталог";

	// Действие
	Результат = Бенчмаркинг.ЗапуститьИзКаталога(Каталог, Истина);

	// Проверка
	Ожидаем.Что(Результат).ИмеетДлину(3);
	Ожидаем.Что(Результат.Найти("БенчмаркИзКаталога1", "ИмяФайла")).Заполнено();
	Ожидаем.Что(Результат.Найти("БенчмаркИзКаталога2", "ИмяФайла")).Заполнено();
	Ожидаем.Что(Результат.Найти("БенчмаркИзВложенногоКаталога", "ИмяФайла")).Заполнено();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВернутьПустойРезультатПриЗапускеИзНесуществующегоКаталога() Экспорт

	// Подготовка
	Каталог = "./tests/fixtures/Классы/НесуществующийКаталог";

	// Действие
	Результат = Бенчмаркинг.ЗапуститьИзКаталога(Каталог);

	// Проверка
	Ожидаем.Что(Результат).ИмеетДлину(0);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВернутьУспешныеИОшибочныеРезультатыПриЗапускеКаталога() Экспорт

	// Подготовка
	Каталог = "./tests/fixtures/БенчмаркиСОшибкой";

	// Действие
	Результат = Бенчмаркинг.ЗапуститьИзКаталога(Каталог);

	// Проверка
	Ожидаем.Что(Результат).ИмеетДлину(2);
	Ожидаем.Что(Результат.Найти(Истина, "Успешно")).Заполнено();
	Ожидаем.Что(Результат.Найти(Ложь, "Успешно")).Заполнено();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеПриЗапускеСРазнымиТипамиОбъектов() Экспорт

	// Подготовка
	Коллекция1 = Новый КоллекцияДескрипторовБенчмарков(Тип("БенчмаркСПараметрамиМетода"));
	Коллекция2 = Новый КоллекцияДескрипторовБенчмарков(Тип("БенчмаркиПоКатегориям"));

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков();
	ДескрипторыБенчмарков.Добавить(Коллекция1.ПолучитьПервый());
	ДескрипторыБенчмарков.Добавить(Коллекция2.ПолучитьПервый());

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(ДескрипторыБенчмарков);

	// Действие и Проверка
	Ожидаем
		.Что(Бенчмаркинг)
		.Метод("Запустить", ПараметрыМетода)
		.ВыбрасываетИсключение("Обнаружены бенчмарки из разных классов");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьБенчмаркЧерезДескриптор() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Дескриптор = ДескрипторыБенчмарков.ПолучитьПервый();

	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию();
	
	// Действие
	Результат = Бенчмаркинг.Запустить(Дескриптор, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).Заполнено();
	Ожидаем.Что(Результат.Запуски).Заполнено();

КонецПроцедуры

#Область Параметры

&Тест
Процедура ТестДолжен_ЗапуститьБенчмаркСПараметрамиМетодаИзАннотаций() Экспорт

	// Подготовка
	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию();

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип("БенчмаркСПараметрамиМетода"), Конфигурация);
	
	// Проверка
	НаборыПараметров = Результат.ДескрипторыБенчмарков.ПолучитьПервый().НаборыПараметров();

	Ожидаем.Что(Результат.Отчет.Таблица).Заполнено();
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Параметр("Парам1")]).Равно(10);
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Параметр("Парам2")]).Равно(100);
	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.Параметр("Парам1")]).Равно(20);
	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.Параметр("Парам2")]).Равно(200);
	Ожидаем.Что(НаборыПараметров[0].Получить(0).ЭтоПараметрМетода()).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьБенчмаркСПараметрамиМетодаИОбщегоПоляИзАннотаций() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиМетодаИПоля");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).ИмеетДлину(4);
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Параметр("ПолеОбщее")]).Равно(1);
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Параметр("Парам1")]).Равно(3);
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Параметр("Парам2")]).Равно(4);
	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.Параметр("ПолеОбщее")]).Равно(1);
	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.Параметр("Парам1")]).Равно(5);
	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.Параметр("Парам2")]).Равно(6);
	Ожидаем.Что(Результат.Отчет.Таблица[2][КолонкиОтчетаБенчмарков.Параметр("ПолеОбщее")]).Равно(2);
	Ожидаем.Что(Результат.Отчет.Таблица[2][КолонкиОтчетаБенчмарков.Параметр("Парам1")]).Равно(3);
	Ожидаем.Что(Результат.Отчет.Таблица[2][КолонкиОтчетаБенчмарков.Параметр("Парам2")]).Равно(4);
	Ожидаем.Что(Результат.Отчет.Таблица[3][КолонкиОтчетаБенчмарков.Параметр("ПолеОбщее")]).Равно(2);
	Ожидаем.Что(Результат.Отчет.Таблица[3][КолонкиОтчетаБенчмарков.Параметр("Парам1")]).Равно(5);
	Ожидаем.Что(Результат.Отчет.Таблица[3][КолонкиОтчетаБенчмарков.Параметр("Парам2")]).Равно(6);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьБенчмаркСУстановкойПараметровМетода() Экспорт

	// Подготовка
	Параметры1 = Новый Массив();
	Параметры1.Добавить(50);
	Параметры1.Добавить(150);

	Параметры2 = Новый Массив();
	Параметры2.Добавить(Новый ПараметрБенчмарка("Парам1", 200, Истина));
	Параметры2.Добавить(Новый ПараметрБенчмарка("Парам2", 250, Истина));

	Тип = Тип("БенчмаркСПараметрамиМетода");

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Дескриптор = ДескрипторыБенчмарков.НайтиПоИмени("Бенчмарк").ОчиститьПараметры();

	Дескриптор.ДобавитьПараметры(Параметры1);
	Дескриптор.ДобавитьПараметры(Параметры2);

	// Действие
	Результат = Бенчмаркинг.Запустить(Дескриптор, ТестированиеБенчмарков.КонфигурацияПоУмолчанию());

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).Заполнено();
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Параметр("Парам1")]).Равно(50);
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Параметр("Парам2")]).Равно(150);
	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.Параметр("Парам1")]).Равно(200);
	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.Параметр("Парам2")]).Равно(250);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеПриПревышенииКоличестваПереданныхПараметровМетодаВБольшуюСторону() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиМетода");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Дескриптор = ДескрипторыБенчмарков.НайтиПоИмени("Бенчмарк").ОчиститьПараметры();

	ПараметрыБенчмарка = Новый Массив();
	ПараметрыБенчмарка.Добавить(50);
	ПараметрыБенчмарка.Добавить(150);
	ПараметрыБенчмарка.Добавить(250);

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(ПараметрыБенчмарка);

	// Действие и Проверка
	Ожидаем
		.Что(Дескриптор)
		.Метод("ДобавитьПараметры", ПараметрыМетода)
		.ВыбрасываетИсключение("Количество переданных параметров (3) не соответствует ожидаемому количеству (2) для метода бенчмарка <Бенчмарк>.");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеПриПревышенииКоличестваПереданныхПараметровМетодаВМеньшуюСторону() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиМетода");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Дескриптор = ДескрипторыБенчмарков.НайтиПоИмени("Бенчмарк").ОчиститьПараметры();

	ПараметрыБенчмарка = Новый Массив();
	ПараметрыБенчмарка.Добавить(50);

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(ПараметрыБенчмарка);

	// Действие и Проверка
	Ожидаем
		.Что(Дескриптор)
		.Метод("ДобавитьПараметры", ПараметрыМетода)
		.ВыбрасываетИсключение("Количество переданных параметров (1) не соответствует ожидаемому количеству (2) для метода бенчмарка <Бенчмарк>.");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеПриПередачеПараметровКогдаМетодНеИмеетПараметров() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Дескриптор = ДескрипторыБенчмарков.НайтиПоИмени("Бенчмарк").ОчиститьПараметры();

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(100);

	// Действие и Проверка
	Ожидаем
		.Что(Дескриптор)
		.Метод("ДобавитьПараметры", ПараметрыМетода)
		.ВыбрасываетИсключение("Метод бенчмарка <Бенчмарк> не имеет объявленных параметров. Передача параметров невозможна.");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеПриДобавленииОдиночногоПараметра() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиМетода");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Дескриптор = ДескрипторыБенчмарков.НайтиПоИмени("Бенчмарк").ОчиститьПараметры();

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(100);

	// Действие и Проверка
	Ожидаем
		.Что(Дескриптор)
		.Метод("ДобавитьПараметры", ПараметрыМетода)
		.ВыбрасываетИсключение("Передача одиночного значения недопустима для метода бенчмарка <Бенчмарк>, так как он ожидает 2 параметра(ов).");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеПриДобавленииПараметраОбщегоПоля() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиМетода");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Дескриптор = ДескрипторыБенчмарков.НайтиПоИмени("Бенчмарк").ОчиститьПараметры();

	ПараметрыБенчмарка = Новый Массив();
	ПараметрыБенчмарка.Добавить(Новый ПараметрБенчмарка("Парам1", 50, Ложь));
	ПараметрыБенчмарка.Добавить(Новый ПараметрБенчмарка("Парам1", 150, Истина));

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(ПараметрыБенчмарка);

	// Действие и Проверка
	Ожидаем
		.Что(Дескриптор)
		.Метод("ДобавитьПараметры", ПараметрыМетода)
		.ВыбрасываетИсключение("Параметр бенчмарка должен относиться к параметрам метода");

КонецПроцедуры

#КонецОбласти

&Тест
Процедура ТестДолжен_ПередатьКонфигурациюПриЗапускеИзКаталога() Экспорт

	// Подготовка
	Каталог = "./tests/fixtures/БенчмаркиЧерезКаталог";
	Конфигурация = Новый КонфигурацияБенчмарков()
		.УстановитьКоличествоИтераций(2);

	// Действие
	Результат = Бенчмаркинг.ЗапуститьИзКаталога(Каталог, , Конфигурация);

	// Проверка
	Ожидаем.Что(Результат, "Результат").Заполнено();
	Ожидаем.Что(Результат[0].Результат.Конфигурация.КоличествоИтераций()).Равно(2);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьБенчмаркВРазныхИсполняющихСредах() Экспорт

	// Подготовка
	ТестированиеБенчмарков.ПодготовитьСреду("dev,stable");

	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);
	Конфигурация.ДобавитьИсполняющуюСреду("dev", "dev");
	Конфигурация.ДобавитьИсполняющуюСреду("stable", "stable");

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).ИмеетДлину(2);
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.ВерсияИсполняющейСреды]).Содержит("dev");
	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.ВерсияИсполняющейСреды]).Содержит("stable");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеПриЗапускеСНесериализуемымиПараметрами() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиПоля");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	Конфигурация
		.ОчиститьПараметры()
		.ДобавитьПараметр("Значение", Новый Структура("Тест", 1))
		.ДобавитьИсполняющуюСреду("dev")
		.ДобавитьИсполняющуюСреду("stable", , Истина);

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Тип);
	ПараметрыМетода.Добавить(Конфигурация);

	// Действие и Проверка
	Ожидаем
		.Что(Бенчмаркинг)
		.Метод("Запустить", ПараметрыМетода)
		.ВыбрасываетИсключение("Параметр <Значение> имеет непримитивный тип");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОбработатьОшибкуУстановкиПоляОбъектаКласса() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиПоля");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);
	Конфигурация.ДобавитьПараметр("ОшибочноеИмя", 100);

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Тип);
	ПараметрыМетода.Добавить(Конфигурация);

	// Действие и Проверка
	Ожидаем
		.Что(Бенчмаркинг)
		.Метод("Запустить", ПараметрыМетода)
		.ВыбрасываетИсключение("Не удалось задать значение поля <ОшибочноеИмя> для объекта <БенчмаркСПараметрамиПоля>");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеНевозможностиОпределенияТипаКласса() Экспорт

	// Подготовка
	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Новый КоллекцияДескрипторовБенчмарков());
	ПараметрыМетода.Добавить(ТестированиеБенчмарков.КонфигурацияПоУмолчанию());

	// Действие и Проверка
	Ожидаем
		.Что(Бенчмаркинг)
		.Метод("Запустить", ПараметрыМетода)
		.ВыбрасываетИсключение("Не найдено ни одного дескриптора бенчмарка для запуска");

КонецПроцедуры

#КонецОбласти
