// BSLLS:LineLength-off

#Использовать asserts
#Использовать fs
#Использовать tempfiles
#Использовать "helpers"

Перем _МенеджерВременныхФайлов; // МенеджерВременныхФайлов
Перем _ПодготовительФайлаБенчмарка; // ПодготовительФайлаБенчмарка

#Область ОбработчикиСобытий

&Инициализация
Процедура ПередВсеми() Экспорт
	_МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов();
	_ПодготовительФайлаБенчмарка = Новый ПодготовительФайлаБенчмарка(_МенеджерВременныхФайлов);
КонецПроцедуры

&Завершение
Процедура ПослеВсех() Экспорт

	_МенеджерВременныхФайлов.Удалить();

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ВернутьИсходныйФайлЕслиАннотацияБенчмаркУжеЕсть() Экспорт

	// Подготовка
	ПутьКФайлу = "./tests/fixtures/benchmarks/Классы/ПустойБенчмарк.os";

	// Действие
	ПодготовленныйФайл = _ПодготовительФайлаБенчмарка.Подготовить(ПутьКФайлу);

	// Проверка
	Ожидаем.Что(ПодготовленныйФайл).Равно(ПутьКФайлу);
	Ожидаем.Что(_МенеджерВременныхФайлов.Файлы()).ИмеетДлину(0);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СоздатьИЗапуститьВременныйФайлДляАлгоритмаБезАннотации() Экспорт

	// Подготовка
	ПутьКФайлу = "./tests/fixtures/АлгоритмБезАннотации.os";

	// Действие
	ПодготовленныйФайл = _ПодготовительФайлаБенчмарка.Подготовить(ПутьКФайлу);

	// Проверка
	ТекстВременногоФайла = ПрочитатьТекст(ПодготовленныйФайл);
	Тип = Бенчмаркинг.ПодключитьБенчмарк(ПодготовленныйФайл);
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);

	Ожидаем.Что(ФС.ФайлСуществует(ПодготовленныйФайл)).Равно(Истина);
	Ожидаем.Что(_МенеджерВременныхФайлов.Файлы()).ИмеетДлину(1);
	Ожидаем.Что(ТекстВременногоФайла).Содержит("#Использовать fs");
	Ожидаем.Что(ТекстВременногоФайла).Содержит("&Бенчмарк");
	Ожидаем.Что(ТекстВременногоФайла).Содержит("Процедура Бенчмарк() Экспорт");
	Ожидаем.Что(ДескрипторыБенчмарков.Количество()).Равно(1);
	Ожидаем.Что(ДескрипторыБенчмарков.ПолучитьПервый().Метод()).Равно("Бенчмарк");
	Ожидаем.Что(ДескрипторыБенчмарков.ПолучитьПервый().Наименование()).Равно("АлгоритмБезАннотации");

КонецПроцедуры

&Тест
&Параметры("./tests/fixtures/benchmarks/Классы/ПустойБенчмарк.os", Истина)
&Параметры("./tests/fixtures/АлгоритмБезАннотации.os", Ложь)
Процедура ТестДолжен_ОпределитьНаличиеБенчмарковВФайле(ПутьКФайлу, Ожидание) Экспорт

	// Действие
	СодержитБенчмарки = _ПодготовительФайлаБенчмарка.СодержитБенчмарки(ПутьКФайлу);

	// Проверка
	Ожидаем.Что(СодержитБенчмарки).Равно(Ожидание);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьТекст(ПутьКФайлу)

	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	Текст = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	Возврат Текст;

КонецФункции

#КонецОбласти
