// BSLLS:MagicNumber-off

#Использовать fluent
#Использовать asserts
#Использовать "helpers"

&Тест
Процедура Тест_Пустой() Экспорт
	
	ТаблицаЗамеров = ТаблицаЗамеров("");

	Статистика = Новый СтатистикаБенчмарка();

	Параметры = Новый Массив();
	Параметры.Добавить(ТаблицаЗамеров);

	Ожидаем.Что(Статистика).Метод("Прочитать", Параметры).ВыбрасываетИсключение("Набор замеров не должен быть пустым");

КонецПроцедуры

&Тест
Процедура Тест_НечетныйРазмер() Экспорт
	
	ТаблицаЗамеров = ТаблицаЗамеров("12, 15, 22, 25, 17, 28, 14");

	Статистика = Новый СтатистикаБенчмарка(ТаблицаЗамеров);

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(19);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(12);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(17);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(23.5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(6.05, 6.06);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.2, 2.3);
	Ожидаем.Что(Статистика.Квантиль(0), "Квнтиль 0").Равно(12);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квнтиль 0.3").Равно(14.8);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квнтиль 0.5").Равно(17);
	Ожидаем.Что(Статистика.Квантиль(1), "Квнтиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(52631578, 52631579);

КонецПроцедуры

&Тест
Процедура Тест_ЧетныйРазмер() Экспорт
	
	ТаблицаЗамеров = ТаблицаЗамеров("12, 15, 22, 25, 17, 28, 20, 4");

	Статистика = Новый СтатистикаБенчмарка(ТаблицаЗамеров);

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(17.875);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(4);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(18.5);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.25);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(22.75);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(7.66, 7.67);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.7, 2.71);
	Ожидаем.Что(Статистика.Квантиль(0), "Квнтиль 0").Равно(4);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квнтиль 0.3").Равно(15.2);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квнтиль 0.5").Равно(18.5);
	Ожидаем.Что(Статистика.Квантиль(1), "Квнтиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(55944055, 55944056);

КонецПроцедуры

&Тест
Процедура Тест_ОдинаковыеЗначения() Экспорт
	
	ТаблицаЗамеров = ТаблицаЗамеров("5, 5, 5, 5");

	Статистика = Новый СтатистикаБенчмарка(ТаблицаЗамеров);

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(5);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(5);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(5);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(5);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Равно(0);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Равно(0);
	Ожидаем.Что(Статистика.Квантиль(0), "Квнтиль 0").Равно(5);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квнтиль 0.3").Равно(5);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квнтиль 0.5").Равно(5);
	Ожидаем.Что(Статистика.Квантиль(1), "Квнтиль 1").Равно(5);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Равно(200000000);

КонецПроцедуры

&Тест
Процедура Тест_ОтрицательныеЗначения() Экспорт
	
	ТаблицаЗамеров = ТаблицаЗамеров("-12, 15, -22, 25, 17, 28, 0, 4");

	Статистика = Новый СтатистикаБенчмарка(ТаблицаЗамеров);

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(6.875);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(-22);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(9.5);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(-3);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(19);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(17.68, 17.69);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(6.25, 6.26);
	Ожидаем.Что(Статистика.Квантиль(0), "Квнтиль 0").Равно(-22);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квнтиль 0.3").Равно(0.4);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квнтиль 0.5").Равно(9.5);
	Ожидаем.Что(Статистика.Квантиль(1), "Квнтиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(145454545, 145454546);

КонецПроцедуры

&Тест
Процедура Тест_ВМиллисекунды() Экспорт
	
	ОтношениеКБазовой = ЕдиницыИзмеренийБенчмарков.Миллисекунда.ОтношениеКБазовой;

	ТаблицаЗамеров = ТаблицаЗамеров("12, 15, 22, 25, 17, 28, 14", ОтношениеКБазовой);

	Статистика = Новый СтатистикаБенчмарка(ТаблицаЗамеров);
	Статистика.ВМиллисекунды();

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(19);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(12);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(17);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(23.5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(6.05, 6.06);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.2, 2.3);
	Ожидаем.Что(Статистика.Квантиль(0), "Квнтиль 0").Равно(12);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квнтиль 0.3").Равно(14.8);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квнтиль 0.5").Равно(17);
	Ожидаем.Что(Статистика.Квантиль(1), "Квнтиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(52.63, 52.64);

КонецПроцедуры

&Тест
Процедура Тест_ВСекунды() Экспорт
	
	ОтношениеКБазовой = ЕдиницыИзмеренийБенчмарков.Секунда.ОтношениеКБазовой;

	ТаблицаЗамеров = ТаблицаЗамеров("12, 15, 22, 25, 17, 28, 14", ОтношениеКБазовой);

	Статистика = Новый СтатистикаБенчмарка(ТаблицаЗамеров);
	Статистика.ВСекунды();

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(19);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(12);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(17);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(23.5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(6.05, 6.06);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.2, 2.3);
	Ожидаем.Что(Статистика.Квантиль(0), "Квнтиль 0").Равно(12);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квнтиль 0.3").Равно(14.8);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квнтиль 0.5").Равно(17);
	Ожидаем.Что(Статистика.Квантиль(1), "Квнтиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(0.0526, 0.0527);

КонецПроцедуры

&Тест
Процедура Тест_ВНаносекунды() Экспорт
	
	ТаблицаЗамеров = ТаблицаЗамеров("12, 15, 22, 25, 17, 28, 14");

	Статистика = Новый СтатистикаБенчмарка(ТаблицаЗамеров);
	Статистика.ВСекунды().ВНаносекунды();

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(19);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(12);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(17);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(23.5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(6.05, 6.06);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.2, 2.3);
	Ожидаем.Что(Статистика.Квантиль(0), "Квнтиль 0").Равно(12);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квнтиль 0.3").Равно(14.8);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квнтиль 0.5").Равно(17);
	Ожидаем.Что(Статистика.Квантиль(1), "Квнтиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(52631578, 52631579);

КонецПроцедуры

Функция ТаблицаЗамеров(Строка, Множитель = 1) Экспорт
	
	Результат = ПроцессорыКоллекций
		.ИзСтроки(Строка, ",", Ложь)
		.Обработать("Элемент -> Число(Элемент) * Множитель;", Новый Структура("Множитель", Множитель))
		.Получить(Тип("ТаблицаЗначений"));

	Результат.Колонки.Значение.Имя = "НаносекундЗаОперацию";
	Результат.Колонки.Добавить("Этап");
	Результат.Колонки.Добавить("ВыделяемаяПамятьЗаОперацию");

	Результат.ЗаполнитьЗначения(ЭтапыБенчмарка.Измерение, "Этап");

	Возврат Результат;

КонецФункции