// BSLLS:LineLength-off

#Использовать fluent
#Использовать "helpers"
#Использовать "fixtures/benchmarks"
#Использовать "fixtures/paramsSources"

#Область Тесты

&Тест
Процедура ТестДолжен_РазобратьИмяМетодаОбъекта() Экспорт

	// Подготовка
	Объект = Новый Структура("Имя", "Владелец");
	РазборИмениМетода = Новый РазборКвалифицированногоИмениМетода("МетодОбъекта", Объект);

	// Действие
	ОписаниеМетода = РазборИмениМетода.Разобрать();

	// Проверка
	Ожидаем.Что(ОписаниеМетода.Владелец).Равно(Объект);
	Ожидаем.Что(ОписаниеМетода.ИмяМетода).Равно("МетодОбъекта");

КонецПроцедуры

&Тест
Процедура ТестДолжен_РазобратьИмяМетодаМодуля() Экспорт

	// Подготовка
	РазборИмениМетода = Новый РазборКвалифицированногоИмениМетода(
		"МодульСИсточникамиПараметров.ПолучитьЧисловыеЗначения"
	);

	// Действие
	ОписаниеМетода = РазборИмениМетода.Разобрать();

	// Проверка
	Ожидаем.Что(ОписаниеМетода.Владелец).ИмеетТип("Сценарий");
	Ожидаем.Что(ОписаниеМетода.ИмяМетода).Равно("ПолучитьЧисловыеЗначения");

КонецПроцедуры

&Тест
Процедура ТестДолжен_РазобратьИмяМетодаТипа() Экспорт

	// Подготовка
	РазборИмениМетода = Новый РазборКвалифицированногоИмениМетода("ПустойБенчмарк.Бенчмарк");

	// Действие
	ОписаниеМетода = РазборИмениМетода.Разобрать();

	// Проверка
	Ожидаем.Что(ОписаниеМетода.Владелец).Равно(Тип("ПустойБенчмарк"));
	Ожидаем.Что(ОписаниеМетода.ИмяМетода).Равно("Бенчмарк");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеЕслиДляМетодаОбъектаНеПереданОбъект() Экспорт

	// Подготовка
	РазборИмениМетода = Новый РазборКвалифицированногоИмениМетода("МетодОбъекта");

	// Действие и Проверка
	Ожидаем
		.Что(РазборИмениМетода)
		.Метод("Разобрать")
		.ВыбрасываетИсключение("Для разбора метода <МетодОбъекта> не указан объект-владелец");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеНаНекорректномКвалифицированномИмени() Экспорт

	// Подготовка
	РазборИмениМетода = Новый РазборКвалифицированногоИмениМетода("Модуль.Объект.Метод");

	// Действие и Проверка
	Ожидаем
		.Что(РазборИмениМетода)
		.Метод("Разобрать")
		.ВыбрасываетИсключение(
			"Квалифицированное имя метода <Модуль.Объект.Метод> задано некорректно"
		);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапретитьНебезопасноеИмяМодуля() Экспорт

	// Подготовка
	РазборИмениМетода = Новый РазборКвалифицированногоИмениМетода(
		"Сообщить(""Произвольный код"").Метод"
	);

	// Действие и Проверка
	Ожидаем
		.Что(РазборИмениМетода)
		.Метод("Разобрать")
		.ВыбрасываетИсключение("Имя модуля <Сообщить(""Произвольный код"")> задано некорректно.");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеЕслиИмяМодуляУказываетНеНаСценарий() Экспорт

	// Подготовка
	РазборИмениМетода = Новый РазборКвалифицированногоИмениМетода("Истина.Метод");

	// Действие и Проверка
	Ожидаем
		.Что(РазборИмениМетода)
		.Метод("Разобрать")
		.ВыбрасываетИсключение("Модуль <Истина> не является сценарием");

КонецПроцедуры

#КонецОбласти
