// BSLLS:LineLength-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать fluent
#Использовать fs
#Использовать tempfiles
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

Перем _МенеджерВременныхФайлов; // МенеджерВременныхФайлов

#Область ОбработчикиСобытий

&Инициализация
Процедура ПередВсеми() Экспорт

	_МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов();

КонецПроцедуры

&После
Процедура ПослеЗапускаТеста() Экспорт

	КаталогАртефактов = ".\BenchmarkArtifacts";

	ФС.УдалитьФайлы(КаталогАртефактов);

КонецПроцедуры

&Завершение
Процедура ПослеВсех() Экспорт

	_МенеджерВременныхФайлов.Удалить();	

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_СкопироватьДескрипторБенчмарка() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиМетода");

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Дескриптор = ДескрипторыБенчмарков.НайтиПоИмени("Бенчмарк")
		.ДобавитьИсточникПараметров("Источник1")
		.ДобавитьИсточникПараметров("Источник2")
		.ИспользоватьКакЭталон()
		.УстановитьКатегорию("Категория")
		.УстановитьНаименование("Наименование для копии");

	КопияДескриптора = Дескриптор.Скопировать();

	// Действие
	НаборыПараметров = КопияДескриптора.НаборыПараметров();
	ИсточникиПараметров = КопияДескриптора.ИсточникиПараметров();

	// Проверка
	Ожидаем.Что(НаборыПараметров[0].Получить(0).Значение()).Равно(10);
	Ожидаем.Что(НаборыПараметров[0].Получить(1).Значение()).Равно(100);
	Ожидаем.Что(НаборыПараметров[1].Получить(0).Значение()).Равно(20);
	Ожидаем.Что(НаборыПараметров[1].Получить(1).Значение()).Равно(200);
	Ожидаем.Что(КопияДескриптора.ЭтоЭталон()).ЭтоИстина();
	Ожидаем.Что(КопияДескриптора.Категория()).Равно("Категория");
	Ожидаем.Что(КопияДескриптора.Наименование()).Равно("Наименование для копии");
	Ожидаем.Что(ИсточникиПараметров[0]).Равно("Источник1");
	Ожидаем.Что(ИсточникиПараметров[1]).Равно("Источник2");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИзвлечьКатегорииИзАннотации() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркиПоКатегориям");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	ИмяКолонки = КолонкиОтчетаБенчмарков.Категория;

	Ожидаем.Что(Результат.Отчет.Таблица).ИмеетДлину(4);
	Ожидаем.Что(Результат.Отчет.Таблица[0][ИмяКолонки]).Равно("А");
	Ожидаем.Что(Результат.Отчет.Таблица[1][ИмяКолонки]).Равно("А");
	Ожидаем.Что(Результат.Отчет.Таблица[2][ИмяКолонки]).Равно("Б");
	Ожидаем.Что(Результат.Отчет.Таблица[3][ИмяКолонки]).Равно("Б");

КонецПроцедуры

&Тест
Процедура ТестДолжен_УстановитьКатегориюЧерезМетодДескриптора() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	ДескрипторыБенчмарков.ПолучитьПервый().УстановитьКатегорию("В");

	// Действие
	Результат = Бенчмаркинг.Запустить(ДескрипторыБенчмарков, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).ИмеетДлину(1);
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Категория]).Равно("В");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОтфильтроватьНаборДескрипторовБенчмарков() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркиПоКатегориям");

	// Действие
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	ДескрипторыБенчмарков.Фильтровать("Элемент -> Прав(Элемент.Метод(), 1) = ""2""");

	// Проверка
	Ожидаем.Что(ДескрипторыБенчмарков.ВМассив().Количество()).Равно(2);
	Ожидаем.Что(ДескрипторыБенчмарков.Получить(0).Метод()).Равно("БенчмаркА2");
	Ожидаем.Что(ДескрипторыБенчмарков.Получить(1).Метод()).Равно("БенчмаркБ2");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИзвлечьНаименованиеИзАннотацииБенчмарк() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСНаименованием");

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);

	// Действие
	ДескрипторСНаименованием = ДескрипторыБенчмарков.НайтиПоИмени("БенчмаркСНаименованием");
	ДескрипторБезНаименования = ДескрипторыБенчмарков.НайтиПоИмени("БенчмаркБезНаименования");

	// Проверка
	Ожидаем.Что(ДескрипторСНаименованием.Наименование()).Равно("Тестовое наименование бенчмарка");
	Ожидаем.Что(ДескрипторБезНаименования.Наименование()).Равно("");

КонецПроцедуры

&Тест
Процедура ТестДолжен_УстановитьНаименованиеЧерезМетодДескриптора() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Дескриптор = ДескрипторыБенчмарков.ПолучитьПервый();

	// Действие
	Дескриптор.УстановитьНаименование("Мое наименование");

	// Проверка
	Ожидаем.Что(Дескриптор.Наименование()).Равно("Мое наименование");

КонецПроцедуры

#КонецОбласти
