#Использовать asserts
#Использовать ".."

#Область Тесты

&Тест
Процедура ТестДолжен_ВернутьИменаТиповСобытийВыполнения() Экспорт

	// Действие и Проверка
	Ожидаем.Что(ТипыСобытийВыполненияБенчмарков.ЗапускБенчмарковНачат()).Равно("ЗапускБенчмарковНачат");
	Ожидаем.Что(ТипыСобытийВыполненияБенчмарков.ИсполняющаяСредаБенчмарковНачата()).Равно("ИсполняющаяСредаБенчмарковНачата");
	Ожидаем.Что(ТипыСобытийВыполненияБенчмарков.ВыводПроцессаПолучен()).Равно("ВыводПроцессаПолучен");
	Ожидаем.Что(ТипыСобытийВыполненияБенчмарков.КейсБенчмаркаНачат()).Равно("КейсБенчмаркаНачат");
	Ожидаем.Что(ТипыСобытийВыполненияБенчмарков.ИтерацияБенчмаркаЗавершена()).Равно("ИтерацияБенчмаркаЗавершена");
	Ожидаем.Что(ТипыСобытийВыполненияБенчмарков.СтатистикаКейсаРассчитана()).Равно("СтатистикаКейсаРассчитана");
	Ожидаем.Что(ТипыСобытийВыполненияБенчмарков.КейсБенчмаркаЗавершен()).Равно("КейсБенчмаркаЗавершен");
	Ожидаем.Что(ТипыСобытийВыполненияБенчмарков.ЗапускБенчмарковЗавершен()).Равно("ЗапускБенчмарковЗавершен");
	Ожидаем.Что(ТипыСобытийВыполненияБенчмарков.АртефактыСформированы()).Равно("АртефактыСформированы");

КонецПроцедуры

#КонецОбласти
