#Использовать asserts
#Использовать delegate
#Использовать fs
#Использовать "helpers"

&После
Процедура ПослеЗапускаТеста() Экспорт
	
	КаталогАртефактов = ".\BenchmarkArtifacts";

	ФС.УдалитьФайлы(КаталогАртефактов);

КонецПроцедуры

&Тест
Процедура Тест_ЭкспортВMarkdown() Экспорт
	
	Тип = Тип("БенчмаркиДляЭкспорта");
	ОбработчикПослеКаждого = Новый Делегат(ТестированиеБенчмарков, "ОбработчикПослеКаждого_УстановкаВремени");
	ОбработчикПослеВсех = Новый Делегат(ТестированиеБенчмарков, "ОбработчикПослеВсех_УстановкаМокСредыОкружения");

	ЧтениеТекста = Новый ЧтениеТекста("tests/fixtures/verified-report.md", "UTF-8");
	ТекстЭталон = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);
	Конфигурация.ДобавитьОбработчикСобытия(СобытияБенчмарков.ПослеКаждого, ОбработчикПослеКаждого);
	Конфигурация.ДобавитьОбработчикСобытия(СобытияБенчмарков.ПослеВсех, ОбработчикПослеВсех);
	Конфигурация.ДобавитьЭкспортер(ЭкспортерыРезультатовБенчмарков.Markdown);
	
	ПутьКФайлу = ОбъединитьПути(Конфигурация.КаталогАртефактов(), "БенчмаркиДляЭкспорта-report.md");

	Бенчмаркинг.Запустить(Тип, Конфигурация);

	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, "UTF-8");
	Текст = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	Ожидаем.Что(Текст).Равно(ТекстЭталон);
	
КонецПроцедуры

&Тест
Процедура Тест_ЭкспортВJson() Экспорт
	
	Тип = Тип("БенчмаркиДляЭкспорта");
	ОбработчикПослеКаждого = Новый Делегат(ТестированиеБенчмарков, "ОбработчикПослеКаждого_УстановкаВремени");
	ОбработчикПослеВсех = Новый Делегат(ТестированиеБенчмарков, "ОбработчикПослеВсех_УстановкаМокСредыОкружения");

	ЧтениеТекста = Новый ЧтениеТекста("tests/fixtures/verified-report.json", "UTF-8");
	ТекстЭталон = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	Конфигурация
		.ДобавитьОбработчикСобытия(СобытияБенчмарков.ПослеКаждого, ОбработчикПослеКаждого)
		.ДобавитьОбработчикСобытия(СобытияБенчмарков.ПослеВсех, ОбработчикПослеВсех)
		.ДобавитьЭкспортер(ЭкспортерыРезультатовБенчмарков.Json)
		.УстановитьКоличествоИтераций(10);
	
	ПутьКФайлу = ОбъединитьПути(Конфигурация.КаталогАртефактов(), "БенчмаркиДляЭкспорта-report.json");

	Бенчмаркинг.Запустить(Тип, Конфигурация);

	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, "UTF-8");
	Текст = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	Ожидаем.Что(Текст).Равно(ТекстЭталон);
	
КонецПроцедуры

&Тест
Процедура Тест_ЭкспортВHtml() Экспорт
	
	Тип = Тип("БенчмаркиДляЭкспорта");
	ОбработчикПослеКаждого = Новый Делегат(ТестированиеБенчмарков, "ОбработчикПослеКаждого_УстановкаВремени");
	ОбработчикПослеВсех = Новый Делегат(ТестированиеБенчмарков, "ОбработчикПослеВсех_УстановкаМокСредыОкружения");

	ЧтениеТекста = Новый ЧтениеТекста("tests/fixtures/verified-report.html", "UTF-8");
	ТекстЭталон = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);
	Конфигурация.ДобавитьОбработчикСобытия(СобытияБенчмарков.ПослеКаждого, ОбработчикПослеКаждого);
	Конфигурация.ДобавитьОбработчикСобытия(СобытияБенчмарков.ПослеВсех, ОбработчикПослеВсех);
	Конфигурация.ДобавитьЭкспортер(ЭкспортерыРезультатовБенчмарков.Html);
	
	ПутьКФайлу = ОбъединитьПути(Конфигурация.КаталогАртефактов(), "БенчмаркиДляЭкспорта-report.html");

	Бенчмаркинг.Запустить(Тип, Конфигурация);

	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, "UTF-8");
	Текст = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	Ожидаем.Что(Текст).Равно(ТекстЭталон);
	
КонецПроцедуры