// BSLLS:LineLength-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать tempfiles
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

Перем _МенеджерВременныхФайлов; // МенеджерВременныхФайлов
Перем _ИсходныйТаймаутПроцесса; // Строка

#Область ОбработчикиСобытий

&Инициализация
Процедура ПередВсеми() Экспорт

	_МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов();
	_ИсходныйТаймаутПроцесса = ПолучитьПеременнуюСреды("BENCHOS_PROCESS_TIMEOUT");

КонецПроцедуры

&Завершение
Процедура ПослеВсех() Экспорт

	_МенеджерВременныхФайлов.Удалить();

КонецПроцедуры

&После
Процедура ПослеКаждого() Экспорт

	УстановитьПеременнуюСреды("BENCHOS_PROCESS_TIMEOUT", _ИсходныйТаймаутПроцесса);

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ЗапуститьБенчмаркВДочернемПроцессе() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Менеджер = НовыйМенеджерПроцессов(Тип, ДескрипторыБенчмарков);
	Кейс = Новый КейсБенчмарка(1, ДескрипторыБенчмарков.ПолучитьПервый());

	// Действие
	Результат = Менеджер.ЗапуститьПроцесс(Кейс);

	// Проверка
	Ожидаем.Что(Результат).Заполнено();
	Ожидаем.Что(Результат.ДескрипторыБенчмарков.Количество()).Равно(1);
	Ожидаем.Что(Результат.ДескрипторыБенчмарков.ПолучитьПервый().ТипКласса()).Равно(Тип);
	Ожидаем.Что(Результат.Запуски.Количество()).Равно(1);
	Ожидаем.Что(Результат.Запуски[0].Кейс.Идентификатор()).Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьНесколькоКейсовВДочернемПроцессе() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиМетода");
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Конфигурация = КонфигурацияДляТестов(Тип);
	ГенераторКейсов = Новый ГенераторКейсовБенчмарков(ДескрипторыБенчмарков, Конфигурация);
	Кейсы = ГенераторКейсов.СгенерироватьВсеКейсы();
	Менеджер = Новый МенеджерПроцессовБенчмарков(
		ДескрипторыБенчмарков,
		Конфигурация,
		Новый НулевойРепортерБенчмарков()
	);

	// Действие
	Результат = Менеджер.ЗапуститьПроцесс(Кейсы);

	// Проверка
	Ожидаем.Что(Результат).Заполнено();
	Ожидаем.Что(Результат.Запуски.Количество()).Равно(2);
	Ожидаем.Что(Результат.Запуски[0].Кейс.Идентификатор()).Равно(1);
	Ожидаем.Что(Результат.Запуски[1].Кейс.Идентификатор()).Равно(2);
	Ожидаем.Что(Результат.Запуски[0].Кейс.Параметры()[0].Значение()).Равно(10);
	Ожидаем.Что(Результат.Запуски[0].Кейс.Параметры()[1].Значение()).Равно(100);
	Ожидаем.Что(Результат.Запуски[1].Кейс.Параметры()[0].Значение()).Равно(20);
	Ожидаем.Что(Результат.Запуски[1].Кейс.Параметры()[1].Значение()).Равно(200);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьБенчмаркВДочернемПроцессеСФактическимТипом() Экспорт

	// Подготовка
	Каталог = _МенеджерВременныхФайлов.СоздатьКаталог();
	ПутьКФайлуБенчмарка = ОбъединитьПути(Каталог, "ПустойБенчмарк.os");
	ЗаписатьТекст(
		ПутьКФайлуБенчмарка,
		"
		|&Бенчмарк
		|Процедура Бенчмарк() Экспорт
		|КонецПроцедуры"
	);

	ПодключенныйТип = Бенчмаркинг.ПодключитьБенчмарк(ПутьКФайлуБенчмарка);
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(ПодключенныйТип);
	Менеджер = НовыйМенеджерПроцессов(ПодключенныйТип, ДескрипторыБенчмарков);
	Кейс = Новый КейсБенчмарка(1, ДескрипторыБенчмарков.ПолучитьПервый());

	// Действие
	Результат = Менеджер.ЗапуститьПроцесс(Кейс);

	// Проверка
	Ожидаем.Что(Строка(ПодключенныйТип)).Не_().Равно("ПустойБенчмарк");
	Ожидаем.Что(Результат).Заполнено();
	Ожидаем.Что(Результат.ДескрипторыБенчмарков.ПолучитьПервый().ТипКласса()).Равно(ПодключенныйТип);
	Ожидаем.Что(Результат.Запуски[0].Кейс.ДескрипторБенчмарка().ТипКласса()).Равно(ПодключенныйТип);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеЕслиДочернийПроцессЗавершилсяСОшибкой() Экспорт

	// Подготовка
	ПутьКФайлуБенчмарка = ПолныйПутьКФайлу("./tests/fixtures/БенчмаркиСОшибкой/БенчмаркСОшибкой.os");
	Тип = Бенчмаркинг.ПодключитьБенчмарк(ПутьКФайлуБенчмарка);
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Менеджер = НовыйМенеджерПроцессов(Тип, ДескрипторыБенчмарков);
	Кейс = Новый КейсБенчмарка(1, ДескрипторыБенчмарков.ПолучитьПервый());

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Кейс);

	// Действие и Проверка
	Ожидаем
		.Что(Менеджер)
		.Метод("ЗапуститьПроцесс", ПараметрыМетода)
		.ВыбрасываетИсключение("Завершение процесса с ошибкой");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПрерватьДочернийПроцессПоТаймаутуИзПеременнойСреды() Экспорт

	// Подготовка
	Каталог = _МенеджерВременныхФайлов.СоздатьКаталог();
	ПутьКФайлуБенчмарка = ОбъединитьПути(Каталог, "ДолгийБенчмарк.os");
	ЗаписатьТекст(
		ПутьКФайлуБенчмарка,
		"
		|&Бенчмарк
		|Процедура Бенчмарк() Экспорт
		|	Приостановить(2000);
		|КонецПроцедуры"
	);

	Тип = Бенчмаркинг.ПодключитьБенчмарк(ПутьКФайлуБенчмарка);
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Менеджер = НовыйМенеджерПроцессов(Тип, ДескрипторыБенчмарков);
	Кейс = Новый КейсБенчмарка(1, ДескрипторыБенчмарков.ПолучитьПервый());

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Кейс);

	УстановитьПеременнуюСреды("BENCHOS_PROCESS_TIMEOUT", "1");

	// Действие и Проверка
	Ожидаем
		.Что(Менеджер)
		.Метод("ЗапуститьПроцесс", ПараметрыМетода)
		.ВыбрасываетИсключение("Превышено время ожидания (1 сек.) завершения дочернего процесса");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйМенеджерПроцессов(Тип, ДескрипторыБенчмарков)

	Возврат Новый МенеджерПроцессовБенчмарков(
		ДескрипторыБенчмарков,
		КонфигурацияДляТестов(Тип),
		Новый НулевойРепортерБенчмарков()
	);

КонецФункции

Функция КонфигурацияДляТестов(Тип)

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);
	Конфигурация.УдалитьМониторингПамяти();

	Возврат Конфигурация;

КонецФункции

Функция ПолныйПутьКФайлу(ПутьКФайлу)
	Возврат ФС.НормализоватьПуть(ОбъединитьПути(ТекущийКаталог(), ПутьКФайлу));
КонецФункции

Процедура ЗаписатьТекст(ПутьКФайлу, Текст)

	ЗаписьТекста = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	ЗаписьТекста.Записать(Текст);
	ЗаписьТекста.Закрыть();

КонецПроцедуры

#КонецОбласти
