// BSLLS:LineLength-off

#Использовать asserts
#Использовать fs
#Использовать logos
#Использовать tempfiles
#Использовать "helpers"

Перем _МенеджерВременныхФайлов; // МенеджерВременныхФайлов

&Инициализация
Процедура ПередВсеми() Экспорт

	_МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов();

КонецПроцедуры

&Завершение
Процедура ПослеВсех() Экспорт

	_МенеджерВременныхФайлов.Удалить();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПодготовитьКаждыйОбычныйФайлИзЯвногоСписка() Экспорт

	// Действие
	Сообщения = ВыполнитьСЗахватомЛогаПодготовителя(
		МассивФайлов(
			"./tests/fixtures/АлгоритмБезАннотации.os",
			"./tests/fixtures/АлгоритмБезАннотации2.os"
		)
	);

	// Проверка
	Ожидаем.Что(Сообщения).ИмеетДлину(2);
	Ожидаем.Что(Сообщения[0]).Содержит("для запуска алгоритма из <" + ПолныйПутьКФайлу("./tests/fixtures/АлгоритмБезАннотации.os") + ">");
	Ожидаем.Что(Сообщения[1]).Содержит("для запуска алгоритма из <" + ПолныйПутьКФайлу("./tests/fixtures/АлгоритмБезАннотации2.os") + ">");

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеПодготавливатьАннотированныйФайл() Экспорт

	// Действие
	Сообщения = ВыполнитьСЗахватомЛогаПодготовителя(
		МассивФайлов(
			"./tests/fixtures/benchmarks/Классы/ПустойБенчмарк.os",
			"ФайлКоторогоНеСуществуетДляТестаЗапускателя.os"
		)
	);

	// Проверка
	Ожидаем.Что(Сообщения).ИмеетДлину(0);

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеПодготавливатьФайлыИзКаталогаСКлассическимиБенчмарками() Экспорт

	// Действие
	Сообщения = ВыполнитьСЗахватомЛогаПодготовителя(
		МассивФайлов(
			"./tests/fixtures/БенчмаркиЧерезКаталог",
			"ФайлКоторогоНеСуществуетДляТестаЗапускателя.os"
		)
	);

	// Проверка
	Ожидаем.Что(Сообщения).ИмеетДлину(0);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИгнорироватьОдинаковыйФайлПереданныйОтносительнымИАбсолютнымПутем() Экспорт

	// Подготовка
	ОтносительныйПуть = "./tests/fixtures/АлгоритмБезАннотации.os";
	АбсолютныйПуть = ПолныйПутьКФайлу(ОтносительныйПуть);

	// Действие
	Сообщения = ВыполнитьСЗахватомЛогаПодготовителя(
		МассивФайлов(
			ОтносительныйПуть,
			АбсолютныйПуть
		)
	);

	// Проверка
	Ожидаем.Что(Сообщения).ИмеетДлину(1);
	Ожидаем.Что(Сообщения[0]).Содержит("для запуска алгоритма из <" + АбсолютныйПуть + ">");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗаписатьПредупреждениеЕслиНеНайденыФайлыБенчмарков() Экспорт

	// Подготовка
	Лог = Логирование.ПолучитьЛог("oscript.lib.benchmark.ЗапускательФайловБенчмарков");
	ПредыдущийУровень = Лог.Уровень();
	Аппендер = ЗагрузитьСценарий(ПолныйПутьКФайлу("./tests/fixtures/АппендерЛога.os"));

	Лог.УстановитьУровень(УровниЛога.Предупреждение);
	Лог.ДобавитьСпособВывода(Аппендер, УровниЛога.Предупреждение);

	// Действие
	Попытка
		Запускатель = Новый ЗапускательФайловБенчмарков(Новый Массив());
		Запускатель.Запустить();

		Сообщения = Аппендер.ПолучитьСообщения();
	Исключение
		Лог.УдалитьСпособВывода(Аппендер);
		Лог.УстановитьУровень(ПредыдущийУровень);
		ВызватьИсключение;
	КонецПопытки;

	Лог.УдалитьСпособВывода(Аппендер);
	Лог.УстановитьУровень(ПредыдущийУровень);
	
	// Проверка
	Ожидаем.Что(Сообщения).ИмеетДлину(1);
	Ожидаем.Что(Сообщения[0]).Равно("ПРЕДУПРЕЖДЕНИЕ - Не найдено ни одного файла с бенчмарками для запуска");

КонецПроцедуры

&Тест
Процедура ТестДолжен_УдалитьВременныеФайлыПриОшибкеПодготовкиОбычногоФайла() Экспорт

	// Подготовка
	ВременныеФайлыДоЗапуска = НайтиВременныеOSФайлы();

	МассивФайлов = Новый Массив();
	МассивФайлов.Добавить("./tests/fixtures/АлгоритмБезАннотации.os");
	МассивФайлов.Добавить("ФайлКоторогоНеСуществуетДляТестаЗапускателя.os");

	// Действие
	Запускатель = Новый ЗапускательФайловБенчмарков(МассивФайлов);

	// Проверка
	Ожидаем
		.Что(Запускатель)
		.Метод("Запустить")
		.ВыбрасываетИсключение("Файл <ФайлКоторогоНеСуществуетДляТестаЗапускателя.os> не существует");

	Ожидаем.Что(НайтиНовыеВременныеФайлы(ВременныеФайлыДоЗапуска, НайтиВременныеOSФайлы())).ИмеетДлину(0);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СобратьОдинОтчетПоБенчмаркамАлгоритмам() Экспорт

	// Подготовка
	КаталогАртефактов = _МенеджерВременныхФайлов.СоздатьКаталог();

	Настройки = Новый НастройкиЗапускаБенчмарков();
	Настройки.Конфигурация = ТестированиеБенчмарков
		.КонфигурацияПоУмолчанию()
		.ДобавитьЭкспортер(ЭкспортерыРезультатовБенчмарков.Json)
		.УстановитьКаталогАртефактов(КаталогАртефактов);
		
	Запускатель = Новый ЗапускательФайловБенчмарков(
		МассивФайлов(
			"./tests/fixtures/benchmarks/Классы/ПустойБенчмарк.os",
			"./tests/fixtures/АлгоритмБезАннотации.os",
			"./tests/fixtures/АлгоритмБезАннотации2.os"
		),
		Ложь,
		Настройки
	);

	// Действие
	Запускатель.Запустить();

	// Проверка
	ПутьКФайлуОтчета = ОбъединитьПути(КаталогАртефактов, "benchmarks-report.json");
	Файлы = НайтиФайлы(КаталогАртефактов, "*.json");

	Ожидаем.Что(Файлы, "Должно быть создано два файла отчета").ИмеетДлину(2);
	
	Ожидаем
		.Что(
			ФС.ФайлСуществует(ПутьКФайлуОтчета),
			"Файл отчета бенчмарков без аннотаций не создан")
		.ЭтоИстина();

	Ожидаем
		.Что(
			ФС.ФайлСуществует(ОбъединитьПути(КаталогАртефактов, "АлгоритмБезАннотации-report.json")),
			"Файла отчета для АлгоритмБезАннотации не должен быть создан")
		.ЭтоЛожь();

	Ожидаем
		.Что(
			ФС.ФайлСуществует(ОбъединитьПути(КаталогАртефактов, "АлгоритмБезАннотации2-report.json")),
			"Файла отчета для АлгоритмБезАннотации2 не должен быть создан")
		.ЭтоЛожь();

	Сериализатор = Новый СериализаторРезультатовБенчмарков();
	РезультатЗапуска = Сериализатор.ПрочитатьИзJson(ПутьКФайлуОтчета);

	Ожидаем
		.Что(
			РезультатЗапуска.ДескрипторыБенчмарков.Количество(),
			"Неверное количество дескрипторов бенчмарков")
		.Равно(2);

	Ожидаем
		.Что(
			РезультатЗапуска.Запуски,
			"Неверное количество запусков")
		.ИмеетДлину(2);

	Ожидаем
		.Что(
			РезультатЗапуска.Отчет.Таблица,
			"Неверное количество строк в отчете")
		.ИмеетДлину(2);

	ИменаБенчмарков = РезультатЗапуска.Отчет.Таблица.ВыгрузитьКолонку(КолонкиОтчетаБенчмарков.Метод);

	Ожидаем
		.Что(
			ИменаБенчмарков.Найти("АлгоритмБезАннотации"),
			"Бенчмарк АлгоритмБезАннотации не найден в отчете")
		.Не_().Равно(Неопределено);

	Ожидаем
		.Что(
			ИменаБенчмарков.Найти("АлгоритмБезАннотации2"),
			"Бенчмарк АлгоритмБезАннотации2 не найден в отчете")
		.Не_().Равно(Неопределено);

КонецПроцедуры

Функция ВыполнитьСЗахватомЛогаПодготовителя(МассивФайлов)

	Лог = Логирование.ПолучитьЛог("oscript.lib.benchmark.ПодготовительФайлаБенчмарка");
	ПредыдущийУровень = Лог.Уровень();
	Аппендер = ЗагрузитьСценарий(ПолныйПутьКФайлу("./tests/fixtures/АппендерЛога.os"));

	Лог.УстановитьУровень(УровниЛога.Отладка);
	Лог.ДобавитьСпособВывода(Аппендер, УровниЛога.Отладка);

	МассивФайлов.Добавить("ФайлКоторогоНеСуществуетДляТестаЗапускателя.os");

	Попытка
		Запускатель = Новый ЗапускательФайловБенчмарков(МассивФайлов);

		Ожидаем
			.Что(Запускатель)
			.Метод("Запустить")
			.ВыбрасываетИсключение("Файл <ФайлКоторогоНеСуществуетДляТестаЗапускателя.os> не существует");

		Сообщения = Аппендер.ПолучитьСообщения();
	Исключение
		Лог.УдалитьСпособВывода(Аппендер);
		Лог.УстановитьУровень(ПредыдущийУровень);
		ВызватьИсключение;
	КонецПопытки;

	Лог.УдалитьСпособВывода(Аппендер);
	Лог.УстановитьУровень(ПредыдущийУровень);

	Возврат Сообщения;

КонецФункции

Функция ПолныйПутьКФайлу(ПутьКФайлу)
	Возврат ФС.НормализоватьПуть(ОбъединитьПути(ТекущийКаталог(), ПутьКФайлу));
КонецФункции

Функция МассивФайлов(Путь1, Путь2 = Неопределено, Путь3 = Неопределено)

	Результат = Новый Массив();
	Результат.Добавить(Путь1);

	Если Путь2 <> Неопределено Тогда
		Результат.Добавить(Путь2);
	КонецЕсли;

	Если Путь3 <> Неопределено Тогда
		Результат.Добавить(Путь3);
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция НайтиВременныеOSФайлы()

	ВременныеOSФайлы = Новый Массив();

	Для Каждого Файл Из НайтиФайлы(КаталогВременныхФайлов(), "*.os", Ложь) Цикл
		ВременныеOSФайлы.Добавить(Файл.ПолноеИмя);
	КонецЦикла;

	Возврат ВременныеOSФайлы;

КонецФункции

Функция НайтиНовыеВременныеФайлы(ВременныеФайлыДоЗапуска, ВременныеФайлыПослеЗапуска)

	НовыеФайлы = Новый Массив();

	Для Каждого ПолноеИмяФайла Из ВременныеФайлыПослеЗапуска Цикл
		Если ВременныеФайлыДоЗапуска.Найти(ПолноеИмяФайла) = Неопределено Тогда
			НовыеФайлы.Добавить(ПолноеИмяФайла);
		КонецЕсли;
	КонецЦикла;

	Возврат НовыеФайлы;

КонецФункции