// BSLLS:LineLength-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off

#Использовать asserts
#Использовать fs
#Использовать tempfiles
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

Перем МенеджерВременныхФайлов; // МенеджерВременныхФайлов

&Инициализация
Процедура ПередВсеми() Экспорт
	МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов();
КонецПроцедуры

&Завершение
Процедура ПослеВсех() Экспорт
	МенеджерВременныхФайлов.Удалить();
КонецПроцедуры

&После
Процедура ПослеЗапускаТеста() Экспорт
	
	КаталогАртефактов = ".\BenchmarkArtifacts";

	ФС.УдалитьФайлы(КаталогАртефактов);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СериализоватьИДесериализовать() Экспорт

	Если ТестированиеБенчмарков.ЭтоOneScript1() Тогда
		Возврат;
	КонецЕсли;

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиМетодаИПоля");
	ТестированиеБенчмарков.ПодготовитьСреду("dev");
	
	// Настройка дескриптора бенчмарка
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	ДескрипторБенчмарка = ДескрипторыБенчмарков
		.ПолучитьПервый()
		.УстановитьКатегорию("Категория 1");

	// Настройка конфигурации
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	ОбработчикСобытия = Новый ОбработчикСобытияБенчмарка(
		"ОбработчикиСобытийБенчмарков.УстановкаМокСредыОкружения",
		СобытияБенчмарков.ПослеВсех);

	Конфигурация
		.ДобавитьОбработчикСобытия(ОбработчикСобытия)
		.ОчиститьПараметры()
		.ДобавитьПараметр("ПолеОбщее", '19700101')
		.ДобавитьПараметр("ПолеОбщее", Неопределено)
		.ДобавитьИсточникПараметров("ПолеОбщее", "СоставныеПараметры")
		.ДобавитьЭкспортер(ЭкспортерыРезультатовБенчмарков.Json)
		.ДобавитьВерсиюИсполняющейСреды("dev", "develop");

	// Действие	
	Результат = Бенчмаркинг.Запустить(ДескрипторыБенчмарков, Конфигурация);

	ИмяФайла = МенеджерВременныхФайлов.НовоеИмяФайла();
	Сериализатор = Новый СериализаторРезультатовБенчмарков();
	Сериализатор.ЗаписатьВJson(Результат, ИмяФайла);
	РезультатПрочитанный = Сериализатор.ПрочитатьИзJson(ИмяФайла);

	// Проверка

	// Среда окружения
	СредаОкружения = РезультатПрочитанный.СредаОкружения;

	Ожидаем.Что(СредаОкружения, "Среда окружения").ИмеетТип("СредаОкруженияБенчмарков");
	Ожидаем.Что(СредаОкружения.ВерсияБиблиотеки, "Версия библиотеки").Равно("0.1.x-mock");
	Ожидаем.Что(СредаОкружения.ВерсияОС, "Версия ОС").Равно("Microsoft Windows NT 10.0.x.mock");
	Ожидаем.Что(СредаОкружения.ВерсияИсполняющейСреды, "Версия исполняющей среды").Равно("2.0.0-mock");
	Ожидаем.Что(СредаОкружения.ИнформацияОПроцессоре, "Информация о процессоре").ИмеетТип("ИнформацияОПроцессоре");
	Ожидаем.Что(СредаОкружения.ИнформацияОПроцессоре.ИмяПроцессора, "Имя процессора").Равно("MockIntel Core i7-6700HQ CPU 2.60GHz");

	// Дескрипторы бенчмарков
	ДескрипторыБенчмарков = РезультатПрочитанный.ДескрипторыБенчмарков;

	Ожидаем.Что(ДескрипторыБенчмарков, "Дескрипторы бенчмарков").ИмеетТип("КоллекцияДескрипторовБенчмарков");
	Ожидаем.Что(ДескрипторыБенчмарков.Количество(), "Дескрипторы бенчмарков").Равно(1);
	
	// Дескриптор бенчмарков
	ДескрипторБенчмарка = ДескрипторыБенчмарков.ПолучитьПервый();
	НаборыПараметров = ДескрипторБенчмарка.НаборыПараметров();

	Ожидаем.Что(ДескрипторБенчмарка, "Дескриптор бенчмарков").ИмеетТип("ДескрипторБенчмарка");
	Ожидаем.Что(ДескрипторБенчмарка.ТипОбъекта(), "Тип").Равно(Тип);
	Ожидаем.Что(ДескрипторБенчмарка.Метод(), "Метод").Равно("Бенчмарк");
	Ожидаем.Что(ДескрипторБенчмарка.Категория(), "Категория").Равно("Категория 1");
	Ожидаем.Что(ДескрипторБенчмарка.ЭтоЭталон(), "Эталон").ЭтоЛожь();	
	Ожидаем.Что(НаборыПараметров, "Наборы параметров").ИмеетДлину(2);
	Ожидаем.Что(НаборыПараметров[0], "Набор параметров 1").ИмеетДлину(2);
	Ожидаем.Что(НаборыПараметров[0].Получить(0).Значение(), "Набор параметров 1").Равно(3);
	Ожидаем.Что(НаборыПараметров[0].Получить(1).Значение(), "Набор параметров 1").Равно(4);
	Ожидаем.Что(НаборыПараметров[1], "Набор параметров 2").ИмеетДлину(2);
	Ожидаем.Что(НаборыПараметров[1].Получить(0).Значение(), "Набор параметров 2").Равно(5);
	Ожидаем.Что(НаборыПараметров[1].Получить(1).Значение(), "Набор параметров 2").Равно(6);

	// Запуски
	Запуски = РезультатПрочитанный.Запуски;

	Ожидаем.Что(Запуски, "Количество запусков").ИмеетДлину(10);
	Ожидаем.Что(Запуски[0].ДескрипторБенчмарка, "Должен быть создан один объект дескриптора").Равно(Запуски[1].ДескрипторБенчмарка);
	Ожидаем.Что(Запуски[0].ДескрипторБенчмарка, "Дескриптор из запусков должен совпадать с дескриптором из коллекции дескрипторов").Равно(ДескрипторБенчмарка);
	Ожидаем.Что(Запуски[0].Параметры, "Количество строк в параметрах").ИмеетДлину(3);
	Ожидаем.Что(Запуски[0].Параметры[0].Значение(), "Параметр 1.1").Равно('19700101'); // Дата
	Ожидаем.Что(Запуски[0].Параметры[1].Значение(), "Параметр 1.2").Равно(3);
	Ожидаем.Что(Запуски[0].Параметры[2].Значение(), "Параметр 1.3").Равно(4);
	Ожидаем.Что(Запуски[1].Параметры[0].Значение(), "Параметр 2.1").Равно(Неопределено); // Неопределено
	Ожидаем.Что(Запуски[2].Параметры[0].Значение(), "Параметр 3.1").ИмеетТип("Массив"); // ТаблицаЗначений
	Ожидаем.Что(Запуски[2].Параметры[0].Значение()[0].Колонка, "Параметр 3.1").Равно(1);
	Ожидаем.Что(Запуски[3].Параметры[0].Значение(), "Параметр 4.1").Равно(Неопределено); // ЧтениеXML
	Ожидаем.Что(Запуски[3].Параметры[0].Представление(), "Параметр 4.1").Равно("ЧтениеXML"); // ЧтениеXML
	Ожидаем.Что(Запуски[4].Параметры[0].Значение(), "Параметр 5.1").ИмеетТип("Структура"); // БенчмаркСПараметрамиМетодаИПоля
	Ожидаем.Что(Запуски[4].Параметры[0].Представление(), "Параметр 5.1").Равно("БенчмаркСПараметрамиМетодаИПоля"); // БенчмаркСПараметрамиМетодаИПоля
	Ожидаем.Что(Запуски[0].ЭтоЭталон, "Это не эталон").ЭтоЛожь();
	Ожидаем.Что(Запуски[0].ИсполняющаяСреда.Версия, "Версия").Заполнено();
	Ожидаем.Что(Запуски[0].Замеры, "Количество строк в замерах").ИмеетДлину(1);
	Ожидаем.Что(Запуски[0].Замеры[0].Этап, "Этап").Равно(ЭтапыБенчмарка.Измерение);
	Ожидаем.Что(Запуски[0].Замеры[0].НомерИтерации, "Номер итерации").Равно(1);
	Ожидаем.Что(Запуски[0].Замеры[0].Наносекунд, "Наносекунд").Больше(100);
	Ожидаем.Что(Запуски[0].Статистика.Среднее, "Среднее").Больше(100);

	// Отчет
	Отчет = РезультатПрочитанный.Отчет;

	Ожидаем.Что(Отчет, "Отчет").ИмеетТип("ОтчетБенчмарков");
	Ожидаем.Что(Отчет.Таблица, "Таблица").ИмеетТип("ТаблицаЗначений");
	Ожидаем.Что(Отчет.Таблица, "Таблица").ИмеетДлину(10);
	Ожидаем.Что(Отчет.Таблица[0].Метод, "Метод").Равно("Бенчмарк");
	Ожидаем.Что(Отчет.Таблица[0].Категория, "Категория").Равно("Категория 1");
	Ожидаем.Что(Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Параметр("ПолеОбщее")], "ПолеОбщее (1)").Равно(""); // Неопределено
	Ожидаем.Что(Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Параметр("Парам1")], "Парам1 (1)").Равно(3);
	Ожидаем.Что(Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Параметр("Парам2")], "Парам2 (1)").Равно(4);
	Ожидаем.Что(Отчет.Таблица[1][КолонкиОтчетаБенчмарков.Параметр("ПолеОбщее")], "ПолеОбщее (2)").Равно(""); // Неопределено
	Ожидаем.Что(Отчет.Таблица[1][КолонкиОтчетаБенчмарков.Параметр("Парам1")], "Парам1 (2)").Равно(5);
	Ожидаем.Что(Отчет.Таблица[1][КолонкиОтчетаБенчмарков.Параметр("Парам2")], "Парам2 (2)").Равно(6);
	Ожидаем.Что(Отчет.Таблица[2][КолонкиОтчетаБенчмарков.Параметр("ПолеОбщее")], "ПолеОбщее (3)").Равно("БенчмаркСПараметрамиМетодаИПоля");
	Ожидаем.Что(Отчет.Таблица[4][КолонкиОтчетаБенчмарков.Параметр("ПолеОбщее")], "ПолеОбщее (5)").Равно("ТаблицаЗначений");
	Ожидаем.Что(Отчет.Таблица[6][КолонкиОтчетаБенчмарков.Параметр("ПолеОбщее")], "ПолеОбщее (7)").Равно("ЧтениеXML");
	Ожидаем.Что(Отчет.Таблица[8][КолонкиОтчетаБенчмарков.Параметр("ПолеОбщее")], "ПолеОбщее (9)").Равно('19700101');

	// Конфигурация
	Конфигурация = РезультатПрочитанный.Конфигурация;

	Ожидаем.Что(Конфигурация, "Конфигурация").ИмеетТип("КонфигурацияБенчмарков");
	Ожидаем.Что(Конфигурация.Параметры(), "Параметры").ИмеетДлину(2);
	Ожидаем.Что(Конфигурация.Параметры()[0].Имя(), "Параметр 1").Равно("ПолеОбщее");
	Ожидаем.Что(Конфигурация.Параметры()[0].Значение(), "Параметр 1").Равно('19700101');
	Ожидаем.Что(Конфигурация.Параметры()[1].Имя(), "Параметр 2").Равно("ПолеОбщее");
	Ожидаем.Что(Конфигурация.Параметры()[1].Значение(), "Параметр 2").Равно(Неопределено);
	Ожидаем.Что(Конфигурация.ИсточникиПараметров(), "Источники параметров").ИмеетДлину(1);
	Ожидаем.Что(Конфигурация.ИсточникиПараметров()[0].ИмяПоля, "Источник параметров 1").Равно("ПолеОбщее");
	Ожидаем.Что(Конфигурация.ИсточникиПараметров()[0].Источник, "Источник параметров 1").Равно("СоставныеПараметры");
	Ожидаем.Что(Конфигурация.ОбработчикиСобытий(), "Обработчики событий").ИмеетДлину(1);
	Ожидаем.Что(Конфигурация.ОбработчикиСобытий()[0].Событие(), "Обработчик события").Равно("ПослеВсех");
	Ожидаем.Что(Конфигурация.ОбработчикиСобытий()[0].ИмяМетода(), "Обработчик события").Равно("ОбработчикиСобытийБенчмарков.УстановкаМокСредыОкружения");
	Ожидаем.Что(Конфигурация.Экспортеры(), "Экспортеры").ИмеетДлину(1);
	Ожидаем.Что(Конфигурация.Экспортеры()[0], "Экспортер 1").ИмеетТип("ЭкспортерРезультатовБенчмарковВJson");
	Ожидаем.Что(Конфигурация.ВерсииИсполняющейСреды(), "Исполняющие среды").ИмеетДлину(1);
	Ожидаем.Что(Конфигурация.ВерсииИсполняющейСреды()[0].Версия, "Исполняющая среда 1").Заполнено();
	Ожидаем.Что(Конфигурация.ВерсииИсполняющейСреды()[0].Наименование, "Исполняющая среда 1").Равно("develop");
	Ожидаем.Что(Конфигурация.ВерсииИсполняющейСреды()[0].ЭтоЭталон, "Исполняющая среда 1").ЭтоЛожь();
	
КонецПроцедуры