// BSLLS:LineLength-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать fluent
#Использовать tempfiles
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

Перем _МенеджерВременныхФайлов; // МенеджерВременныхФайлов

#Область ОбработчикиСобытий

&Инициализация
Процедура ПередВсеми() Экспорт
	_МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов();
КонецПроцедуры

&Завершение
Процедура ПослеВсех() Экспорт
	_МенеджерВременныхФайлов.Удалить();
КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ДобавитьИсполняющуюСреду() Экспорт

	// Подготовка
	Конфигурация = Новый КонфигурацияБенчмарков();

	// Действие
	Конфигурация.ДобавитьИсполняющуюСреду("dev");

	// Проверка
	Ожидаем.Что(Конфигурация.ИсполняющиеСреды()).Заполнено();
	Ожидаем.Что(Конфигурация.ИсполняющиеСреды()[0].Версия).Равно("dev");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОчиститьИсполняющиеСреды() Экспорт

	// Подготовка
	Конфигурация = Новый КонфигурацияБенчмарков();
	Конфигурация.ДобавитьИсполняющуюСреду("dev");

	// Действие
	Конфигурация.ОчиститьИсполняющиеСреды();

	// Проверка
	Ожидаем.Что(Конфигурация.ИсполняющиеСреды()).ИмеетДлину(0);

КонецПроцедуры

#КонецОбласти
