// BSLLS:MagicNumber-off

#Использовать fluent
#Использовать asserts
#Использовать "helpers"

&Тест
Процедура ТестДолжен_ПрочитатьПустуюКоллекциюЗамеров() Экспорт

	// Подготовка
	Статистика = Новый СтатистикаБенчмарка();

	// Действие
	Статистика.Прочитать(Новый Массив());

	// Проверка
	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(0);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(0);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(0);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(0);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(0);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(0);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Равно(0);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Равно(0);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(0);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(0);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(0);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Равно(0);
	Ожидаем.Что(Статистика.ВыделяемаяПамять, "Выделяемая память").Равно(0);

КонецПроцедуры

&Тест
Процедура ТестДолжен_РассчитатьСтатистикуДляНечетногоКоличестваЗамеров() Экспорт
	
	ТестовыеЗамеры = ТестовыеЗамеры("12, 15, 22, 25, 17, 28, 14", "100, 101, 102");

	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры);

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(19);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(12);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(17);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(23.5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(6.05, 6.06);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.2, 2.3);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(12);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(14.8);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(17);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(52631578, 52631579);
	Ожидаем.Что(Статистика.ВыделяемаяПамять, "Выделяемая память").Равно(101);

КонецПроцедуры

&Тест
Процедура ТестДолжен_РассчитатьСтатистикуДляЧетногоКоличестваЗамеров() Экспорт
	
	ТестовыеЗамеры = ТестовыеЗамеры("12, 15, 22, 25, 17, 28, 20, 4", "100, 102");

	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры);

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(17.875);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(4);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(18.5);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.25);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(22.75);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(7.66, 7.67);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.7, 2.71);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(4);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(15.2);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(18.5);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(55944055, 55944056);
	Ожидаем.Что(Статистика.ВыделяемаяПамять, "Выделяемая память").Равно(101);

КонецПроцедуры

&Тест
Процедура ТестДолжен_РассчитатьСтатистикуДляОдинаковыхЗамеров() Экспорт
	
	ТестовыеЗамеры = ТестовыеЗамеры("5, 5, 5, 5", "100, 100");

	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры);

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(5);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(5);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(5);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(5);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Равно(0);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Равно(0);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(5);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(5);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(5);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(5);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Равно(200000000);
	Ожидаем.Что(Статистика.ВыделяемаяПамять, "Выделяемая память").Равно(100);

КонецПроцедуры

&Тест
Процедура ТестДолжен_РассчитатьСтатистикуДляОтрицательныхЗамеров() Экспорт
	
	ТестовыеЗамеры = ТестовыеЗамеры("-12, 15, -22, 25, 17, 28, 0, 4", "100, -100");

	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры);

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(6.875);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(-22);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(9.5);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(-3);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(19);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(17.68, 17.69);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(6.25, 6.26);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(-22);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(0.4);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(9.5);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(145454545, 145454546);
	Ожидаем.Что(Статистика.ВыделяемаяПамять, "Выделяемая память").Равно(0);

КонецПроцедуры

&Тест
Процедура ТестДолжен_КонвертироватьСтатистикуВМиллисекунды() Экспорт
	
	ОтношениеКБазовой = ЕдиницыИзмеренийБенчмарков.Миллисекунда.ОтношениеКБазовой;

	ТестовыеЗамеры = ТестовыеЗамеры("12, 15, 22, 25, 17, 28, 14", "100, 101", ОтношениеКБазовой);

	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры);
	Статистика.ВМиллисекунды();

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(19);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(12);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(17);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(23.5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(6.05, 6.06);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.2, 2.3);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(12);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(14.8);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(17);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(52.63, 52.64);

КонецПроцедуры

&Тест
Процедура ТестДолжен_КонвертироватьСтатистикуВСекунды() Экспорт
	
	ОтношениеКБазовой = ЕдиницыИзмеренийБенчмарков.Секунда.ОтношениеКБазовой;

	ТестовыеЗамеры = ТестовыеЗамеры("12, 15, 22, 25, 17, 28, 14", "100, 101", ОтношениеКБазовой);

	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры);
	Статистика.ВСекунды();

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(19);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(12);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(17);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(23.5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(6.05, 6.06);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.2, 2.3);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(12);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(14.8);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(17);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(0.0526, 0.0527);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВернутьСтатистикуВНаносекундахПослеОбратнойКонвертации() Экспорт
	
	ТестовыеЗамеры = ТестовыеЗамеры("12, 15, 22, 25, 17, 28, 14", "100, 101");

	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры);
	Статистика.ВСекунды().ВНаносекунды();

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(19);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(12);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(17);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(23.5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(6.05, 6.06);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.2, 2.3);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(12);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(14.8);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(17);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(52631578, 52631579);

КонецПроцедуры

&Тест
Процедура ТестДолжен_РазделитьСтатистику() Экспорт
	
	ТестовыеЗамеры1 = ТестовыеЗамеры("32, 16, 64, 128", "100, 102");
	ТестовыеЗамеры2 = ТестовыеЗамеры("2, 8, 16, 4", "50, 51");

	Статистика1 = Новый СтатистикаБенчмарка(ТестовыеЗамеры1);
	Статистика2 = Новый СтатистикаБенчмарка(ТестовыеЗамеры2);

	Статистика = Статистика1.Разделить(Статистика2);

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(14.0625);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(1);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(64);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(8);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(4);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(16);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(16.45, 16.46);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(4.1, 4.2);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(1);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(4);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(8);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(64);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(71111111, 71111112);
	Ожидаем.Что(Статистика.ВыделяемаяПамять, "Выделяемая память").Между(2, 2.1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПрочитатьЗамерыИзСтруктуры() Экспорт

	// Подготовка
	ЗамерыВремени = Новый Массив();
	ЗамерыВремени.Добавить(10);
	ЗамерыВремени.Добавить(20);

	ЗамерыПамяти = Новый Массив();
	ЗамерыПамяти.Добавить(100);
	ЗамерыПамяти.Добавить(200);

	Замеры = Новый Структура(
		"ЗамерыВремени, ЗамерыПамяти",
		ЗамерыВремени,
		ЗамерыПамяти
	);

	Статистика = Новый СтатистикаБенчмарка();

	// Действие
	Статистика.Прочитать(Замеры);

	// Проверка
	Ожидаем.Что(Статистика.КоличествоИтераций, "Количество итераций").Равно(2);
	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(15);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(10);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(20);
	Ожидаем.Что(Статистика.ВыделяемаяПамять, "Выделяемая память").Равно(150);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВернутьПроцентили() Экспорт

	// Подготовка
	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры("12, 15, 22, 25, 17, 28, 14", "100, 101"));

	// Действие
	Процентили = Статистика.ПолучитьПроцентили();

	// Проверка
	Ожидаем.Что(Процентили.P0, "P0").Равно(12);
	Ожидаем.Что(Процентили.P25, "P25").Равно(14.5);
	Ожидаем.Что(Процентили.P50, "P50").Равно(17);
	Ожидаем.Что(Процентили.P67, "P67").Равно(22.06);
	Ожидаем.Что(Процентили.P80, "P80").Равно(24.4);
	Ожидаем.Что(Процентили.P85, "P85").Равно(25.3);
	Ожидаем.Что(Процентили.P90, "P90").Равно(26.2);
	Ожидаем.Что(Процентили.P95, "P95").Равно(27.1);
	Ожидаем.Что(Процентили.P100, "P100").Равно(28);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВозвращатьКопииЗамеров() Экспорт

	// Подготовка
	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры("12, 15, 22", "100, 101"));
	ЗамерыВремени = Статистика.ЗамерыВремени();
	ЗамерыПамяти = Статистика.ЗамерыПамяти();

	// Действие
	ЗамерыВремени.Добавить(1000);
	ЗамерыПамяти.Добавить(1000);

	// Проверка
	Ожидаем.Что(Статистика.ЗамерыВремени(), "Замеры времени").ИмеетДлину(3);
	Ожидаем.Что(Статистика.ЗамерыПамяти(), "Замеры памяти").ИмеетДлину(2);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеДляНеподдерживаемогоТипаЗамеров() Экспорт

	// Подготовка
	Статистика = Новый СтатистикаБенчмарка();
	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Новый Соответствие());

	// Действие и Проверка
	Ожидаем
		.Что(Статистика)
		.Метод("Прочитать", ПараметрыМетода)
		.ВыбрасываетИсключение("Замеры с типом Соответствие не поддерживаются");

КонецПроцедуры

Функция ТестовыеЗамеры(СтрокаЗамерыВремени, СтрокаЗамерыПамяти, Множитель = 1) Экспорт
	
	Замеры = Новый Массив();

	МассивЗамеровВремени = СтрРазделить(СтрокаЗамерыВремени, ",", Ложь);
	МассивЗамеровПамяти = СтрРазделить(СтрокаЗамерыПамяти, ",", Ложь);

	Для Каждого НаносекундЗаОперацию Из МассивЗамеровВремени Цикл
		Замер = Новый РезультатИтерацииКейса();
		Замер.Этап = ЭтапыБенчмарка.Измерение;
		Замер.НаносекундЗаОперацию = Число(НаносекундЗаОперацию) * Множитель;
		Замеры.Добавить(Замер);
	КонецЦикла;

	Для Каждого ВыделяемаяПамятьЗаОперацию Из МассивЗамеровПамяти Цикл
		Замер = Новый РезультатИтерацииКейса();
		Замер.Этап = ЭтапыБенчмарка.Память;
		Замер.ВыделяемаяПамятьЗаОперацию = Число(ВыделяемаяПамятьЗаОперацию) * Множитель;
		Замеры.Добавить(Замер);
	КонецЦикла;

	Возврат Замеры;

КонецФункции
