#Использовать asserts
#Использовать fs
#Использовать tempfiles
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

Перем _МенеджерВременныхФайлов; // МенеджерВременныхФайлов

#Область ОбработчикиСобытий

&Инициализация
Процедура ПередВсеми() Экспорт

	_МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов();

КонецПроцедуры

&Завершение
Процедура ПослеВсех() Экспорт

	_МенеджерВременныхФайлов.Удалить();

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ОпубликоватьСобытияЛогическогоЗапуска() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);
	Наблюдатель = Новый НаблюдательСобытийВыполненияБенчмарков();
	ДиспетчерСобытий = Новый ДиспетчерСобытийВыполненияБенчмарков();
	ДиспетчерСобытий.ДобавитьНаблюдатель(Наблюдатель);
	Выполнение = Новый ВыполнениеБенчмарков(Тип, Конфигурация);
	Выполнение.УстановитьДиспетчерСобытий(ДиспетчерСобытий);

	// Действие
	РезультатЗапуска = Выполнение.Запустить();

	// Проверка
	Ожидаем.Что(РезультатЗапуска.Отчет.Таблица()).Заполнено();
	Ожидаем.Что(Наблюдатель.События().Количество()).Больше(0);
	Ожидаем.Что(
		НайтиСобытие(Наблюдатель, ТипыСобытийВыполненияБенчмарков.АртефактыСформированы())
	).Не_().Заполнено();
	Ожидаем.Что(
		НайтиСобытие(Наблюдатель, ТипыСобытийВыполненияБенчмарков.ЗапускБенчмарковЗавершен())
	).Заполнено();
	Ожидаем.Что(
		НайтиСобытие(Наблюдатель, ТипыСобытийВыполненияБенчмарков.ЗапускБенчмарковНачат())
	).Заполнено();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЭкспортироватьАртефактыИОпубликоватьСобытие() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");
	КаталогАртефактов = _МенеджерВременныхФайлов.СоздатьКаталог();
	ОжидаемыйПутьКФайлу = ФС.НормализоватьПуть(
		ОбъединитьПути(КаталогАртефактов, "ПустойБенчмарк-report.json")
	);
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);
	Конфигурация
		.ДобавитьЭкспортер(ЭкспортерыРезультатовБенчмарков.Json)
		.УстановитьКаталогАртефактов(КаталогАртефактов);
	Наблюдатель = Новый НаблюдательСобытийВыполненияБенчмарков();
	ДиспетчерСобытий = Новый ДиспетчерСобытийВыполненияБенчмарков();
	ДиспетчерСобытий.ДобавитьНаблюдатель(Наблюдатель);
	Выполнение = Новый ВыполнениеБенчмарков(Тип, Конфигурация);
	Выполнение.УстановитьДиспетчерСобытий(ДиспетчерСобытий);

	// Действие
	Выполнение.Запустить();

	// Проверка
	СобытиеАртефактов = НайтиСобытие(
		Наблюдатель,
		ТипыСобытийВыполненияБенчмарков.АртефактыСформированы()
	);
	События = Наблюдатель.События();
	Ожидаем.Что(ФС.ФайлСуществует(ОжидаемыйПутьКФайлу)).ЭтоИстина();
	Ожидаем.Что(СобытиеАртефактов).Заполнено();
	Ожидаем.Что(СобытиеАртефактов.Данные().Файлы).ИмеетДлину(1);
	Ожидаем.Что(СобытиеАртефактов.Данные().Файлы[0]).Равно(ОжидаемыйПутьКФайлу);
	Ожидаем.Что(
		НайтиСобытие(Наблюдатель, ТипыСобытийВыполненияБенчмарков.КейсБенчмаркаЗавершен())
	).Заполнено();
	Ожидаем.Что(
		НайтиСобытие(Наблюдатель, ТипыСобытийВыполненияБенчмарков.ЗапускБенчмарковЗавершен())
	).Заполнено();
	Ожидаем.Что(События[События.Количество() - 1]).Равно(СобытиеАртефактов);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиСобытие(Наблюдатель, ТипСобытия)

	Для Каждого Событие Из Наблюдатель.События() Цикл
		Если Событие.ТипСобытия() = ТипСобытия Тогда
			Возврат Событие;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

#КонецОбласти
