// BSLLS:LineLength-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать "helpers"
#Использовать "fixtures/benchmarks"
#Использовать "fixtures/customColumns"

#Область Тесты

&Тест
Процедура ТестДолжен_ИзвлечьКолонкиИзАннотации() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркиСКолонками");

	ПереченьКолонок = "Мин, Макс, Медиана, НижнийКвартиль, ВерхнийКвартиль, RatioSD";
	Колонки = СтрРазделить(ПереченьКолонок, ", ", Ложь);

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);
	
	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица();

	Для Каждого ИмяКолонки Из Колонки Цикл
		Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(ИмяКолонки), ИмяКолонки).Не_().ЭтоНеопределено();
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьКолонкиВКонфигурацию() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	ПереченьКолонок = "Мин, Макс, Медиана, НижнийКвартиль, ВерхнийКвартиль, RatioSD";
	Колонки = СтрРазделить(ПереченьКолонок, ", ", Ложь);

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	Для Каждого ИмяКолонки Из Колонки Цикл
		Конфигурация.ДобавитьКолонку(КолонкиОтчетаБенчмарков[ИмяКолонки]);
	КонецЦикла;

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);
	
	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица();

	Для Каждого ИмяКолонки Из Колонки Цикл
		Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(ИмяКолонки)).Не_().ЭтоНеопределено();
		Ожидаем.Что(ТаблицаОтчета[0][КолонкиОтчетаБенчмарков[ИмяКолонки]]).Заполнено();
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеДублироватьКолонкуПриПовторномДобавлении() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	ИмяКолонки = КолонкиОтчетаБенчмарков.Мин;

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	Конфигурация.ДобавитьКолонку(ИмяКолонки);
	Конфигурация.ДобавитьКолонку(ИмяКолонки);

	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);
	
	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица();

	Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(ИмяКолонки)).Не_().ЭтоНеопределено();
	Ожидаем.Что(ТаблицаОтчета[0][ИмяКолонки]).Заполнено();

КонецПроцедуры

&Тест
Процедура ТестДолжен_УдалитьКолонкуИзКонфигурации() Экспорт

	// Подготовка
	Колонка = КолонкиОтчетаБенчмарков.Мин;
	Тип = Тип("БенчмаркиСКолонками");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	Конфигурация.УдалитьКолонку(Колонка);

	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);
	
	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица();

	Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(Колонка)).ЭтоНеопределено();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИзвлечьКолонкиПроцентилейИзАннотации() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркиСКолонками");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица();

	КолонкаПроцентиль10 = КолонкиОтчетаБенчмарков.Процентиль(10);
	КолонкаПроцентиль80 = КолонкиОтчетаБенчмарков.Процентиль(80);

	Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(КолонкаПроцентиль10)).Не_().ЭтоНеопределено();
	Ожидаем.Что(ТаблицаОтчета[0][КолонкаПроцентиль10]).Заполнено();

	Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(КолонкаПроцентиль80)).Не_().ЭтоНеопределено();
	Ожидаем.Что(ТаблицаОтчета[0][КолонкаПроцентиль80]).Заполнено();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьКолонкиПроцентилейВКонфигурацию() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	Конфигурация.ДобавитьКолонку(КолонкиОтчетаБенчмарков.Процентиль(10));
	Конфигурация.ДобавитьКолонку(КолонкиОтчетаБенчмарков.Процентиль(80));

	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица();

	КолонкаПроцентиль10 = КолонкиОтчетаБенчмарков.Процентиль(10);
	КолонкаПроцентиль80 = КолонкиОтчетаБенчмарков.Процентиль(80);

	Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(КолонкаПроцентиль10)).Не_().ЭтоНеопределено();
	Ожидаем.Что(ТаблицаОтчета[0][КолонкаПроцентиль10]).Заполнено();

	Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(КолонкаПроцентиль80)).Не_().ЭтоНеопределено();
	Ожидаем.Что(ТаблицаОтчета[0][КолонкаПроцентиль80]).Заполнено();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьКолонкиПроцентилейВКонфигурациюПоУмолчанию() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	Конфигурация.ДобавитьКолонку(КолонкиОтчетаБенчмарков.Процентиль);

	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);
	
	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица();

	Для Каждого Процентиль Из КолонкаОтчетаБенчмарковПроцентиль.ПроцентилиПоУмолчанию() Цикл
		ИмяКолонки = КолонкиОтчетаБенчмарков.Процентиль(Процентиль);
		Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(ИмяКолонки)).Не_().ЭтоНеопределено();
		Ожидаем.Что(ТаблицаОтчета[0][ИмяКолонки]).Заполнено();
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьКолонкиПроцентилейВКонфигурациюПоУмолчаниюИПроизвольная() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	Конфигурация.ДобавитьКолонку(КолонкиОтчетаБенчмарков.Процентиль);
	Конфигурация.ДобавитьКолонку(КолонкиОтчетаБенчмарков.Процентиль(33));

	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица();

	Процентили = КолонкаОтчетаБенчмарковПроцентиль.ПроцентилиПоУмолчанию();
	Процентили.Добавить(33);

	Для Каждого Процентиль Из Процентили Цикл
		ИмяКолонки = КолонкиОтчетаБенчмарков.Процентиль(Процентиль);
		Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(ИмяКолонки)).Не_().ЭтоНеопределено();
		Ожидаем.Что(ТаблицаОтчета[0][ИмяКолонки]).Заполнено();
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьПользовательскуюКолонкуВКонфигурациюИОтчет() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПользовательскойКолонкой");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица();

	Ожидаем.Что(ТаблицаОтчета.Колонки.Найти("Пользовательская")).Не_().ЭтоНеопределено();
	Ожидаем.Что(ТаблицаОтчета[0]["Пользовательская"]).Равно("custom");

КонецПроцедуры

&Тест
Процедура ТестДолжен_АвтоматическиОпределитьПользовательскуюКолонкуКакЧисловую() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПользовательскойЧисловойКолонкой");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица();

	Ожидаем.Что(ТаблицаОтчета.Колонки.Найти("ПользовательскаяЧисловая")).Не_().ЭтоНеопределено();
	Ожидаем.Что(ТаблицаОтчета[0]["ПользовательскаяЧисловая"]).Равно(42);
	Ожидаем.Что(Результат.Отчет.ЭтоЧисловаяКолонка("ПользовательскаяЧисловая")).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_НастроитьВычислениеВстроеннойКолонкиЧерезАдаптер() Экспорт

	// Подготовка
	Колонка = КолонкиОтчетаБенчмарков.СоздатьСреднее();
	РезультатЗапускаКейса = ТестовыйРезультатЗапускаКейса("10, 20, 30", "100, 200");

	// Действие
	ЗначениеКолонки = Колонка.Значение(РезультатЗапускаКейса, Колонка);

	// Проверка
	Ожидаем.Что(Колонка.ДелегатЗначение).Не_().ЭтоНеопределено();
	Ожидаем.Что(ЗначениеКолонки).Равно(20);

КонецПроцедуры

&Тест
Процедура ТестДолжен_НастроитьВычислениеПользовательскойКолонкиЧерезАдаптер() Экспорт

	// Подготовка
	Колонка = КолонкиОтчетаБенчмарков.СоздатьПользовательскую("Пользовательская");

	// Действие
	ЗначениеКолонки = Колонка.Значение(Неопределено, Колонка);

	// Проверка
	Ожидаем.Что(Колонка.ДелегатЗначение).Не_().ЭтоНеопределено();
	Ожидаем.Что(ЗначениеКолонки).Равно("custom");

КонецПроцедуры

&Тест
Процедура ТестДолжен_НастроитьПредставлениеПользовательскойКолонкиЧерезАдаптер() Экспорт

	// Подготовка
	РезультатЗапускаКейса = ТестовыйРезультатЗапускаКейса("10, 20, 30");

	Колонка = КолонкиОтчетаБенчмарков.СоздатьПользовательскую("Пользовательская");
	
	ПараметрыПредставления = Новый ПараметрыПредставленияКолонкиОтчетаБенчмарков();
	ПараметрыПредставления.ФорматнаяСтрока = "fmt";

	// Действие
	Представление = Колонка.ПредставлениеЗначения("custom", РезультатЗапускаКейса, ПараметрыПредставления);

	// Проверка
	Ожидаем.Что(Колонка.ДелегатПредставлениеЗначения).Не_().ЭтоНеопределено();
	Ожидаем.Что(Представление).Равно("custom|20|fmt");

КонецПроцедуры

&Тест
Процедура ТестДолжен_НастроитьВычислениеПроцентильнойКолонкиЧерезАдаптер() Экспорт

	// Подготовка
	Колонка = КолонкиОтчетаБенчмарков.СоздатьПроцентиль(80);
	РезультатЗапускаКейса = ТестовыйРезультатЗапускаКейса("12, 15, 22, 25, 17, 28, 14", "100, 101");

	// Действие
	ЗначениеКолонки = Колонка.Значение(РезультатЗапускаКейса, Колонка);

	// Проверка
	Ожидаем.Что(Колонка.ДелегатЗначение).Не_().ЭтоНеопределено();
	Ожидаем.Что(ЗначениеКолонки).Равно(24.4);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИзвлечьПользовательскуюКолонкуИзАннотации() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПользовательскойКолонкой");

	// Действие
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);

	// Проверка
	Ожидаем.Что(Конфигурация.Колонки()).ИмеетДлину(1);
	Ожидаем.Что(Конфигурация.Колонки()).Содержит("Пользовательская");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьПользовательскуюКолонкуВКонфигурацию() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	// Действие
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	Конфигурация.ДобавитьКолонку("Пользовательская");

	// Проверка
	Ожидаем.Что(Конфигурация.Колонки()).ИмеетДлину(1);
	Ожидаем.Что(Конфигурация.Колонки()).Содержит("Пользовательская");

КонецПроцедуры

&Тест
Процедура ТестДолжен_УстановитьКаталогАртефактов() Экспорт

	// Подготовка
	Каталог = "path/to/artifacts";

	Конфигурация = Новый КонфигурацияБенчмарков();
	
	// Действие
	Конфигурация.УстановитьКаталогАртефактов(Каталог);

	// Проверка
	Ожидаем.Что(Конфигурация.КаталогАртефактов()).Равно(Каталог);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьЭкспортер() Экспорт

	// Подготовка
	Экспортер = ЭкспортерыРезультатовБенчмарков.Markdown;

	Конфигурация = Новый КонфигурацияБенчмарков();
	
	// Действие
	Конфигурация.ДобавитьЭкспортер(Экспортер);

	// Проверка
	Ожидаем.Что(Конфигурация.Экспортеры()).Содержит(Экспортер);

КонецПроцедуры

&Тест
Процедура ТестДолжен_УдалитьВсеЭкспортеры() Экспорт

	// Подготовка
	Экспортер = ЭкспортерыРезультатовБенчмарков.Markdown;

	Конфигурация = Новый КонфигурацияБенчмарков();
	Конфигурация.ДобавитьЭкспортер(Экспортер);
	
	// Действие
	Конфигурация.УдалитьЭкспортеры();

	// Проверка
	Ожидаем.Что(Конфигурация.Экспортеры()).ИмеетДлину(0);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТестовыйРезультатЗапускаКейса(СтрокаЗамеровВремени, СтрокаЗамеровПамяти = "")

	Замеры = Новый Структура(
		"ЗамерыВремени, ЗамерыПамяти",
		МассивЧисел(СтрокаЗамеровВремени),
		МассивЧисел(СтрокаЗамеровПамяти)
	);

	РезультатЗапускаКейса = Новый РезультатЗапускаКейса();
	РезультатЗапускаКейса.Статистика = Новый СтатистикаБенчмарка(Замеры);

	Возврат РезультатЗапускаКейса;

КонецФункции

Функция МассивЧисел(СтрокаЗначений)

	Результат = Новый Массив();

	Для Каждого Значение Из СтрРазделить(СтрокаЗначений, ", ", Ложь) Цикл
		Результат.Добавить(Число(Значение));
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
