// BSLLS:MagicNumber-off

#Использовать fluent
#Использовать asserts
#Использовать "helpers"

&Тест
Процедура Тест_Пустой() Экспорт
	
	ТестовыеЗамеры = ТестовыеЗамеры("", "");

	Статистика = Новый СтатистикаБенчмарка();

	Параметры = Новый Массив();
	Параметры.Добавить(ТестовыеЗамеры);

	Ожидаем.Что(Статистика).Метод("Прочитать", Параметры).ВыбрасываетИсключение("Набор замеров не должен быть пустым");

КонецПроцедуры

&Тест
Процедура Тест_НечетныйРазмер() Экспорт
	
	ТестовыеЗамеры = ТестовыеЗамеры("12, 15, 22, 25, 17, 28, 14", "100, 101, 102");

	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры);

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(19);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(12);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(17);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(23.5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(6.05, 6.06);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.2, 2.3);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(12);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(14.8);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(17);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(52631578, 52631579);
	Ожидаем.Что(Статистика.ВыделяемаяПамять, "Выделяемая память").Равно(101);

КонецПроцедуры

&Тест
Процедура Тест_ЧетныйРазмер() Экспорт
	
	ТестовыеЗамеры = ТестовыеЗамеры("12, 15, 22, 25, 17, 28, 20, 4", "100, 102");

	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры);

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(17.875);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(4);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(18.5);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.25);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(22.75);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(7.66, 7.67);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.7, 2.71);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(4);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(15.2);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(18.5);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(55944055, 55944056);
	Ожидаем.Что(Статистика.ВыделяемаяПамять, "Выделяемая память").Равно(101);

КонецПроцедуры

&Тест
Процедура Тест_ОдинаковыеЗначения() Экспорт
	
	ТестовыеЗамеры = ТестовыеЗамеры("5, 5, 5, 5", "100, 100");

	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры);

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(5);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(5);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(5);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(5);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Равно(0);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Равно(0);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(5);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(5);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(5);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(5);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Равно(200000000);
	Ожидаем.Что(Статистика.ВыделяемаяПамять, "Выделяемая память").Равно(100);

КонецПроцедуры

&Тест
Процедура Тест_ОтрицательныеЗначения() Экспорт
	
	ТестовыеЗамеры = ТестовыеЗамеры("-12, 15, -22, 25, 17, 28, 0, 4", "100, -100");

	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры);

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(6.875);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(-22);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(9.5);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(-3);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(19);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(17.68, 17.69);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(6.25, 6.26);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(-22);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(0.4);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(9.5);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(145454545, 145454546);
	Ожидаем.Что(Статистика.ВыделяемаяПамять, "Выделяемая память").Равно(0);

КонецПроцедуры

&Тест
Процедура Тест_ВМиллисекунды() Экспорт
	
	ОтношениеКБазовой = ЕдиницыИзмеренийБенчмарков.Миллисекунда.ОтношениеКБазовой;

	ТестовыеЗамеры = ТестовыеЗамеры("12, 15, 22, 25, 17, 28, 14", "100, 101", ОтношениеКБазовой);

	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры);
	Статистика.ВМиллисекунды();

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(19);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(12);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(17);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(23.5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(6.05, 6.06);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.2, 2.3);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(12);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(14.8);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(17);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(52.63, 52.64);

КонецПроцедуры

&Тест
Процедура Тест_ВСекунды() Экспорт
	
	ОтношениеКБазовой = ЕдиницыИзмеренийБенчмарков.Секунда.ОтношениеКБазовой;

	ТестовыеЗамеры = ТестовыеЗамеры("12, 15, 22, 25, 17, 28, 14", "100, 101", ОтношениеКБазовой);

	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры);
	Статистика.ВСекунды();

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(19);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(12);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(17);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(23.5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(6.05, 6.06);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.2, 2.3);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(12);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(14.8);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(17);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(0.0526, 0.0527);

КонецПроцедуры

&Тест
Процедура Тест_ВНаносекунды() Экспорт
	
	ТестовыеЗамеры = ТестовыеЗамеры("12, 15, 22, 25, 17, 28, 14", "100, 101");

	Статистика = Новый СтатистикаБенчмарка(ТестовыеЗамеры);
	Статистика.ВСекунды().ВНаносекунды();

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(19);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(12);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(28);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(17);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(14.5);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(23.5);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(6.05, 6.06);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(2.2, 2.3);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(12);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(14.8);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(17);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(28);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(52631578, 52631579);

КонецПроцедуры

&Тест
Процедура Тест_Разделить() Экспорт
	
	ТестовыеЗамеры1 = ТестовыеЗамеры("32, 16, 64, 128", "100, 102");
	ТестовыеЗамеры2 = ТестовыеЗамеры("2, 8, 16, 4", "50, 51");

	Статистика1 = Новый СтатистикаБенчмарка(ТестовыеЗамеры1);
	Статистика2 = Новый СтатистикаБенчмарка(ТестовыеЗамеры2);

	Статистика = Статистика1.Разделить(Статистика2);

	Ожидаем.Что(Статистика.Среднее, "Среднее").Равно(14.0625);
	Ожидаем.Что(Статистика.Мин, "Мин").Равно(1);
	Ожидаем.Что(Статистика.Макс, "Макс").Равно(64);
	Ожидаем.Что(Статистика.Медиана, "Медиана").Равно(8);
	Ожидаем.Что(Статистика.НижнийКвартиль, "НижнийКвартиль").Равно(4);
	Ожидаем.Что(Статистика.ВерхнийКвартиль, "ВерхнийКвартиль").Равно(16);
	Ожидаем.Что(Статистика.СтандартноеОтклонение, "Стандартное отклонение").Между(16.45, 16.46);
	Ожидаем.Что(Статистика.СтандартнаяОшибкаСреднего, "Стандартная ошибка").Между(4.1, 4.2);
	Ожидаем.Что(Статистика.Квантиль(0), "Квантиль 0").Равно(1);
	Ожидаем.Что(Статистика.Квантиль(0.3), "Квантиль 0.3").Равно(4);
	Ожидаем.Что(Статистика.Квантиль(0.5), "Квантиль 0.5").Равно(8);
	Ожидаем.Что(Статистика.Квантиль(1), "Квантиль 1").Равно(64);
	Ожидаем.Что(Статистика.ОперацийВСекунду, "Операций в секунду").Между(71111111, 71111112);
	Ожидаем.Что(Статистика.ВыделяемаяПамять, "Выделяемая память").Между(2, 2.1);

КонецПроцедуры

Функция ТестовыеЗамеры(СтрокаЗамерыВремени, СтрокаЗамерыПамяти, Множитель = 1) Экспорт
	
	Замеры = Новый Массив();

	МассивЗамеровВремени = СтрРазделить(СтрокаЗамерыВремени, ",", Ложь);
	МассивЗамеровПамяти = СтрРазделить(СтрокаЗамерыПамяти, ",", Ложь);

	Для Каждого НаносекундЗаОперацию Из МассивЗамеровВремени Цикл
		Замер = Новый РезультатИтерацииБенчмаркаДто();
		Замер.Этап = ЭтапыБенчмарка.Измерение;
		Замер.НаносекундЗаОперацию = Число(НаносекундЗаОперацию) * Множитель;
		Замеры.Добавить(Замер);
	КонецЦикла;

	Для Каждого ВыделяемаяПамятьЗаОперацию Из МассивЗамеровПамяти Цикл
		Замер = Новый РезультатИтерацииБенчмаркаДто();
		Замер.Этап = ЭтапыБенчмарка.Память;
		Замер.ВыделяемаяПамятьЗаОперацию = Число(ВыделяемаяПамятьЗаОперацию) * Множитель;
		Замеры.Добавить(Замер);
	КонецЦикла;

	Возврат Замеры;

КонецФункции