// BSLLS:LineLength-off

#Использовать asserts
#Использовать fs
#Использовать strings
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

&После
Процедура ПослеЗапускаТеста() Экспорт
	
	КаталогАртефактов = ".\BenchmarkArtifacts";

	ФС.УдалитьФайлы(КаталогАртефактов);

КонецПроцедуры

&Тест
Процедура Тест_ЭкспортВMarkdown() Экспорт

	Если ТестированиеБенчмарков.ЭтоOneScript1() Тогда
		Возврат;
	КонецЕсли;

	// Подготовка
	Тип = Тип("БенчмаркиДляЭкспорта");

	ТекстЭталон = СтроковыеФункции.ПрочитатьФайл("tests/fixtures/verified-report.md");
	
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	Конфигурация
		.ДобавитьОбработчикСобытия("ОбработчикиСобытийБенчмарков.УстановкаВремени", СобытияБенчмарков.ПослеКаждого)
		.ДобавитьОбработчикСобытия("ОбработчикиСобытийБенчмарков.УстановкаМокСредыОкружения", СобытияБенчмарков.ПослеВсех)
		.ДобавитьЭкспортер(ЭкспортерыРезультатовБенчмарков.Markdown);
	
	ПутьКФайлу = ОбъединитьПути(Конфигурация.КаталогАртефактов(), "БенчмаркиДляЭкспорта-report.md");

	// Действие
	Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Текст = СтроковыеФункции.ПрочитатьФайл(ПутьКФайлу);

	Ожидаем.Что(Текст).Равно(ТекстЭталон);
	
КонецПроцедуры

&Тест
Процедура Тест_ЭкспортВJson() Экспорт

	Если ТестированиеБенчмарков.ЭтоOneScript1() Тогда
		Возврат;
	КонецЕсли;

	// Подготовка
	Тип = Тип("БенчмаркиДляЭкспорта");

	ТекстЭталон = СтроковыеФункции.ПрочитатьФайл("tests/fixtures/verified-report.json");
	
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	Конфигурация
		.ДобавитьОбработчикСобытия("ОбработчикиСобытийБенчмарков.УстановкаВремени", СобытияБенчмарков.ПослеКаждого)
		.ДобавитьОбработчикСобытия("ОбработчикиСобытийБенчмарков.УстановкаМокСредыОкружения", СобытияБенчмарков.ПослеВсех)
		.ДобавитьЭкспортер(ЭкспортерыРезультатовБенчмарков.Json)
		.УстановитьКоличествоИтераций(10);
	
	ПутьКФайлу = ОбъединитьПути(Конфигурация.КаталогАртефактов(), "БенчмаркиДляЭкспорта-report.json");

	// Действие
	Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Текст = СтроковыеФункции.ПрочитатьФайл(ПутьКФайлу);

	Ожидаем.Что(Текст).Равно(ТекстЭталон);
	
КонецПроцедуры

&Тест
Процедура Тест_ЭкспортВHtml() Экспорт

	Если ТестированиеБенчмарков.ЭтоOneScript1() Тогда
		Возврат;
	КонецЕсли;

	// Подготовка
	Тип = Тип("БенчмаркиДляЭкспорта");

	ТекстЭталон = СтроковыеФункции.ПрочитатьФайл("tests/fixtures/verified-report.html");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	Конфигурация
		.ДобавитьОбработчикСобытия("ОбработчикиСобытийБенчмарков.УстановкаВремени", СобытияБенчмарков.ПослеКаждого)
		.ДобавитьОбработчикСобытия("ОбработчикиСобытийБенчмарков.УстановкаМокСредыОкружения", СобытияБенчмарков.ПослеВсех)
		.ДобавитьЭкспортер(ЭкспортерыРезультатовБенчмарков.Html);
	
	ПутьКФайлу = ОбъединитьПути(Конфигурация.КаталогАртефактов(), "БенчмаркиДляЭкспорта-report.html");

	// Действие
	Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Текст = СтроковыеФункции.ПрочитатьФайл(ПутьКФайлу);

	Ожидаем.Что(Текст).Равно(ТекстЭталон);
	
КонецПроцедуры