// BSLLS:LineLength-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать fluent
#Использовать tempfiles
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

Перем _МенеджерВременныхФайлов; // МенеджерВременныхФайлов

#Область ОбработчикиСобытий

&Инициализация
Процедура ПередВсеми() Экспорт
	_МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов();
КонецПроцедуры

&Завершение
Процедура ПослеВсех() Экспорт
	_МенеджерВременныхФайлов.Удалить();
КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ВызватьАннотированныеОбработчикиСобытий() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСОбработчикамиСобытий");
	ПутьКЛогу = _МенеджерВременныхФайлов.НовоеИмяФайла();

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);
	Конфигурация.ДобавитьПараметр("ПутьКЛогу", ПутьКЛогу);

	// Действие
	Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	События = ПрочитатьСобытияИзЛога(ПутьКЛогу);

	Ожидаем.Что(События).Содержит("ПередВсеми");
	Ожидаем.Что(События).Содержит("ПослеВсех");
	Ожидаем.Что(События).Содержит("ПередКаждымКейсом");
	Ожидаем.Что(События).Содержит("ПослеКаждогоКейса");
	Ожидаем.Что(События).Содержит("ПередКаждым");
	Ожидаем.Что(События).Содержит("ПослеКаждого");
	Ожидаем.Что(События).Содержит("ПередИтерацией");
	Ожидаем.Что(События).Содержит("ПослеИтерации");
	Ожидаем.Что(События).Не_().Содержит("БезАннотации");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьОбработчикСобытия() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСОбработчикамиСобытий");
	ПутьКЛогу = _МенеджерВременныхФайлов.НовоеИмяФайла();

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	Конфигурация.ДобавитьОбработчикСобытия("БезАннотации", СобытияБенчмарков.ПередКаждымКейсом);
	Конфигурация.ДобавитьПараметр("ПутьКЛогу", ПутьКЛогу);

	// Действие
	Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	События = ПрочитатьСобытияИзЛога(ПутьКЛогу);

	Ожидаем.Что(События).Содержит("ПередКаждымКейсом");
	Ожидаем.Что(События).Содержит("БезАннотации");

КонецПроцедуры

&Тест
Процедура ТестДолжен_УдалитьОбработчикСобытия() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСОбработчикамиСобытий");
	ПутьКЛогу = _МенеджерВременныхФайлов.НовоеИмяФайла();

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);
	Конфигурация.УстановитьКоличествоПрогревочныхИтераций(0);

	Конфигурация.УдалитьОбработчикиСобытия(СобытияБенчмарков.ПередКаждымКейсом);
	Конфигурация.ДобавитьПараметр("ПутьКЛогу", ПутьКЛогу);

	// Действие
	Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	События = ПрочитатьСобытияИзЛога(ПутьКЛогу);

	Ожидаем.Что(События).Не_().Содержит("ПередКаждымКейсом");
	Ожидаем.Что(События).ИмеетДлину(6);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеНаНесуществующемОбработчикеСобытия() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	Конфигурация.ДобавитьОбработчикСобытия("НесуществующийОбработчик", СобытияБенчмарков.ПередКаждымКейсом);

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Тип);
	ПараметрыМетода.Добавить(Конфигурация);

	// Действие и Проверка
	Ожидаем
		.Что(Бенчмаркинг)
		.Метод("Запустить", ПараметрыМетода)
		.ВыбрасываетИсключение("Ошибка в обработчике события <НесуществующийОбработчик>: Метод объекта не обнаружен");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьСобытияИзЛога(ПутьКФайлу)

	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	ТекстЛога = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	Возврат СтрРазделить(ТекстЛога, Символы.ПС, Ложь);

КонецФункции

#КонецОбласти
