// BSLLS:LineLength-off

#Использовать fluent
#Использовать "helpers"
#Использовать "fixtures/benchmarks"
#Использовать "fixtures/paramsSources"

#Область Тесты

&Тест
Процедура ТестДолжен_ВыброситьИсключениеНаНепубличномМетодеБенчмарка() Экспорт

	// Подготовка
	ДескрипторыБенчмарков = СоздатьКоллекциюСДескриптором("ЗакрытыйБенчмарк");
	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию();

	// Действие и Проверка
	ПроверитьИсключениеЗапуска(
		ДескрипторыБенчмарков,
		Конфигурация,
		"Метод бенчмарка <ЗакрытыйБенчмарк> должен быть экспортным."
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеНаНепубличномПолеПараметра() Экспорт

	// Подготовка
	ДескрипторыБенчмарков = СоздатьКоллекциюСДескриптором();
	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию();
	Конфигурация.ДобавитьПараметр("ЗакрытоеПоле", 1);

	// Действие и Проверка
	ПроверитьИсключениеЗапуска(
		ДескрипторыБенчмарков,
		Конфигурация,
		"Поле параметра <ЗакрытоеПоле> должно быть экспортным."
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеНаНепубличномИсточникеОбщегоПараметра() Экспорт

	// Подготовка
	ДескрипторыБенчмарков = СоздатьКоллекциюСДескриптором();
	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию();
	Конфигурация.ДобавитьИсточникПараметров("ОткрытоеПоле", "ЗакрытыйИсточник");

	// Действие и Проверка
	ПроверитьИсключениеЗапуска(
		ДескрипторыБенчмарков,
		Конфигурация,
		"Метод-источник параметров <ЗакрытыйИсточник> должен быть экспортным."
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеНаНепубличномИсточникеОбщегоПараметраИзМодуля() Экспорт

	// Подготовка
	ДескрипторыБенчмарков = СоздатьКоллекциюСДескриптором();
	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию();
	Конфигурация.ДобавитьИсточникПараметров(
		"ОткрытоеПоле",
		"МодульСИсточникамиПараметров.ЗакрытыйИсточникИзМодуля"
	);

	// Действие и Проверка
	ПроверитьИсключениеЗапуска(
		ДескрипторыБенчмарков,
		Конфигурация,
		"Метод-источник параметров <МодульСИсточникамиПараметров.ЗакрытыйИсточникИзМодуля> должен быть экспортным."
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеНаНепубличномИсточникеПараметровБенчмарка() Экспорт

	// Подготовка
	ДескрипторыБенчмарков = СоздатьКоллекциюСДескриптором("БенчмаркСПараметром");
	ДескрипторыБенчмарков.ПолучитьПервый().ДобавитьИсточникПараметров("ЗакрытыйИсточник");

	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию();

	// Действие и Проверка
	ПроверитьИсключениеЗапуска(
		ДескрипторыБенчмарков,
		Конфигурация,
		"Метод-источник параметров <ЗакрытыйИсточник> должен быть экспортным."
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьКоллекциюСДескриптором(ИмяМетода = "Бенчмарк")

	ТипБенчмарка = Тип("БенчмаркСНепубличнымиЭлементами");

	ДескрипторБенчмарка = Новый ДескрипторБенчмарка(ТипБенчмарка, ИмяМетода);
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков();
	ДескрипторыБенчмарков.Добавить(ДескрипторБенчмарка);

	Возврат ДескрипторыБенчмарков;

КонецФункции

Процедура ПроверитьИсключениеЗапуска(ИсточникБенчмарков, Конфигурация, ТекстИсключения)

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(ИсточникБенчмарков);
	ПараметрыМетода.Добавить(Конфигурация);

	Ожидаем
		.Что(Бенчмаркинг)
		.Метод("Запустить", ПараметрыМетода)
		.ВыбрасываетИсключение(ТекстИсключения);

КонецПроцедуры

#КонецОбласти
