// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать tempfiles
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

Перем МенеджерВременныхФайлов; // МенеджерВременныхФайлов

&Инициализация
Процедура ПередВсеми() Экспорт
	МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов();
КонецПроцедуры

&Завершение
Процедура ПослеВсех() Экспорт
	МенеджерВременныхФайлов.Удалить();
КонецПроцедуры

&Тест
Процедура ТестДолжен_СериализоватьИДесериализовать() Экспорт

	Тип = Тип("БенчмаркСАннотациямиКонфигурации");
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	КоллекцияДескрипторов = Новый КоллекцияДескрипторовБенчмарков(Тип);

	ИмяФайла = МенеджерВременныхФайлов.НовоеИмяФайла();

	Сериализатор = Новый СериализаторНастроекБенчмарков();
	Сериализатор.ЗаписатьВJson(КоллекцияДескрипторов, Конфигурация, ИмяФайла);
	ДТО = Сериализатор.ПрочитатьИзJson(ИмяФайла);

	ПроверитьДескрипторыБенчмаркаСАннотациямиКонфигурации(ДТО.ДескрипторыБенчмарков);
	ПроверитьКонфигурациюБенчмаркаСАннотациямиКонфигурации(ДТО.Конфигурация);

КонецПроцедуры

Процедура ПроверитьДескрипторыБенчмаркаСАннотациямиКонфигурации(ДескрипторыБенчмарков)
	
	Ожидаем.Что(ДескрипторыБенчмарков.Количество()).Равно(1);

	Дескриптор = ДескрипторыБенчмарков.ПолучитьПервый();
	НаборыПараметров = Дескриптор.НаборыПараметров();
	ИсточникиПараметров = Дескриптор.ИсточникиПараметров();

	Ожидаем.Что(Дескриптор.ТипОбъекта()).Равно(Тип("БенчмаркСАннотациямиКонфигурации"));
	Ожидаем.Что(Дескриптор.Метод()).Равно("Бенчмарк");
	Ожидаем.Что(Дескриптор.ЭтоЭталон()).ЭтоЛожь();

	Ожидаем.Что(НаборыПараметров, "Наборы параметров").ИмеетДлину(2);
	Ожидаем.Что(НаборыПараметров[0].Получить(0).Имя(), "Наборы параметров [0].Имя").Равно("Парам");
	Ожидаем.Что(НаборыПараметров[0].Получить(0).Значение(), "Наборы параметров [0].Значение").Равно(1);
	Ожидаем.Что(НаборыПараметров[1].Получить(0).Имя(), "Наборы параметров [1].Имя").Равно("Парам");
	Ожидаем.Что(НаборыПараметров[1].Получить(0).Значение(), "Наборы параметров [1].Значение").Равно(2);

	Ожидаем.Что(ИсточникиПараметров, "Источники параметров").ИмеетДлину(1);
	Ожидаем.Что(ИсточникиПараметров[0], "Источники параметров [0]").Равно("ПолучитьПараметры");

КонецПроцедуры

Процедура ПроверитьКонфигурациюБенчмаркаСАннотациямиКонфигурации(Конфигурация)
	
	Экспортеры = Конфигурация.Экспортеры();
	КоллекцияЭкспортеры = ПроцессорыКоллекций.ИзКоллекции(Экспортеры);
	ВерсииИсполняющейСреды = Конфигурация.ВерсииИсполняющейСреды();
	Колонки = Конфигурация.Колонки();
	Параметры = Конфигурация.Параметры();
	ИсточникиПараметров = Конфигурация.ИсточникиПараметров();

	ФункцияПоискаЭкспортера = "Экспортер -> ТипЗнч(Экспортер) = Тип(""ЭкспортерРезультатовБенчмарковВ%1"")";

	Ожидаем.Что(Конфигурация.Стратегия()).Равно(СтратегииЗапускаБенчмарка.ХолодныйЗапуск);
	Ожидаем.Что(Конфигурация.СортировкаОтчета()).Равно(СортировкиОтчетаБенчмарков.ОтБыстрыхКМедленным);
	Ожидаем.Что(Конфигурация.ТребуетсяМониторингПамяти()).ЭтоИстина();
	Ожидаем.Что(Конфигурация.КоличествоИтераций()).Равно(100);
	Ожидаем.Что(Конфигурация.КоличествоВызововЗаИтерацию()).Равно(200);
	Ожидаем.Что(Конфигурация.КоличествоПрогревочныхИтераций()).Равно(300);
	Ожидаем.Что(Конфигурация.МинимальноеВремяИтерации()).Равно(400);
	Ожидаем.Что(Конфигурация.МинимальноеКоличествоВызововЗаИтерацию()).Равно(500);		
	Ожидаем.Что(Конфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПередВсеми)[0].ИмяМетода(), "Обработчики").Равно("ПередВсеми");
	Ожидаем.Что(Конфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПослеВсех)[0].ИмяМетода(), "Обработчики").Равно("ПослеВсех");
	Ожидаем.Что(Конфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПередКаждым)[0].ИмяМетода(), "Обработчики").Равно("ПередКаждым");
	Ожидаем.Что(Конфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПослеКаждого)[0].ИмяМетода(), "Обработчики").Равно("ПослеКаждого");
	Ожидаем.Что(Конфигурация.КаталогАртефактов()).Равно("path/to/artifacts");
	Ожидаем.Что(КоллекцияЭкспортеры.ЛюбойСоответствует(СтрШаблон(ФункцияПоискаЭкспортера, "Markdown"))).ЭтоИстина();
	Ожидаем.Что(КоллекцияЭкспортеры.ЛюбойСоответствует(СтрШаблон(ФункцияПоискаЭкспортера, "Json"))).ЭтоИстина();
	Ожидаем.Что(КоллекцияЭкспортеры.ЛюбойСоответствует(СтрШаблон(ФункцияПоискаЭкспортера, "Html"))).ЭтоИстина();
	Ожидаем.Что(ВерсииИсполняющейСреды, "Должно быть 4 версии исполняющей среды").ИмеетДлину(4);
	Ожидаем.Что(ВерсииИсполняющейСреды[0].Версия, "Версия исполняющей среды stable").Равно("stable");
	Ожидаем.Что(ВерсииИсполняющейСреды[1].Версия, "Версия исполняющей среды 1.9.3").Равно("1.9.3");
	Ожидаем.Что(ВерсииИсполняющейСреды[2].Версия, "Версия исполняющей среды 1.9.4").Равно("1.9.4");
	Ожидаем.Что(ВерсииИсполняющейСреды[3].Версия, "Версия исполняющей среды 2.0.0").Равно("2.0.0");
	Ожидаем.Что(ВерсииИсполняющейСреды[3].Наименование, "Наименование исполняющей среды 2.0.0").Равно("Новая");
	Ожидаем.Что(ВерсииИсполняющейСреды[3].ЭтоЭталон, "Исполняющая среда версии 2.0.0 - эталонная").ЭтоИстина();
	Ожидаем.Что(Колонки, "Колонки").Содержит(КолонкиОтчетаБенчмарков.Мин);
	Ожидаем.Что(Колонки, "Колонки").Содержит(КолонкиОтчетаБенчмарков.Макс);
	Ожидаем.Что(Параметры, "Параметры").ИмеетДлину(2);
	Ожидаем.Что(Параметры[0], "Параметры").ИмеетТип("ПараметрБенчмарка");
	Ожидаем.Что(Параметры[0].Значение(), "Параметры").Равно(100);
	Ожидаем.Что(Параметры[1].Значение(), "Параметры").Равно(200);
	Ожидаем.Что(ИсточникиПараметров, "Источники параметров").ИмеетДлину(1);
	Ожидаем.Что(ИсточникиПараметров[0].ИмяПоля, "Источники параметров").Равно("ОбщееЗначение");
	Ожидаем.Что(ИсточникиПараметров[0].Источник, "Источники параметров").Равно("ПолучитьЗначения");

КонецПроцедуры