// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

Перем _КоэффициентОтклоненияЗадержки; // Число, Неопределено

#Область Тесты

&Тест
Процедура ТестДолжен_ИзмеритьВыделяемуюПамятьБуфераДвоичныхДанных() Экспорт

	// Подготовка
	РазмерВБайтах = 1024 * 1024;
	Тип = Тип("БенчмаркБуферДвоичныхДанных");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьКоличествоИтераций(2)
		.УстановитьКоличествоПрогревочныхИтераций(1)
		.УстановитьКоличествоВызововЗаИтерацию(2);

	ДескрипторБенчмарка = Новый КоллекцияДескрипторовБенчмарков(Тип)
		.ПолучитьПервый()
		.ДобавитьПараметры(РазмерВБайтах);

	// Действие
	Результат = Бенчмаркинг.Запустить(ДескрипторБенчмарка, Конфигурация);

	// Проверка
	ВыделеноБайт = Результат.Запуски[0].Статистика.ВыделяемаяПамять;
	Коэффициент = РазмерВБайтах / ВыделеноБайт;

	Ожидаем.Что(Коэффициент).Между(0.99, 1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИзмеритьВыделяемуюПамятьПустогоБенчмарка() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьКоличествоИтераций(2)
		.УстановитьКоличествоПрогревочныхИтераций(1)
		.УстановитьКоличествоВызововЗаИтерацию(3)
		.ДобавитьМониторингПамяти();

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски[0].Статистика.ВыделяемаяПамять).Между(1, 3000);

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеЗаполнятьВыделяемуюПамятьБезПрофилированияПамяти() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьКоличествоИтераций(2)
		.УстановитьКоличествоПрогревочныхИтераций(0)
		.УстановитьКоличествоВызововЗаИтерацию(3);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски[0].Статистика.ВыделяемаяПамять).Равно(0);

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеСоздаватьЗамерыПамятиБезПрофилированияПамяти() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьКоличествоИтераций(2)
		.УстановитьКоличествоПрогревочныхИтераций(0)
		.УстановитьКоличествоВызововЗаИтерацию(3);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	ЗамерПамяти = Результат.Запуски[0].НайтиИтерациюЗамера(ЭтапыБенчмарка.Память, 1);

	Ожидаем.Что(ЗамерПамяти).ЭтоНеопределено();

КонецПроцедуры

&Тест
Процедура ТестДолжен_РассчитатьВремяЗаОперациюПриНесколькихВызовахЗаИтерацию() Экспорт

	// Подготовка
	КоличествоВызововЗаИтерацию = 3;
	Тип = Тип("БенчмаркиСЗадержкой");
	КоэффициентОтклонения = ПолучитьКоэффициентОтклоненияЗадержки();
	ГраницыДляЗадержки10 = ГраницыОжидаемогоСреднего(10, КоэффициентОтклонения);

	ДескрипторБенчмарка = Новый КоллекцияДескрипторовБенчмарков(Тип)
		.НайтиПоИмени("Задержка10");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьКоличествоИтераций(1)
		.УстановитьКоличествоПрогревочныхИтераций(1)
		.УстановитьКоличествоВызововЗаИтерацию(КоличествоВызововЗаИтерацию);

	// Действие
	Результат = Бенчмаркинг.Запустить(ДескрипторБенчмарка, Конфигурация);

	// Проверка
	Замер = Результат.Запуски[0].НайтиИтерациюЗамера(ЭтапыБенчмарка.Измерение, 1);
	КоэффициентОпераций = Замер.Наносекунд / Замер.НаносекундЗаОперацию;
	Статистика = Результат.Запуски[0].Статистика.ВМиллисекунды();

	Ожидаем.Что(Замер.КоличествоОпераций).Равно(КоличествоВызововЗаИтерацию);
	Ожидаем.Что(КоэффициентОпераций).Между(
		КоличествоВызововЗаИтерацию - 0.01,
		КоличествоВызововЗаИтерацию + 0.01
	);
	Ожидаем.Что(Статистика.Среднее).Между(ГраницыДляЗадержки10.Нижняя, ГраницыДляЗадержки10.Верхняя);

КонецПроцедуры

&Тест
Процедура ТестДолжен_РассчитатьВыделяемуюПамятьЗаОперациюПриНесколькихВызовахЗаИтерацию() Экспорт

	// Подготовка
	РазмерВБайтах = 256 * 1024;
	КоличествоВызововЗаИтерацию = 4;
	Тип = Тип("БенчмаркБуферДвоичныхДанных");

	ДескрипторБенчмарка = Новый КоллекцияДескрипторовБенчмарков(Тип)
		.НайтиПоИмени("Бенчмарк")
		.ДобавитьПараметры(РазмерВБайтах);

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьКоличествоИтераций(1)
		.УстановитьКоличествоПрогревочныхИтераций(0)
		.УстановитьКоличествоВызововЗаИтерацию(КоличествоВызововЗаИтерацию);

	// Действие
	Результат = Бенчмаркинг.Запустить(ДескрипторБенчмарка, Конфигурация);

	// Проверка
	Замер = Результат.Запуски[0].НайтиИтерациюЗамера(ЭтапыБенчмарка.Память, 1);
	КоэффициентОпераций = Замер.ВыделяемаяПамять / Замер.ВыделяемаяПамятьЗаОперацию;
	КоэффициентРазмера = РазмерВБайтах / Результат.Запуски[0].Статистика.ВыделяемаяПамять;

	Ожидаем.Что(Замер.КоличествоОпераций).Равно(КоличествоВызововЗаИтерацию);
	Ожидаем.Что(КоэффициентОпераций).Между(
		КоличествоВызововЗаИтерацию - 0.01,
		КоличествоВызововЗаИтерацию + 0.01
	);
	Ожидаем.Что(КоэффициентРазмера).Между(0.95, 1.05);

КонецПроцедуры

&Тест
Процедура ТестДолжен_РассчитатьПоказателиПроизводительности() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркиСЗадержкой");
	КоэффициентОтклонения = ПолучитьКоэффициентОтклоненияЗадержки();
	ГраницыДляЗадержки10 = ГраницыОжидаемогоСреднего(10, КоэффициентОтклонения);
	ГраницыДляЗадержки20 = ГраницыОжидаемогоСреднего(20, КоэффициентОтклонения);

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьКоличествоИтераций(3)
		.УстановитьКоличествоПрогревочныхИтераций(1)
		.УстановитьКоличествоВызововЗаИтерацию(3);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Запуски = Результат.Запуски;
	Отчет = Результат.Отчет;

	Статистика1 = Запуски[0].Статистика.ВМиллисекунды();
	Статистика2 = Запуски[1].Статистика.ВМиллисекунды();

	Ожидаем.Что(Статистика1.Среднее).Между(ГраницыДляЗадержки10.Нижняя, ГраницыДляЗадержки10.Верхняя);
	Ожидаем.Что(Статистика2.Среднее).Между(ГраницыДляЗадержки20.Нижняя, ГраницыДляЗадержки20.Верхняя);
	Ожидаем.Что(Статистика1.СтандартноеОтклонение).Больше(0);
	Ожидаем.Что(Статистика2.СтандартноеОтклонение).Больше(0);
	Ожидаем.Что(Статистика1.СтандартнаяОшибкаСреднего).Больше(0);
	Ожидаем.Что(Статистика2.СтандартнаяОшибкаСреднего).Больше(0);
	Ожидаем.Что(Статистика1.Медиана).Между(ГраницыДляЗадержки10.Нижняя, ГраницыДляЗадержки10.Верхняя);
	Ожидаем.Что(Статистика2.Медиана).Между(ГраницыДляЗадержки20.Нижняя, ГраницыДляЗадержки20.Верхняя);
	Ожидаем.Что(Отчет.Таблица[0][КолонкиОтчетаБенчмарков.КоэффициентПроизводительности]).Равно(1);
	Ожидаем.Что(Отчет.Таблица[1][КолонкиОтчетаБенчмарков.КоэффициентПроизводительности]).Больше(1);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКоэффициентОтклоненияЗадержки()

	Если Не _КоэффициентОтклоненияЗадержки = Неопределено Тогда
		Возврат _КоэффициентОтклоненияЗадержки;
	КонецЕсли;

	Тип = Тип("БенчмаркиСЗадержкой");

	ДескрипторБенчмарка = Новый КоллекцияДескрипторовБенчмарков(Тип)
		.НайтиПоИмени("Задержка10");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.УстановитьКоличествоИтераций(1)
		.УстановитьКоличествоПрогревочныхИтераций(0)
		.УстановитьКоличествоВызововЗаИтерацию(10);

	Репортер = Новый НулевойРепортерБенчмарков();
	Запускатель = Новый ЗапускательБенчмарков(ДескрипторБенчмарка, Конфигурация, Репортер);
	Результат = Запускатель.Запустить();
	Среднее = Результат.Запуски[0].Статистика.ВМиллисекунды().Среднее;

	_КоэффициентОтклоненияЗадержки = Среднее / 10;

	Возврат _КоэффициентОтклоненияЗадержки;

КонецФункции

Функция ГраницыОжидаемогоСреднего(ОжидаемоеСреднее, КоэффициентОтклонения)

	СкорректированноеСреднее = ОжидаемоеСреднее * КоэффициентОтклонения;
	Допуск = СкорректированноеСреднее * 0.25;

	Возврат Новый Структура(
		"Нижняя, Верхняя",
		СкорректированноеСреднее - Допуск,
		СкорректированноеСреднее + Допуск
	);

КонецФункции

#КонецОбласти
