// BSLLS:LineLength-off

#Использовать asserts
#Использовать fs
#Использовать tempfiles
#Использовать "helpers"

Перем МенеджерВременныхФайлов; // МенеджерВременныхФайлов
Перем ПодготовительФайлаБенчмарка; // ПодготовительФайлаБенчмарка

&Перед
Процедура ПередЗапускомТеста() Экспорт

	МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов();
	ПодготовительФайлаБенчмарка = Новый ПодготовительФайлаБенчмарка(МенеджерВременныхФайлов);

КонецПроцедуры

&После
Процедура ПослеЗапускаТеста() Экспорт

	МенеджерВременныхФайлов.Удалить();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВернутьИсходныйФайлЕслиАннотацияБенчмаркУжеЕсть() Экспорт

	// Подготовка
	ПутьКФайлу = "./tests/fixtures/benchmarks/Классы/ПустойБенчмарк.os";

	// Действие
	ПодготовленныйФайл = ПодготовительФайлаБенчмарка.Подготовить(ПутьКФайлу);

	// Проверка
	Ожидаем.Что(ПодготовленныйФайл).Равно(ПутьКФайлу);
	Ожидаем.Что(МенеджерВременныхФайлов.Файлы()).ИмеетДлину(0);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СоздатьИЗапуститьВременныйФайлДляАлгоритмаБезАннотации() Экспорт

	// Подготовка
	ПутьКФайлу = "./tests/fixtures/АлгоритмБезАннотации.os";

	// Действие
	ПодготовленныйФайл = ПодготовительФайлаБенчмарка.Подготовить(ПутьКФайлу);

	// Проверка
	ТекстВременногоФайла = ПрочитатьТекст(ПодготовленныйФайл);
	Тип = Бенчмаркинг.ПодключитьБенчмарк(ПодготовленныйФайл);
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);

	Ожидаем.Что(ФС.ФайлСуществует(ПодготовленныйФайл)).Равно(Истина);
	Ожидаем.Что(МенеджерВременныхФайлов.Файлы()).ИмеетДлину(1);
	Ожидаем.Что(ТекстВременногоФайла).Содержит("#Использовать fs");
	Ожидаем.Что(ТекстВременногоФайла).Содержит("&Бенчмарк");
	Ожидаем.Что(ТекстВременногоФайла).Содержит("Процедура Бенчмарк() Экспорт");
	Ожидаем.Что(ДескрипторыБенчмарков.Количество()).Равно(1);
	Ожидаем.Что(ДескрипторыБенчмарков.ПолучитьПервый().Метод()).Равно("Бенчмарк");
	Ожидаем.Что(ДескрипторыБенчмарков.ПолучитьПервый().Наименование()).Равно("АлгоритмБезАннотации");

КонецПроцедуры

Функция ПрочитатьТекст(ПутьКФайлу)

	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	Текст = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	Возврат Текст;

КонецФункции