// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать "helpers"

#Область Тесты

&Тест
Процедура ТестДолжен_ИспользоватьЮникодМаркерыДляЮникодКодировок() Экспорт

	// Подготовка
	Определитель = Новый ОпределительВозможностейТерминалаБенчмарков();

	// Действие
	ПрофильUTF8 = Определитель.ОпределитьДляКодировки(КодировкаТекста.UTF8);
	ПрофильUTF8БезBOM = Определитель.ОпределитьДляКодировки(КодировкаТекста.UTF8NoBOM);
	ПрофильUTF16 = Определитель.ОпределитьДляКодировки(КодировкаТекста.UTF16);

	// Проверка
	Ожидаем.Что(ПрофильUTF8.Предупреждение).Равно("⚠ ");
	Ожидаем.Что(ПрофильUTF8.Информация).Равно("💡︎");
	Ожидаем.Что(ПрофильUTF8БезBOM.Предупреждение).Равно("⚠ ");
	Ожидаем.Что(ПрофильUTF16.Информация).Равно("💡︎");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИспользоватьБезопасныеМаркерыДляОстальныхКодировок() Экспорт

	// Подготовка
	Определитель = Новый ОпределительВозможностейТерминалаБенчмарков();

	// Действие
	ПрофильOEM = Определитель.ОпределитьДляКодировки(КодировкаТекста.OEM);
	ПрофильANSI = Определитель.ОпределитьДляКодировки(КодировкаТекста.ANSI);

	// Проверка
	Ожидаем.Что(ПрофильOEM.Предупреждение).Равно("[!]");
	Ожидаем.Что(ПрофильOEM.Информация).Равно("[i]");
	Ожидаем.Что(ПрофильANSI.Предупреждение).Равно("[!]");
	Ожидаем.Что(ПрофильANSI.Информация).Равно("[i]");

КонецПроцедуры

#КонецОбласти
