// BSLLS:LineLength-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать fluent
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

#Область Тесты

&Тест
Процедура ТестДолжен_ЗапуститьЭталонныйБенчмаркИзАннотации() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркиСЭталоном");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).ИмеетДлину(2);
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Эталон]).ЭтоЛожь();
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.КоэффициентПроизводительности]).Заполнено();
	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.Эталон]).ЭтоИстина();
	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.КоэффициентПроизводительности]).Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьЭталонныйБенчмаркИзКонфигурации() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	ДескрипторыБенчмарков.НайтиПоИмени("Бенчмарк").ИспользоватьКакЭталон();

	// Действие
	Результат = Бенчмаркинг.Запустить(ДескрипторыБенчмарков, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).ИмеетДлину(1);
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Эталон]).ЭтоИстина();
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.КоэффициентПроизводительности]).Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьЭталонныеБенчмаркиВРазныхКатегориях() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркиПоКатегориям");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	ДескрипторыБенчмарков.НайтиПоИмени("БенчмаркА1").ИспользоватьКакЭталон();
	ДескрипторыБенчмарков.НайтиПоИмени("БенчмаркБ1").ИспользоватьКакЭталон();

	// Действие
	Результат = Бенчмаркинг.Запустить(ДескрипторыБенчмарков, Конфигурация);

	// Проверка
	Таблица = Результат.Отчет.Таблица;
	СтрокаА1 = Таблица.Найти("БенчмаркА1", КолонкиОтчетаБенчмарков.Метод);
	СтрокаБ1 = Таблица.Найти("БенчмаркБ1", КолонкиОтчетаБенчмарков.Метод);

	Ожидаем.Что(СтрокаА1[КолонкиОтчетаБенчмарков.Эталон]).ЭтоИстина();
	Ожидаем.Что(СтрокаБ1[КолонкиОтчетаБенчмарков.Эталон]).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьБенчмаркСЭталоннойВерсиейСреды() Экспорт

	// Подготовка
	ТестированиеБенчмарков.ПодготовитьСреду("dev,stable");

	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);
	Конфигурация.ДобавитьИсполняющуюСреду("dev", "dev");
	Конфигурация.ДобавитьИсполняющуюСреду("stable", "stable", Истина);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).ИмеетДлину(2);

	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.ВерсияИсполняющейСреды]).Содержит("dev");
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Эталон]).ЭтоЛожь();
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.КоэффициентПроизводительности]).Больше(0);

	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.ВерсияИсполняющейСреды]).Содержит("stable");
	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.Эталон]).ЭтоИстина();
	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.КоэффициентПроизводительности]).Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИгнорироватьЭталонностьБенчмаркаПриНаличииЭталоннойВерсииСреды() Экспорт

	// Подготовка
	ТестированиеБенчмарков.ПодготовитьСреду("dev,stable");

	Тип = Тип("БенчмаркиСЭталоном");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	Конфигурация.ДобавитьИсполняющуюСреду("dev");
	Конфигурация.ДобавитьИсполняющуюСреду("stable", "stable", Истина);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Запуски = Результат.Запуски;

	Ожидаем.Что(Запуски).ИмеетДлину(4);
	Ожидаем.Что(Запуски[0].ЭтоЭталон, "Бенчмарк (dev) не должен быть эталоном").ЭтоЛожь();
	Ожидаем.Что(Запуски[0].Эталон.Кейс.ДескрипторБенчмарка().Метод(), "У Бенчмарк (dev) должен быть эталон Бенчмарк (stable)").Равно("Бенчмарк");
	Ожидаем.Что(Запуски[0].Эталон.Кейс.ИсполняющаяСреда().Версия, "У Бенчмарк (dev) должен быть эталон Бенчмарк (stable)").Равно("stable");
	Ожидаем.Что(Запуски[1].ЭтоЭталон, "БенчмаркЭталон (dev) не должен быть эталоном").ЭтоЛожь();
	Ожидаем.Что(Запуски[1].Эталон.Кейс.ДескрипторБенчмарка().Метод(), "У БенчмаркЭталон (dev) должен быть эталон БенчмаркЭталон (stable)").Равно("БенчмаркЭталон");
	Ожидаем.Что(Запуски[1].Эталон.Кейс.ИсполняющаяСреда().Версия, "У БенчмаркЭталон (dev) должен быть эталон БенчмаркЭталон (stable)").Равно("stable");
	Ожидаем.Что(Запуски[2].ЭтоЭталон, "Бенчмарк (stable) должен быть эталоном").ЭтоИстина();
	Ожидаем.Что(Запуски[3].ЭтоЭталон, "БенчмаркЭталон (stable) должен быть эталоном").ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьЭталонныйБенчмаркСРазнымиВерсиямиСреды() Экспорт

	// Подготовка
	ТестированиеБенчмарков.ПодготовитьСреду("dev,stable");

	Тип = Тип("БенчмаркиСЭталоном");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	Конфигурация.ДобавитьИсполняющуюСреду("dev");
	Конфигурация.ДобавитьИсполняющуюСреду("stable");

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Запуски = Результат.Запуски;

	Ожидаем.Что(Запуски).ИмеетДлину(4);
	Ожидаем.Что(Запуски[0].ЭтоЭталон, "Бенчмарк (dev) не должен быть эталоном").ЭтоЛожь();
	Ожидаем.Что(Запуски[0].Эталон.Кейс.ДескрипторБенчмарка().Метод(), "У Бенчмарк (dev) должен быть эталон БенчмаркЭталон (dev)").Равно("БенчмаркЭталон");
	Ожидаем.Что(Запуски[0].Эталон.Кейс.ИсполняющаяСреда().Версия, "У Бенчмарк (dev) должен быть эталон БенчмаркЭталон (dev)").Равно("dev");
	Ожидаем.Что(Запуски[1].ЭтоЭталон, "БенчмаркЭталон (dev) должен быть эталоном").ЭтоИстина();
	Ожидаем.Что(Запуски[2].ЭтоЭталон, "Бенчмарк (dev) не должен быть эталоном").ЭтоЛожь();
	Ожидаем.Что(Запуски[2].Эталон.Кейс.ДескрипторБенчмарка().Метод(), "У Бенчмарк (stable) должен быть эталон БенчмаркЭталон (stable)").Равно("БенчмаркЭталон");
	Ожидаем.Что(Запуски[2].Эталон.Кейс.ИсполняющаяСреда().Версия, "У Бенчмарк (stable) должен быть эталон БенчмаркЭталон (stable)").Равно("stable");
	Ожидаем.Что(Запуски[3].ЭтоЭталон, "БенчмаркЭталон (stable) должен быть эталоном").ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапретитьБолееОдногоЭталонногоБенчмарка() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркиСЭталоном");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	ДескрипторыБенчмарков.Получить(0).ИспользоватьКакЭталон();
	ДескрипторыБенчмарков.Получить(1).ИспользоватьКакЭталон();

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(ДескрипторыБенчмарков);
	ПараметрыМетода.Добавить(Конфигурация);

	// Действие и Проверка
	Ожидаем
		.Что(Бенчмаркинг)
		.Метод("Запустить", ПараметрыМетода)
		.ВыбрасываетИсключение("Обнаружено более одного эталонного бенчмарка без категории");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапретитьБолееОдногоЭталонногоБенчмаркаВКатегории() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркиПоКатегориям");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	ДескрипторыБенчмарков.Получить(0).ИспользоватьКакЭталон(); // А1
	ДескрипторыБенчмарков.Получить(1).ИспользоватьКакЭталон(); // А2

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(ДескрипторыБенчмарков);
	ПараметрыМетода.Добавить(Конфигурация);

	// Действие и Проверка
	Ожидаем
		.Что(Бенчмаркинг)
		.Метод("Запустить", ПараметрыМетода)
		.ВыбрасываетИсключение("обнаружено более одного эталонного бенчмарка");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапретитьБолееОднойЭталоннойВерсииСреды() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);
	Конфигурация.ДобавитьИсполняющуюСреду("dev", "dev", Истина);
	Конфигурация.ДобавитьИсполняющуюСреду("stable", "stable", Истина);

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Тип);
	ПараметрыМетода.Добавить(Конфигурация);

	// Действие и Проверка
	Ожидаем
		.Что(Бенчмаркинг)
		.Метод("Запустить", ПараметрыМетода)
		.ВыбрасываетИсключение("Допускается помечать как эталонную только одну среду выполнения");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьБенчмаркиСЭталономИПараметрами() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркиСЭталономИПараметрами");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка

	// Сценарий 1: эталон не должен быть найден, если имена параметров отличаются
	СтрокаБезЭталона = ПроцессорыКоллекций.ИзКоллекции(Результат.Запуски)
		.Фильтровать("Элемент -> Элемент.Кейс.ДескрипторБенчмарка().Метод() = ""БенчмаркВ""")
		.ПолучитьПервый();

	Ожидаем.Что(СтрокаБезЭталона.Эталон, "Эталон не должен быть найден при несовпадении имен параметров").Не_().Заполнено();

	// Сценарий 2: эталон не должен быть найден, если имена совпадают, но значения параметров различаются
	СтрокаБезЭталона = ПроцессорыКоллекций.ИзКоллекции(Результат.Запуски)
		.Фильтровать("Элемент -> Элемент.Кейс.ДескрипторБенчмарка().Метод() = ""БенчмаркБ"" И Элемент.Кейс.Параметры()[1].Имя() = ""Перем1"" И Элемент.Кейс.Параметры()[1].Значение() = 2")
		.ПолучитьПервый();

	Ожидаем.Что(СтрокаБезЭталона, "Не найдена строка бенчмарка ""БенчмаркБ"" со значением параметра 2").Заполнено();
	Ожидаем.Что(СтрокаБезЭталона.Эталон, "Эталон не должен быть найден при различии значений параметров").Не_().Заполнено();

	// Сценарий 3: эталон должен быть найден, если имя и значение параметра совпадают
	СтрокаБезЭталона = ПроцессорыКоллекций.ИзКоллекции(Результат.Запуски)
		.Фильтровать("Элемент -> Элемент.Кейс.ДескрипторБенчмарка().Метод() = ""БенчмаркБ"" И Элемент.Кейс.Параметры()[1].Имя() = ""Перем1"" И Элемент.Кейс.Параметры()[1].Значение() = 1")
		.ПолучитьПервый();

	Ожидаем.Что(СтрокаБезЭталона, "Не найдена строка бенчмарка ""БенчмаркБ"" со значением параметра 1").Заполнено();
	Ожидаем.Что(СтрокаБезЭталона.Эталон, "Эталон должен быть найден при совпадении имени и значения параметра").Заполнено();
	Ожидаем.Что(СтрокаБезЭталона.Эталон.Кейс.ДескрипторБенчмарка().Метод()).Равно("БенчмаркА");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьБенчмаркиСоСсылочнымиПараметрами() Экспорт

	// Подготовка
	Если ТестированиеБенчмарков.ЭтоOneScript1() Тогда
		Возврат;
	КонецЕсли;

	Тип = Тип("БенчмаркиСЭталономИПараметрами");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);

	ДескрипторыБенчмарков
		.НайтиПоИмени("БенчмаркА")
		.ОчиститьПараметры()
		.ДобавитьИсточникПараметров("МодульСИсточникамиПараметров.ПолучитьСсылочныеЗначения");

	ДескрипторыБенчмарков
		.НайтиПоИмени("БенчмаркБ")
		.ОчиститьПараметры()
		.ДобавитьИсточникПараметров("МодульСИсточникамиПараметров.ПолучитьСсылочныеЗначения");

	// Действие
	Результат = Бенчмаркинг.Запустить(ДескрипторыБенчмарков, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).ИмеетДлину(7);
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Метод]).Равно("БенчмаркВ");
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Эталон]).ЭтоЛожь();
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.КоэффициентПроизводительности]).Равно("?");

	Для к = 1 По 3 Цикл

		Инд1 = к * 2 - 1;
		Инд2 = к * 2;

		Ожидаем.Что(Результат.Отчет.Таблица[Инд1][КолонкиОтчетаБенчмарков.Метод]).Равно("БенчмаркА");
		Ожидаем.Что(Результат.Отчет.Таблица[Инд1][КолонкиОтчетаБенчмарков.Эталон]).ЭтоИстина();
		Ожидаем.Что(Результат.Отчет.Таблица[Инд1][КолонкиОтчетаБенчмарков.КоэффициентПроизводительности]).Равно(1);
		Ожидаем.Что(Результат.Отчет.Таблица[Инд2][КолонкиОтчетаБенчмарков.Метод]).Равно("БенчмаркБ");
		Ожидаем.Что(Результат.Отчет.Таблица[Инд2][КолонкиОтчетаБенчмарков.Эталон]).ЭтоЛожь();
		Ожидаем.Что(Результат.Отчет.Таблица[Инд2][КолонкиОтчетаБенчмарков.КоэффициентПроизводительности]).Заполнено();

	КонецЦикла;

	Ожидаем.Что(Результат.Запуски[3].Эталон.Кейс.Идентификатор()).Равно(1);
	Ожидаем.Что(Результат.Запуски[4].Эталон.Кейс.Идентификатор()).Равно(2);
	Ожидаем.Что(Результат.Запуски[5].Эталон.Кейс.Идентификатор()).Равно(3);

КонецПроцедуры

#КонецОбласти
