// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать "helpers"

&Тест
Процедура Тест_ПредставлениеБайт() Экспорт

	Кратность = 1024;

	ТестовыйНабор = Новый Соответствие();
	ТестовыйНабор[0] = "0 B";
	ТестовыйНабор[1] = "1 B";
	ТестовыйНабор[512] = "512 B";
	ТестовыйНабор[Кратность] = "1 KB";
	ТестовыйНабор[Pow(Кратность, 2) / 2] = "512 KB";
	ТестовыйНабор[Pow(Кратность, 2)] = "1 MB";
	ТестовыйНабор[Pow(Кратность, 3) / 2] = "512 MB";
	ТестовыйНабор[Pow(Кратность, 3)] = "1 GB";
	ТестовыйНабор[Pow(Кратность, 4)] = "1,024 GB";

	Для Каждого Строка Из ТестовыйНабор Цикл

		Байт = Строка.Ключ;
		Представление = Строка.Значение;

		Результат = ПредставленияПоказателейБенчмарков.ПредставлениеЧитаемое(
			Байт,
			ЕдиницыИзмеренийБенчмарков.Байт
		);

		Ожидаем.Что(Результат).Равно(Представление);

	КонецЦикла;
	
КонецПроцедуры

&Тест
Процедура Тест_ПредставлениеСекунд() Экспорт

	ТестовыйНабор = Новый Соответствие();
	ТестовыйНабор[0] = "0 ns";
	ТестовыйНабор[10] = "10 ns";
	ТестовыйНабор[100] = "100 ns";
	ТестовыйНабор[1000] = "1 us";
	ТестовыйНабор[10000] = "10 us";
	ТестовыйНабор[100000] = "100 us";
	ТестовыйНабор[1000000] = "1 ms";
	ТестовыйНабор[10000000] = "10 ms";
	ТестовыйНабор[100000000] = "100 ms";
	ТестовыйНабор[1000000000] = "1 s";
	ТестовыйНабор[10000000000] = "10 s";
	ТестовыйНабор[60000000000] = "60 s";
	ТестовыйНабор[600000000000] = "600 s";

	Для Каждого Строка Из ТестовыйНабор Цикл

		Наносекунд = Строка.Ключ;
		Представление = Строка.Значение;

		Результат = ПредставленияПоказателейБенчмарков.ПредставлениеЧитаемое(
			Наносекунд,
			ЕдиницыИзмеренийБенчмарков.Наносекунда
		);

		Ожидаем.Что(Результат).Равно(Представление);

	КонецЦикла;
	
КонецПроцедуры