// BSLLS:LineLength-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

#Область Тесты

&Тест
Процедура ТестДолжен_ИзвлечьКолонкиИзАннотации() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркиСКолонками");

	ПереченьКолонок = "Мин, Макс, Медиана, НижнийКвартиль, ВерхнийКвартиль, RatioSD";
	Колонки = СтрРазделить(ПереченьКолонок, ", ", Ложь);

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);
	
	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица;

	Для Каждого ИмяКолонки Из Колонки Цикл
		Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(ИмяКолонки), ИмяКолонки).Не_().ЭтоНеопределено();
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьКолонкиВКонфигурацию() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	ПереченьКолонок = "Мин, Макс, Медиана, НижнийКвартиль, ВерхнийКвартиль, RatioSD";
	Колонки = СтрРазделить(ПереченьКолонок, ", ", Ложь);

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	Для Каждого ИмяКолонки Из Колонки Цикл
		Конфигурация.ДобавитьКолонку(КолонкиОтчетаБенчмарков[ИмяКолонки]);
	КонецЦикла;

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);
	
	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица;

	Для Каждого ИмяКолонки Из Колонки Цикл
		Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(ИмяКолонки)).Не_().ЭтоНеопределено();
		Ожидаем.Что(ТаблицаОтчета[0][КолонкиОтчетаБенчмарков[ИмяКолонки]]).Заполнено();
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеДублироватьКолонкуПриПовторномДобавлении() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	ИмяКолонки = КолонкиОтчетаБенчмарков.Мин;

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	Конфигурация.ДобавитьКолонку(ИмяКолонки);
	Конфигурация.ДобавитьКолонку(ИмяКолонки);

	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);
	
	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица;

	Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(ИмяКолонки)).Не_().ЭтоНеопределено();
	Ожидаем.Что(ТаблицаОтчета[0][ИмяКолонки]).Заполнено();

КонецПроцедуры

&Тест
Процедура ТестДолжен_УдалитьКолонкуИзКонфигурации() Экспорт

	// Подготовка
	Колонка = КолонкиОтчетаБенчмарков.Мин;
	Тип = Тип("БенчмаркиСКолонками");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	Конфигурация.УдалитьКолонку(Колонка);

	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);
	
	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица;

	Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(Колонка)).ЭтоНеопределено();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИзвлечьКолонкиПроцентилейИзАннотации() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркиСКолонками");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица;

	КолонкаПроцентиль10 = КолонкиОтчетаБенчмарков.Процентиль(10);
	КолонкаПроцентиль80 = КолонкиОтчетаБенчмарков.Процентиль(80);

	Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(КолонкаПроцентиль10)).Не_().ЭтоНеопределено();
	Ожидаем.Что(ТаблицаОтчета[0][КолонкаПроцентиль10]).Заполнено();

	Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(КолонкаПроцентиль80)).Не_().ЭтоНеопределено();
	Ожидаем.Что(ТаблицаОтчета[0][КолонкаПроцентиль80]).Заполнено();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьКолонкиПроцентилейВКонфигурацию() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	Конфигурация.ДобавитьКолонку(КолонкиОтчетаБенчмарков.Процентиль(10));
	Конфигурация.ДобавитьКолонку(КолонкиОтчетаБенчмарков.Процентиль(80));

	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица;

	КолонкаПроцентиль10 = КолонкиОтчетаБенчмарков.Процентиль(10);
	КолонкаПроцентиль80 = КолонкиОтчетаБенчмарков.Процентиль(80);

	Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(КолонкаПроцентиль10)).Не_().ЭтоНеопределено();
	Ожидаем.Что(ТаблицаОтчета[0][КолонкаПроцентиль10]).Заполнено();

	Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(КолонкаПроцентиль80)).Не_().ЭтоНеопределено();
	Ожидаем.Что(ТаблицаОтчета[0][КолонкаПроцентиль80]).Заполнено();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьКолонкиПроцентилейВКонфигурациюПоУмолчанию() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	Конфигурация.ДобавитьКолонку(КолонкиОтчетаБенчмарков.Процентиль);

	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);
	
	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица;

	Для Каждого Процентиль Из КолонкаОтчетаБенчмарковПроцентиль.ПроцентилиПоУмолчанию() Цикл
		ИмяКолонки = КолонкиОтчетаБенчмарков.Процентиль(Процентиль);
		Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(ИмяКолонки)).Не_().ЭтоНеопределено();
		Ожидаем.Что(ТаблицаОтчета[0][ИмяКолонки]).Заполнено();
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьКолонкиПроцентилейВКонфигурациюПоУмолчаниюИПроизвольная() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	Конфигурация.ДобавитьКолонку(КолонкиОтчетаБенчмарков.Процентиль);
	Конфигурация.ДобавитьКолонку(КолонкиОтчетаБенчмарков.Процентиль(33));

	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	ТаблицаОтчета = Результат.Отчет.Таблица;

	Процентили = КолонкаОтчетаБенчмарковПроцентиль.ПроцентилиПоУмолчанию();
	Процентили.Добавить(33);

	Для Каждого Процентиль Из Процентили Цикл
		ИмяКолонки = КолонкиОтчетаБенчмарков.Процентиль(Процентиль);
		Ожидаем.Что(ТаблицаОтчета.Колонки.Найти(ИмяКолонки)).Не_().ЭтоНеопределено();
		Ожидаем.Что(ТаблицаОтчета[0][ИмяКолонки]).Заполнено();
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_УстановитьКаталогАртефактов() Экспорт

	// Подготовка
	Каталог = "path/to/artifacts";

	Конфигурация = Новый КонфигурацияБенчмарков();
	
	// Действие
	Конфигурация.УстановитьКаталогАртефактов(Каталог);

	// Проверка
	Ожидаем.Что(Конфигурация.КаталогАртефактов()).Равно(Каталог);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьЭкспортер() Экспорт

	// Подготовка
	Экспортер = ЭкспортерыРезультатовБенчмарков.Markdown;

	Конфигурация = Новый КонфигурацияБенчмарков();
	
	// Действие
	Конфигурация.ДобавитьЭкспортер(Экспортер);

	// Проверка
	Ожидаем.Что(Конфигурация.Экспортеры()).Содержит(Экспортер);

КонецПроцедуры

&Тест
Процедура ТестДолжен_УдалитьВсеЭкспортеры() Экспорт

	// Подготовка
	Экспортер = ЭкспортерыРезультатовБенчмарков.Markdown;

	Конфигурация = Новый КонфигурацияБенчмарков();
	Конфигурация.ДобавитьЭкспортер(Экспортер);
	
	// Действие
	Конфигурация.УдалитьЭкспортеры();

	// Проверка
	Ожидаем.Что(Конфигурация.Экспортеры()).ИмеетДлину(0);

КонецПроцедуры

#КонецОбласти