// BSLLS:LineLength-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

#Область Тесты

&Тест
Процедура ТестДолжен_СгенерироватьОдинКейсДляБенчмаркаБезПараметров() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ГенераторКейсов = Новый ГенераторКейсовБенчмарков(ДескрипторыБенчмарков, Конфигурация);

	// Действие
	Кейсы = ГенераторКейсов.СгенерироватьВсеКейсы();
	Кейс = Кейсы[0];

	// Проверка
	Ожидаем.Что(Кейсы).ИмеетДлину(1);
	Ожидаем.Что(Кейс.Идентификатор()).Равно(1);
	Ожидаем.Что(Кейс.ДескрипторБенчмарка().ТипКласса()).Равно(Тип);
	Ожидаем.Что(Кейс.Параметры()).ИмеетДлину(0);
	Ожидаем.Что(Кейс.ИсполняющаяСреда()).ИмеетТип("ИсполняющаяСредаБенчмарков");
	Ожидаем.Что(Кейс.ИсполняющаяСреда().Версия).Равно("");

КонецПроцедуры

&Тест
Процедура ТестДолжен_СгенерироватьМатрицуКейсовДляПараметровИИсполняющихСред() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиМетодаИПоля");
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.ДобавитьИсполняющуюСреду("dev")
		.ДобавитьИсполняющуюСреду("stable");
	ГенераторКейсов = Новый ГенераторКейсовБенчмарков(ДескрипторыБенчмарков, Конфигурация);

	// Действие
	Кейсы = ГенераторКейсов.СгенерироватьВсеКейсы();
	ПредставленияКейсов = ПредставленияКейсов(Кейсы);

	// Проверка
	Ожидаем.Что(Кейсы).ИмеетДлину(8);
	Ожидаем.Что(Кейсы[0].Идентификатор()).Равно(1);
	Ожидаем.Что(Кейсы[7].Идентификатор()).Равно(8);
	Ожидаем.Что(ПредставленияКейсов).Содержит("dev|1|3|4");
	Ожидаем.Что(ПредставленияКейсов).Содержит("dev|1|5|6");
	Ожидаем.Что(ПредставленияКейсов).Содержит("dev|2|3|4");
	Ожидаем.Что(ПредставленияКейсов).Содержит("dev|2|5|6");
	Ожидаем.Что(ПредставленияКейсов).Содержит("stable|1|3|4");
	Ожидаем.Что(ПредставленияКейсов).Содержит("stable|1|5|6");
	Ожидаем.Что(ПредставленияКейсов).Содержит("stable|2|3|4");
	Ожидаем.Что(ПредставленияКейсов).Содержит("stable|2|5|6");

КонецПроцедуры

&Тест
Процедура ТестДолжен_СгенерироватьТолькоЗапрошенныеКейсыПоИдентификаторам() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиМетода");
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ГенераторКейсов = Новый ГенераторКейсовБенчмарков(ДескрипторыБенчмарков, Конфигурация);
	ИдентификаторыКейсов = Новый Массив();
	ИдентификаторыКейсов.Добавить(2);

	// Действие
	Кейсы = ГенераторКейсов.СгенерироватьПоИдентификаторам(ИдентификаторыКейсов);
	Кейс = Кейсы[0];

	// Проверка
	Ожидаем.Что(Кейсы).ИмеетДлину(1);
	Ожидаем.Что(Кейс.Идентификатор()).Равно(2);
	Ожидаем.Что(ЗначениеПараметра(Кейс, "Парам1")).Равно(20);
	Ожидаем.Что(ЗначениеПараметра(Кейс, "Парам2")).Равно(200);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВыброситьИсключениеПриГенерацииКейсовСНеизвестнымИдентификатором() Экспорт

	// Подготовка
	Тип = Тип("ПустойБенчмарк");
	ДескрипторыБенчмарков = Новый КоллекцияДескрипторовБенчмарков(Тип);
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ГенераторКейсов = Новый ГенераторКейсовБенчмарков(ДескрипторыБенчмарков, Конфигурация);

	ИдентификаторыКейсов = Новый Массив();
	ИдентификаторыКейсов.Добавить(1);
	ИдентификаторыКейсов.Добавить(100);

	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(ИдентификаторыКейсов);

	// Действие и Проверка
	Ожидаем
		.Что(ГенераторКейсов)
		.Метод("СгенерироватьПоИдентификаторам", ПараметрыМетода)
		.ВыбрасываетИсключение("Не найдено 1 из 2 запрошенных кейсов. Ненайденные идентификаторы кейсов: 100");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставленияКейсов(Кейсы)

	Результат = Новый Массив();

	Для Каждого Кейс Из Кейсы Цикл
		Результат.Добавить(
			СтрШаблон(
				"%1|%2|%3|%4",
				Кейс.ИсполняющаяСреда().Версия,
				ЗначениеПараметра(Кейс, "ПолеОбщее"),
				ЗначениеПараметра(Кейс, "Парам1"),
				ЗначениеПараметра(Кейс, "Парам2")
			)
		);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ЗначениеПараметра(Кейс, ИмяПараметра)

	Для Каждого Параметр Из Кейс.Параметры() Цикл
		Если Параметр.Имя() = ИмяПараметра Тогда
			Возврат Параметр.Значение();
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

#КонецОбласти
