// BSLLS:LineLength-off

#Использовать asserts
#Использовать tempfiles
#Использовать "helpers"

Перем _МенеджерВременныхФайлов; // МенеджерВременныхФайлов
Перем _ИсходныйТекущийКаталог; // Строка
Перем _ПутьКМенеджеруПараметров; // Строка
Перем _КаталогОбщейБиблиотеки; // Строка

#Область ОбработчикиСобытий

&Инициализация
Процедура ПередВсеми() Экспорт

	_МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов();
	_ИсходныйТекущийКаталог = ТекущийКаталог();

	_КаталогОбщейБиблиотеки = ОбъединитьПути(
		_ИсходныйТекущийКаталог,
		"src/BenchmarkOneScript/core/common"
	);

	КаталогКлассовКонфигурации = ОбъединитьПути(
		_ИсходныйТекущийКаталог,
		"src/BenchmarkOneScript/core/config/Классы"
	);
	_ПутьКМенеджеруПараметров = ОбъединитьПути(
		КаталогКлассовКонфигурации,
		"МенеджерПараметровКонфигурацииOneScript.os"
	);

КонецПроцедуры

&Завершение
Процедура ПослеВсех() Экспорт

	УстановитьТекущийКаталог(_ИсходныйТекущийКаталог);
	_МенеджерВременныхФайлов.Удалить();

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ПриниматьСтрокуИФиксированныйМассивФайловКонфигурацииOneScript() Экспорт

	// Подготовка
	КаталогКонфигурации = _МенеджерВременныхФайлов.СоздатьКаталог();
	ЗаписатьКонфигурацию(
		КаталогКонфигурации,
		"benchmark-system",
		"benchmark-additional"
	);

	ПутьКДополнительнойКонфигурации = ПутьКФайлуКонфигурации(КаталогКонфигурации);
	ФайлыКонфигурацииOneScript = Новый Массив();
	ФайлыКонфигурацииOneScript.Добавить(ПутьКДополнительнойКонфигурации);
	ФиксированныеФайлыКонфигурацииOneScript = Новый ФиксированныйМассив(ФайлыКонфигурацииOneScript);

	// Действие
	ПараметрыИзСтроки = Новый МенеджерПараметровКонфигурацииOneScript(
		ПутьКДополнительнойКонфигурации
	).Прочитать();
	ПараметрыИзФиксированногоМассива = Новый МенеджерПараметровКонфигурацииOneScript(
		ФиксированныеФайлыКонфигурацииOneScript
	).Прочитать();

	// Проверка
	ОжидаемыйСистемныйКаталог = ПолныйПуть(КаталогКонфигурации, "benchmark-system");
	Ожидаем.Что(ПараметрыИзСтроки["lib.system"]).Равно(ОжидаемыйСистемныйКаталог);
	Ожидаем.Что(ПараметрыИзФиксированногоМассива["lib.system"]).Равно(ОжидаемыйСистемныйКаталог);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СохранитьПоддержкуДополнительногоКаталога() Экспорт

	// Подготовка
	КаталогКонфигурации = _МенеджерВременныхФайлов.СоздатьКаталог();
	ЗаписатьКонфигурацию(
		КаталогКонфигурации,
		"benchmark-system",
		"benchmark-additional"
	);

	// Действие
	Параметры = Новый МенеджерПараметровКонфигурацииOneScript(
		КаталогКонфигурации
	).Прочитать();

	// Проверка
	Ожидаем.Что(Параметры["lib.system"]).Равно(
		ПолныйПуть(КаталогКонфигурации, "benchmark-system")
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПриниматьНеопределенныеИПустыеДополнительныеФайлы() Экспорт

	// Подготовка
	КаталогКонфигурации = _МенеджерВременныхФайлов.СоздатьКаталог();
	ЗаписатьКонфигурацию(
		КаталогКонфигурации,
		"current-system",
		"current-additional"
	);
	УстановитьТекущийКаталог(КаталогКонфигурации);

	// Действие
	ПараметрыИзНеопределенного = Новый МенеджерПараметровКонфигурацииOneScript(Неопределено).Прочитать();
	ПараметрыИзПустойСтроки = Новый МенеджерПараметровКонфигурацииOneScript("").Прочитать();

	// Проверка
	ОжидаемыйСистемныйКаталог = ПолныйПуть(КаталогКонфигурации, "current-system");
	Ожидаем.Что(ПараметрыИзНеопределенного["lib.system"]).Равно(ОжидаемыйСистемныйКаталог);
	Ожидаем.Что(ПараметрыИзПустойСтроки["lib.system"]).Равно(ОжидаемыйСистемныйКаталог);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИгнорироватьКонфигурациюСтартовогоСценария() Экспорт

	// Подготовка
	КаталогСтартовогоСценария = _МенеджерВременныхФайлов.СоздатьКаталог();
	РабочийКаталог = _МенеджерВременныхФайлов.СоздатьКаталог();
	ПутьКСтартовомуСценарию = ОбъединитьПути(КаталогСтартовогоСценария, "main.os");
	ОтносительныйПутьИзСтартовойКонфигурации = "start-config-only-library";
	ЗаписатьТекст(
		ОбъединитьПути(КаталогСтартовогоСценария, "oscript.cfg"),
		"lib.additional=" + ОтносительныйПутьИзСтартовойКонфигурации
	);
	ЗаписатьТекст(
		ПутьКСтартовомуСценарию,
		ТекстСтартовогоСценария()
	);
	ПутьИзСтартовойКонфигурации = ПолныйПуть(
		КаталогСтартовогоСценария,
		ОтносительныйПутьИзСтартовойКонфигурации
	);

	// Действие
	Результат = ВыполнитьСтартовыйСценарий(
		ПутьКСтартовомуСценарию,
		РабочийКаталог
	);

	// Проверка
	Ожидаем.Что(
		Результат.КодВозврата,
		Результат.Вывод
	).Равно(0);
	Ожидаем.Что(Результат.Вывод).Не_().Содержит(ПутьИзСтартовойКонфигурации);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЧитатьИзДополнительныхФайловТолькоПутиБиблиотек() Экспорт

	// Подготовка
	КаталогОсновнойКонфигурации = _МенеджерВременныхФайлов.СоздатьКаталог();
	КаталогДополнительнойКонфигурации = _МенеджерВременныхФайлов.СоздатьКаталог();
	ЗаписатьТекст(
		ПутьКФайлуКонфигурации(КаталогОсновнойКонфигурации),
		"lib.system=./current-system
		|systemlanguage=ru
		|current.option=current"
	);
	ЗаписатьТекст(
		ПутьКФайлуКонфигурации(КаталогДополнительнойКонфигурации),
		"lib.system=./additional-system
		|lib.additional=./additional-library
		|systemlanguage=en
		|additional.option=additional"
	);
	УстановитьТекущийКаталог(КаталогОсновнойКонфигурации);
	МенеджерПараметров = Новый МенеджерПараметровКонфигурацииOneScript(
		ПутьКФайлуКонфигурации(КаталогДополнительнойКонфигурации)
	);

	// Действие
	Параметры = МенеджерПараметров.Прочитать();

	// Проверка
	Ожидаем.Что(Параметры["lib.system"]).Равно(
		ПолныйПуть(КаталогДополнительнойКонфигурации, "additional-system")
	);
	Ожидаем.Что(Параметры["systemlanguage"]).Равно("ru");
	Ожидаем.Что(Параметры["current.option"]).Равно("current");
	Ожидаем.Что(Параметры["additional.option"]).Равно(Неопределено);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЧитатьВсеПараметрыИзДополнительногоФайлаOneScript() Экспорт

	// Подготовка
	КаталогОсновнойКонфигурации = _МенеджерВременныхФайлов.СоздатьКаталог();
	КаталогДополнительнойКонфигурации = _МенеджерВременныхФайлов.СоздатьКаталог();
	ЗаписатьТекст(
		ПутьКФайлуКонфигурации(КаталогОсновнойКонфигурации),
		"systemlanguage=ru
		|custom.option=current"
	);
	ЗаписатьТекст(
		ПутьКФайлуКонфигурации(КаталогДополнительнойКонфигурации),
		"systemlanguage=en
		|custom.option=benchmark"
	);
	УстановитьТекущийКаталог(КаталогОсновнойКонфигурации);
	МенеджерПараметров = Новый МенеджерПараметровКонфигурацииOneScript(
		ПутьКФайлуКонфигурации(КаталогДополнительнойКонфигурации)
	).УчитыватьВсеПараметрыДополнительныхФайлов();

	// Действие
	Параметры = МенеджерПараметров.Прочитать();

	// Проверка
	Ожидаем.Что(Параметры["systemlanguage"]).Равно("en");
	Ожидаем.Что(Параметры["custom.option"]).Равно("benchmark");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДобавитьКаталогиБиблиотекИзВсехКонфигурацийПоПриоритету() Экспорт

	// Подготовка
	КаталогГлобальнойКонфигурации = _МенеджерВременныхФайлов.СоздатьКаталог();
	КаталогКонфигурацииСНизкимПриоритетом = _МенеджерВременныхФайлов.СоздатьКаталог();
	КаталогКонфигурацииСВысокимПриоритетом = _МенеджерВременныхФайлов.СоздатьКаталог();

	ЗаписатьКонфигурацию(
		КаталогГлобальнойКонфигурации,
		"global-system",
		"global-additional"
	);
	ЗаписатьКонфигурацию(
		КаталогКонфигурацииСНизкимПриоритетом,
		"low-system",
		"low-additional"
	);
	ЗаписатьКонфигурацию(
		КаталогКонфигурацииСВысокимПриоритетом,
		"high-system",
		"high-additional"
	);

	ДополнительныеФайлыКонфигурацииOneScript = Новый Массив();
	ДополнительныеФайлыКонфигурацииOneScript.Добавить(
		ПутьКФайлуКонфигурации(КаталогКонфигурацииСВысокимПриоритетом)
	);
	ДополнительныеФайлыКонфигурацииOneScript.Добавить(
		ПутьКФайлуКонфигурации(КаталогКонфигурацииСНизкимПриоритетом)
	);

	УстановитьТекущийКаталог(КаталогГлобальнойКонфигурации);
	МенеджерПараметров = Новый МенеджерПараметровКонфигурацииOneScript(
		ДополнительныеФайлыКонфигурацииOneScript
	);

	// Действие
	Параметры = МенеджерПараметров.Прочитать();
	КаталогиБиблиотек = СтрРазделить(Параметры["lib.additional"], ";", Ложь);

	// Проверка
	Ожидаем.Что(Параметры["lib.system"]).Равно(
		ПолныйПуть(КаталогКонфигурацииСВысокимПриоритетом, "high-system")
	);
	Ожидаем.Что(КаталогиБиблиотек.Количество()).БольшеИлиРавно(6);
	Ожидаем.Что(КаталогиБиблиотек[0]).Равно(
		ПолныйПуть(КаталогКонфигурацииСВысокимПриоритетом, "high-additional")
	);
	Ожидаем.Что(КаталогиБиблиотек[1]).Равно(
		ПолныйПуть(КаталогКонфигурацииСВысокимПриоритетом, "high-system")
	);
	Ожидаем.Что(КаталогиБиблиотек[2]).Равно(
		ПолныйПуть(КаталогКонфигурацииСНизкимПриоритетом, "low-additional")
	);
	Ожидаем.Что(КаталогиБиблиотек[3]).Равно(
		ПолныйПуть(КаталогКонфигурацииСНизкимПриоритетом, "low-system")
	);
	Ожидаем.Что(КаталогиБиблиотек[4]).Равно(
		ПолныйПуть(КаталогГлобальнойКонфигурации, "global-additional")
	);
	Ожидаем.Что(КаталогиБиблиотек[5]).Равно(
		ПолныйПуть(КаталогГлобальнойКонфигурации, "global-system")
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстСтартовогоСценария()

	Возврат СтрШаблон(
		"#Использовать ""%1""
		|
		|ПодключитьСценарий(""%2"", ""МенеджерПараметровКонфигурацииOneScript"");
		|МенеджерПараметров = Новый МенеджерПараметровКонфигурацииOneScript();
		|Параметры = МенеджерПараметров.Прочитать();
		|Сообщить(Параметры[""lib.additional""]);",
		_КаталогОбщейБиблиотеки,
		_ПутьКМенеджеруПараметров
	);

КонецФункции

Функция ВыполнитьСтартовыйСценарий(ПутьКСтартовомуСценарию, РабочийКаталог)

	СтрокаКоманды = СтрШаблон(
		"%1 %2",
		ЭкранированиеАргументовКоманднойСтроки.ОбернутьИсполняемыйФайлВКавычки(
			ПутьКИсполняемомуФайлуOneScript()
		),
		ЭкранированиеАргументовКоманднойСтроки.ОбернутьАргументКоманднойСтрокиВКавычки(
			ПутьКСтартовомуСценарию
		)
	);

	Возврат ТестированиеПроцессов.ВыполнитьКоманду(СтрокаКоманды, РабочийКаталог);

КонецФункции

Функция ПутьКИсполняемомуФайлуOneScript()

	ВариантыИмени = Новый Массив();
	ВариантыИмени.Добавить("oscript.exe");
	ВариантыИмени.Добавить("oscript");

	Для Каждого ИмяФайла Из ВариантыИмени Цикл
		ИсполняемыйФайл = Новый Файл(ОбъединитьПути(КаталогПрограммы(), ИмяФайла));
		Если ИсполняемыйФайл.Существует() И ИсполняемыйФайл.ЭтоФайл() Тогда
			Возврат ИсполняемыйФайл.ПолноеИмя;
		КонецЕсли;
	КонецЦикла;

	ВызватьИсключение "Не найден исполняемый файл текущей версии OneScript";

КонецФункции

Процедура ЗаписатьКонфигурацию(Каталог, СистемныйКаталог, ДополнительныйКаталог)

	ТекстКонфигурации = СтрШаблон(
		"lib.system=%1%3lib.additional=%2",
		СистемныйКаталог,
		ДополнительныйКаталог,
		Символы.ПС
	);
	ЗаписатьТекст(
		ОбъединитьПути(Каталог, "oscript.cfg"),
		ТекстКонфигурации
	);

КонецПроцедуры

Функция ПутьКФайлуКонфигурации(Каталог)

	Возврат ОбъединитьПути(Каталог, "oscript.cfg");

КонецФункции

Процедура ЗаписатьТекст(ПутьКФайлу, Текст)

	ЗаписьТекста = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	ЗаписьТекста.Записать(Текст);
	ЗаписьТекста.Закрыть();

КонецПроцедуры

Функция ПолныйПуть(Каталог, ОтносительныйПуть)

	Возврат Новый Файл(ОбъединитьПути(Каталог, ОтносительныйПуть)).ПолноеИмя;

КонецФункции

#КонецОбласти
