// BSLLS:LineLength-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать fluent
#Использовать tempfiles
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

Перем _МенеджерВременныхФайлов; // МенеджерВременныхФайлов

#Область ОбработчикиСобытий

&Инициализация
Процедура ПередВсеми() Экспорт
	_МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов();
КонецПроцедуры

&Завершение
Процедура ПослеВсех() Экспорт
	_МенеджерВременныхФайлов.Удалить();
КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ОбъединитьПустуюКонфигурациюСПолностьюЗаполненной() Экспорт

	// Подготовка
	ПередаваемаяКонфигурация = Новый КонфигурацияБенчмарков()
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск)
		.УстановитьКоличествоИтераций(111)
		.УстановитьКоличествоВызововЗаИтерацию(111)
		.УстановитьКоличествоПрогревочныхИтераций(111)
		.УстановитьМинимальноеВремяИтерации(111)
		.УстановитьМинимальноеКоличествоВызововЗаИтерацию(111)
		.УстановитьСортировкуОтчета(СортировкиОтчетаБенчмарков.ОтБыстрыхКМедленным)
		.УстановитьКаталогАртефактов("path")
		.ДобавитьМониторингПамяти()
		.ДобавитьПараметр("col1", 111)
		.ДобавитьПараметр("col2", 222)
		.ДобавитьОбработчикСобытия("Обработчик1", СобытияБенчмарков.ПередВсеми)
		.ДобавитьОбработчикСобытия("Обработчик2", СобытияБенчмарков.ПослеКаждогоКейса)
		.ДобавитьОбработчикСобытия("Обработчик3", СобытияБенчмарков.ПослеКаждогоКейса)
		.ДобавитьКолонку(КолонкиОтчетаБенчмарков.НижнийКвартиль)
		.ДобавитьКолонку(КолонкиОтчетаБенчмарков.ВерхнийКвартиль)
		.ДобавитьЭкспортер(ЭкспортерыРезультатовБенчмарков.Json)
		.ДобавитьЭкспортер(ЭкспортерыРезультатовБенчмарков.Html)
		.ДобавитьИсполняющуюСреду("dev")
		.ДобавитьИсполняющуюСреду("1.9.3")
		.ДобавитьИсточникПараметров("col1", "ПолучитьЗначения");

	// Действие
	НоваяКонфигурация = Новый КонфигурацияБенчмарков().Объединить(ПередаваемаяКонфигурация);

	// Проверка
	Ожидаем.Что(НоваяКонфигурация.Стратегия(), "Стратегия").Равно(СтратегииЗапускаБенчмарка.ХолодныйЗапуск);
	Ожидаем.Что(НоваяКонфигурация.КоличествоИтераций(), "Количество итераций").Равно(111);
	Ожидаем.Что(НоваяКонфигурация.КоличествоВызововЗаИтерацию(), "Количество вызовов за итерацию").Равно(111);
	Ожидаем.Что(НоваяКонфигурация.КоличествоПрогревочныхИтераций(), "Количество прогревочных итераций").Равно(111);
	Ожидаем.Что(НоваяКонфигурация.МинимальноеВремяИтерации(), "Минимальное время итерации").Равно(111);
	Ожидаем.Что(НоваяКонфигурация.МинимальноеКоличествоВызововЗаИтерацию(), "Минимальное количество вызовов за итерацию").Равно(111);
	Ожидаем.Что(НоваяКонфигурация.СортировкаОтчета(), "Сортировка отчета").Равно(СортировкиОтчетаБенчмарков.ОтБыстрыхКМедленным);
	Ожидаем.Что(НоваяКонфигурация.Параметры()[0].Имя(), "Параметры").Равно("col1");
	Ожидаем.Что(НоваяКонфигурация.Параметры()[1].Имя(), "Параметры").Равно("col2");
	Ожидаем.Что(НоваяКонфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПередВсеми)[0].ИмяМетода(), "Обработчики событий").Равно("Обработчик1");
	Ожидаем.Что(НоваяКонфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПослеКаждогоКейса)[0].ИмяМетода(), "Обработчики событий").Равно("Обработчик2");
	Ожидаем.Что(НоваяКонфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПослеКаждогоКейса)[1].ИмяМетода(), "Обработчики событий").Равно("Обработчик3");
	Ожидаем.Что(НоваяКонфигурация.Колонки(), "Колонки").Содержит(КолонкиОтчетаБенчмарков.НижнийКвартиль);
	Ожидаем.Что(НоваяКонфигурация.Колонки(), "Колонки").Содержит(КолонкиОтчетаБенчмарков.ВерхнийКвартиль);
	Ожидаем.Что(НоваяКонфигурация.Экспортеры(), "Экспортеры").Содержит(ЭкспортерыРезультатовБенчмарков.Json);
	Ожидаем.Что(НоваяКонфигурация.Экспортеры(), "Экспортеры").Содержит(ЭкспортерыРезультатовБенчмарков.Html);
	Ожидаем.Что(НоваяКонфигурация.ИсполняющиеСреды()[0].Версия, "Исполняющая среда (dev)").Равно("dev");
	Ожидаем.Что(НоваяКонфигурация.ИсполняющиеСреды()[1].Версия, "Исполняющая среда (1.9.3)").Равно("1.9.3");
	Ожидаем.Что(НоваяКонфигурация.ИсточникиПараметров()[0].ИмяПоля, "Источники параметров").Равно("col1");
	Ожидаем.Что(НоваяКонфигурация.ТребуетсяМониторингПамяти(), "Требуется мониторинг памяти").ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОбъединитьЗаполненнуюКонфигурациюСПустой() Экспорт

	// Подготовка
	ЗаполненнаяКонфигурация = Новый КонфигурацияБенчмарков()
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск)
		.УстановитьКоличествоИтераций(111)
		.УстановитьКоличествоВызововЗаИтерацию(111)
		.УстановитьКоличествоПрогревочныхИтераций(111)
		.УстановитьМинимальноеВремяИтерации(111)
		.УстановитьМинимальноеКоличествоВызововЗаИтерацию(111)
		.УстановитьСортировкуОтчета(СортировкиОтчетаБенчмарков.ОтБыстрыхКМедленным)
		.УстановитьКаталогАртефактов("path")
		.ДобавитьМониторингПамяти()
		.ДобавитьПараметр("col1", 111)
		.ДобавитьПараметр("col2", 222)
		.ДобавитьОбработчикСобытия("Обработчик1", СобытияБенчмарков.ПередВсеми)
		.ДобавитьОбработчикСобытия("Обработчик2", СобытияБенчмарков.ПослеКаждогоКейса)
		.ДобавитьОбработчикСобытия("Обработчик3", СобытияБенчмарков.ПослеКаждогоКейса)
		.ДобавитьКолонку(КолонкиОтчетаБенчмарков.НижнийКвартиль)
		.ДобавитьКолонку(КолонкиОтчетаБенчмарков.ВерхнийКвартиль)
		.ДобавитьЭкспортер(ЭкспортерыРезультатовБенчмарков.Json)
		.ДобавитьЭкспортер(ЭкспортерыРезультатовБенчмарков.Html)
		.ДобавитьИсполняющуюСреду("dev")
		.ДобавитьИсполняющуюСреду("1.9.3")
		.ДобавитьИсточникПараметров("col1", "ПолучитьЗначения");

	// Действие
	ЗаполненнаяКонфигурация.Объединить(Новый КонфигурацияБенчмарков());

	// Проверка
	Ожидаем.Что(ЗаполненнаяКонфигурация.Стратегия(), "Стратегия").Равно(СтратегииЗапускаБенчмарка.ХолодныйЗапуск);
	Ожидаем.Что(ЗаполненнаяКонфигурация.КоличествоИтераций(), "Количество итераций").Равно(111);
	Ожидаем.Что(ЗаполненнаяКонфигурация.КоличествоВызововЗаИтерацию(), "Количество вызовов за итерацию").Равно(111);
	Ожидаем.Что(ЗаполненнаяКонфигурация.КоличествоПрогревочныхИтераций(), "Количество прогревочных итераций").Равно(111);
	Ожидаем.Что(ЗаполненнаяКонфигурация.МинимальноеВремяИтерации(), "Минимальное время итерации").Равно(111);
	Ожидаем.Что(ЗаполненнаяКонфигурация.МинимальноеКоличествоВызововЗаИтерацию(), "Минимальное количество вызовов за итерацию").Равно(111);
	Ожидаем.Что(ЗаполненнаяКонфигурация.СортировкаОтчета(), "Сортировка отчета").Равно(СортировкиОтчетаБенчмарков.ОтБыстрыхКМедленным);
	Ожидаем.Что(ЗаполненнаяКонфигурация.Параметры()[0].Имя(), "Параметры").Равно("col1");
	Ожидаем.Что(ЗаполненнаяКонфигурация.Параметры()[1].Имя(), "Параметры").Равно("col2");
	Ожидаем.Что(ЗаполненнаяКонфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПередВсеми)[0].ИмяМетода(), "Обработчики событий").Равно("Обработчик1");
	Ожидаем.Что(ЗаполненнаяКонфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПослеКаждогоКейса)[0].ИмяМетода(), "Обработчики событий").Равно("Обработчик2");
	Ожидаем.Что(ЗаполненнаяКонфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПослеКаждогоКейса)[1].ИмяМетода(), "Обработчики событий").Равно("Обработчик3");
	Ожидаем.Что(ЗаполненнаяКонфигурация.Колонки(), "Колонки").Содержит(КолонкиОтчетаБенчмарков.НижнийКвартиль);
	Ожидаем.Что(ЗаполненнаяКонфигурация.Колонки(), "Колонки").Содержит(КолонкиОтчетаБенчмарков.ВерхнийКвартиль);
	Ожидаем.Что(ЗаполненнаяКонфигурация.Экспортеры(), "Экспортеры").Содержит(ЭкспортерыРезультатовБенчмарков.Json);
	Ожидаем.Что(ЗаполненнаяКонфигурация.Экспортеры(), "Экспортеры").Содержит(ЭкспортерыРезультатовБенчмарков.Html);
	Ожидаем.Что(ЗаполненнаяКонфигурация.ИсполняющиеСреды()[0].Версия, "Исполняющая среда (dev)").Равно("dev");
	Ожидаем.Что(ЗаполненнаяКонфигурация.ИсполняющиеСреды()[1].Версия, "Исполняющая среда (1.9.3)").Равно("1.9.3");
	Ожидаем.Что(ЗаполненнаяКонфигурация.ИсточникиПараметров()[0].ИмяПоля, "Источники параметров").Равно("col1");
	Ожидаем.Что(ЗаполненнаяКонфигурация.ТребуетсяМониторингПамяти(), "Требуется мониторинг памяти").ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОбъединитьЗаполненныеКонфигурации() Экспорт

	// Подготовка
	КонфигурацияПриемник = Новый КонфигурацияБенчмарков()
		.УстановитьКоличествоИтераций(111)
		.УстановитьКоличествоВызововЗаИтерацию(111)
		.ДобавитьКолонку(КолонкиОтчетаБенчмарков.НижнийКвартиль)
		.ДобавитьОбработчикСобытия("Обработчик1", СобытияБенчмарков.ПередВсеми)
		.ДобавитьОбработчикСобытия("Обработчик2", СобытияБенчмарков.ПослеВсех)
		.ДобавитьИсточникПараметров("col1", "ПолучитьМассив");

	КонфигурацияИсточник = Новый КонфигурацияБенчмарков()
		.УстановитьКоличествоИтераций(222)
		.ДобавитьКолонку(КолонкиОтчетаБенчмарков.ВерхнийКвартиль)
		.ДобавитьЭкспортер(ЭкспортерыРезультатовБенчмарков.Html)
		.ДобавитьОбработчикСобытия("Обработчик3", СобытияБенчмарков.ПослеВсех)
		.ДобавитьИсточникПараметров("col1", "ПолучитьТаблицуЗначений");

	// Действие
	КонфигурацияПриемник.Объединить(КонфигурацияИсточник);

	// Проверка
	ИсточникиПараметров = КонфигурацияПриемник.ИсточникиПараметров();
	ОбработчикиСобытияПередВсеми = КонфигурацияПриемник.ОбработчикиСобытия(СобытияБенчмарков.ПередВсеми);
	ОбработчикиСобытияПослеВсех = КонфигурацияПриемник.ОбработчикиСобытия(СобытияБенчмарков.ПослеВсех);

	Ожидаем.Что(КонфигурацияПриемник.КоличествоИтераций(), "Количество итераций").Равно(222);
	Ожидаем.Что(КонфигурацияПриемник.КоличествоВызововЗаИтерацию(), "Количество вызовов за итерацию").Равно(111);
	Ожидаем.Что(КонфигурацияПриемник.КоличествоПрогревочныхИтераций(), "Количество прогревочных итераций").Равно(6);
	Ожидаем.Что(КонфигурацияПриемник.Колонки(), "Колонки").ИмеетДлину(1);
	Ожидаем.Что(КонфигурацияПриемник.Колонки(), "Колонки").Содержит(КолонкиОтчетаБенчмарков.ВерхнийКвартиль);
	Ожидаем.Что(КонфигурацияПриемник.Экспортеры(), "Экспортеры").Содержит(ЭкспортерыРезультатовБенчмарков.Html);
	Ожидаем.Что(ОбработчикиСобытияПередВсеми, "Обработчики событий").ИмеетДлину(0);
	Ожидаем.Что(ОбработчикиСобытияПослеВсех, "Обработчики событий").ИмеетДлину(1);
	Ожидаем.Что(ОбработчикиСобытияПослеВсех[0].ИмяМетода(), "Обработчики событий").Равно("Обработчик3");
	Ожидаем.Что(ИсточникиПараметров[0].Источник, "Источники параметров").Равно("ПолучитьТаблицуЗначений");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОбъединитьКонфигурацииСДефолтнымиЗначениями() Экспорт

	// Подготовка
	КоличествоИтерацийПоУмолчанию = 15;

	КонфигурацияПриемник = Новый КонфигурацияБенчмарков()
		.УстановитьКоличествоИтераций(111)
		.УстановитьКоличествоВызововЗаИтерацию(111)
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск);

	КонфигурацияИсточник = Новый КонфигурацияБенчмарков()
		.УстановитьКоличествоИтераций(КоличествоИтерацийПоУмолчанию)
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ПропускнаяСпособность);

	// Действие
	КонфигурацияПриемник.Объединить(КонфигурацияИсточник);

	// Проверка
	Ожидаем.Что(КонфигурацияПриемник.КоличествоИтераций(), "Количество итераций").Равно(КоличествоИтерацийПоУмолчанию);
	Ожидаем.Что(КонфигурацияПриемник.КоличествоВызововЗаИтерацию(), "Количество вызовов за итерацию").Равно(111);
	Ожидаем.Что(КонфигурацияПриемник.Стратегия(), "Стратегия").Равно(СтратегииЗапускаБенчмарка.ПропускнаяСпособность);

КонецПроцедуры

#КонецОбласти
