// BSLLS:LineLength-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off

#Использовать asserts
#Использовать fluent
#Использовать "helpers"
#Использовать "fixtures/benchmarks"

#Область Тесты

&Тест
Процедура ТестДолжен_ИзвлечьКонфигурациюИзАннотаций() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСАннотациямиКонфигурации");

	// Действие
	Конфигурация = Новый КонфигурацияБенчмарков(Тип);

	// Проверка
	ПроверитьКонфигурациюБенчмаркаСАннотациямиКонфигурации(Конфигурация);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИзвлечьПараметрыПоляИзАннотации() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиПоля");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип);
	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).Заполнено();
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Параметр("Значение")]).Равно(10);
	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.Параметр("Значение")]).Равно(100);

КонецПроцедуры

&Тест
Процедура ТестДолжен_УстановитьПараметрыПоля() Экспорт

	// Подготовка
	Тип = Тип("БенчмаркСПараметрамиПоля");

	Конфигурация = Новый КонфигурацияБенчмарков(Тип)
		.ОчиститьПараметры()
		.ДобавитьПараметр("Значение", 50)
		.ДобавитьПараметр("Значение", 150);

	ТестированиеБенчмарков.НастроитьКонфигурациюПодТесты(Конфигурация);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип, Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).Заполнено();
	Ожидаем.Что(Результат.Отчет.Таблица[0][КолонкиОтчетаБенчмарков.Параметр("Значение")]).Равно(50);
	Ожидаем.Что(Результат.Отчет.Таблица[1][КолонкиОтчетаБенчмарков.Параметр("Значение")]).Равно(150);

КонецПроцедуры

&Тест
Процедура ТестДолжен_УстановитьКоличествоИтераций() Экспорт

	// Подготовка
	КоличествоИтераций = 2;

	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию();
	Конфигурация.УстановитьКоличествоИтераций(КоличествоИтераций);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип("ПустойБенчмарк"), Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски[0].Замеры.Количество()).Равно(КоличествоИтераций);

КонецПроцедуры

&Тест
Процедура ТестДолжен_УстановитьКоличествоВызововЗаИтерацию() Экспорт

	// Подготовка
	КоличествоВызововЗаИтерацию = 2;

	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию()
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ПропускнаяСпособность)
		.УстановитьКоличествоВызововЗаИтерацию(КоличествоВызововЗаИтерацию);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип("ПустойБенчмарк"), Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски[0].Замеры[0].КоличествоОпераций).Равно(КоличествоВызововЗаИтерацию);

КонецПроцедуры

&Тест
Процедура ТестДолжен_УстановитьКоличествоПрогревочныхИтераций() Экспорт

	// Подготовка
	КоличествоПрогревочныхИтераций = 2;

	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию()
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ПропускнаяСпособность)
		.УстановитьКоличествоПрогревочныхИтераций(КоличествоПрогревочныхИтераций);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип("ПустойБенчмарк"), Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).Заполнено();
	Ожидаем.Что(Результат.Конфигурация.КоличествоПрогревочныхИтераций()).Равно(КоличествоПрогревочныхИтераций);

КонецПроцедуры

&Тест
Процедура ТестДолжен_УстановитьМинимальноеВремяИтерации() Экспорт

	// Подготовка
	МинимальноеВремяИтерации = 50;
	КоличествоВызововЗаИтерацию = 0;

	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию()
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ПропускнаяСпособность)
		.УстановитьКоличествоВызововЗаИтерацию(КоличествоВызововЗаИтерацию)
		.УстановитьМинимальноеВремяИтерации(МинимальноеВремяИтерации);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип("ПустойБенчмарк"), Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).Заполнено();
	Ожидаем.Что(Результат.Конфигурация.МинимальноеВремяИтерации()).Равно(МинимальноеВремяИтерации);

КонецПроцедуры

&Тест
Процедура ТестДолжен_УстановитьМинимальноеКоличествоВызововЗаИтерацию() Экспорт

	// Подготовка
	КоличествоВызововЗаИтерацию = 0;
	МинимальноеКоличествоВызововЗаИтерацию = 10;

	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию()
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ПропускнаяСпособность)
		.УстановитьКоличествоВызововЗаИтерацию(КоличествоВызововЗаИтерацию)
		.УстановитьМинимальноеКоличествоВызововЗаИтерацию(МинимальноеКоличествоВызововЗаИтерацию);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип("ПустойБенчмарк"), Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).Заполнено();

	Ожидаем
		.Что(Результат.Конфигурация.МинимальноеКоличествоВызововЗаИтерацию())
		.Равно(МинимальноеКоличествоВызововЗаИтерацию);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПрименитьСтратегиюПропускнаяСпособность() Экспорт

	// Подготовка
	КоличествоВызововЗаИтерацию = 2;

	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию()
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ПропускнаяСпособность)
		.УстановитьКоличествоВызововЗаИтерацию(КоличествоВызововЗаИтерацию);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип("ПустойБенчмарк"), Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).Заполнено();
	Ожидаем.Что(Результат.Запуски[0].Замеры[0].КоличествоОпераций).Равно(КоличествоВызововЗаИтерацию);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПрименитьСтратегиюХолодныйЗапуск() Экспорт

	// Подготовка
	КоличествоВызововЗаИтерацию = 2;

	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию()
		.УстановитьСтратегию(СтратегииЗапускаБенчмарка.ХолодныйЗапуск)
		.УстановитьКоличествоВызововЗаИтерацию(КоличествоВызововЗаИтерацию);

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип("ПустойБенчмарк"), Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Отчет.Таблица).Заполнено();
	Ожидаем.Что(Результат.Запуски[0].Замеры[0].КоличествоОпераций).Равно(1);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВключитьМониторингПамяти() Экспорт

	// Подготовка
	Конфигурация = ТестированиеБенчмарков.КонфигурацияПоУмолчанию();
	Конфигурация.ДобавитьМониторингПамяти();

	// Действие
	Результат = Бенчмаркинг.Запустить(Тип("ПустойБенчмарк"), Конфигурация);

	// Проверка
	Ожидаем.Что(Результат.Запуски[0].Статистика.ВыделяемаяПамять).Заполнено();
	Ожидаем.Что(Результат.Конфигурация.ТребуетсяМониторингПамяти()).ЭтоИстина();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьКонфигурациюБенчмаркаСАннотациямиКонфигурации(Конфигурация)

	Экспортеры = Конфигурация.Экспортеры();
	КоллекцияЭкспортеры = ПроцессорыКоллекций.ИзКоллекции(Экспортеры);
	ИсполняющиеСреды = Конфигурация.ИсполняющиеСреды();
	Колонки = Конфигурация.Колонки();
	Параметры = Конфигурация.Параметры();
	ИсточникиПараметров = Конфигурация.ИсточникиПараметров();

	ФункцияПоискаЭкспортера = "Экспортер -> ТипЗнч(Экспортер) = Тип(""ЭкспортерРезультатовБенчмарковВ%1"")";

	Ожидаем.Что(Конфигурация.Стратегия()).Равно(СтратегииЗапускаБенчмарка.ХолодныйЗапуск);
	Ожидаем.Что(Конфигурация.СортировкаОтчета()).Равно(СортировкиОтчетаБенчмарков.ОтБыстрыхКМедленным);
	Ожидаем.Что(Конфигурация.ТребуетсяМониторингПамяти()).ЭтоИстина();
	Ожидаем.Что(Конфигурация.КоличествоИтераций()).Равно(100);
	Ожидаем.Что(Конфигурация.КоличествоВызововЗаИтерацию()).Равно(200);
	Ожидаем.Что(Конфигурация.КоличествоПрогревочныхИтераций()).Равно(300);
	Ожидаем.Что(Конфигурация.МинимальноеВремяИтерации()).Равно(400);
	Ожидаем.Что(Конфигурация.МинимальноеКоличествоВызововЗаИтерацию()).Равно(500);		
	Ожидаем.Что(Конфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПередВсеми)[0].ИмяМетода(), "Обработчики").Равно("ПередВсеми");
	Ожидаем.Что(Конфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПослеВсех)[0].ИмяМетода(), "Обработчики").Равно("ПослеВсех");
	Ожидаем.Что(Конфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПередКаждымКейсом)[0].ИмяМетода(), "Обработчики").Равно("ПередКаждымКейсом");
	Ожидаем.Что(Конфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПослеКаждогоКейса)[0].ИмяМетода(), "Обработчики").Равно("ПослеКаждогоКейса");
	Ожидаем.Что(Конфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПередИтерацией)[0].ИмяМетода(), "Обработчики").Равно("ПередИтерацией");
	Ожидаем.Что(Конфигурация.ОбработчикиСобытия(СобытияБенчмарков.ПослеИтерации)[0].ИмяМетода(), "Обработчики").Равно("ПослеИтерации");
	Ожидаем.Что(Конфигурация.КаталогАртефактов()).Равно("path/to/artifacts");
	Ожидаем.Что(КоллекцияЭкспортеры.ЛюбойСоответствует(СтрШаблон(ФункцияПоискаЭкспортера, "Markdown"))).ЭтоИстина();
	Ожидаем.Что(КоллекцияЭкспортеры.ЛюбойСоответствует(СтрШаблон(ФункцияПоискаЭкспортера, "Json"))).ЭтоИстина();
	Ожидаем.Что(КоллекцияЭкспортеры.ЛюбойСоответствует(СтрШаблон(ФункцияПоискаЭкспортера, "Html"))).ЭтоИстина();
	Ожидаем.Что(ИсполняющиеСреды, "Должно быть 4 версии исполняющей среды").ИмеетДлину(4);
	Ожидаем.Что(ИсполняющиеСреды[0].Версия, "Версия исполняющей среды stable").Равно("stable");
	Ожидаем.Что(ИсполняющиеСреды[1].Версия, "Версия исполняющей среды 1.9.3").Равно("1.9.3");
	Ожидаем.Что(ИсполняющиеСреды[2].Версия, "Версия исполняющей среды 1.9.4").Равно("1.9.4");
	Ожидаем.Что(ИсполняющиеСреды[3].Версия, "Версия исполняющей среды 2.0.0").Равно("2.0.0");
	Ожидаем.Что(ИсполняющиеСреды[3].Наименование, "Наименование исполняющей среды 2.0.0").Равно("Новая");
	Ожидаем.Что(ИсполняющиеСреды[3].ЭтоЭталон, "Исполняющая среда версии 2.0.0 - эталонная").ЭтоИстина();
	Ожидаем.Что(Колонки, "Колонки").Содержит(КолонкиОтчетаБенчмарков.Мин);
	Ожидаем.Что(Колонки, "Колонки").Содержит(КолонкиОтчетаБенчмарков.Макс);
	Ожидаем.Что(Параметры, "Параметры").ИмеетДлину(2);
	Ожидаем.Что(Параметры[0], "Параметры").ИмеетТип("ПараметрБенчмарка");
	Ожидаем.Что(Параметры[0].Значение(), "Параметры").Равно(100);
	Ожидаем.Что(Параметры[1].Значение(), "Параметры").Равно(200);
	Ожидаем.Что(ИсточникиПараметров, "Источники параметров").ИмеетДлину(1);
	Ожидаем.Что(ИсточникиПараметров[0].ИмяПоля, "Источники параметров").Равно("ОбщееЗначение");
	Ожидаем.Что(ИсточникиПараметров[0].Источник, "Источники параметров").Равно("ПолучитьЗначения");

КонецПроцедуры

#КонецОбласти
