
#Использовать fs

// Записывает артефакты результата запуска.
//
// Параметры:
//   РезультатЗапуска - РезультатЗапускаБенчмарков - Результат запуска бенчмарков.
//   Каталог - Строка - Каталог артефактов.
//
// Возвращаемое значение:
//   Массив из Строка - Полные имена созданных файлов.
Функция Записать(РезультатЗапуска, Знач Каталог = "") Экспорт
	
	ИмяФайла = ИмяФайлаОтчета(РезультатЗапуска);
	МаскаФайлов = СтрШаблон("%1.*", ИмяФайла);
	Экспортеры = РезультатЗапуска.Конфигурация.Экспортеры();
	Каталог = ?(Каталог = "", РезультатЗапуска.Конфигурация.КаталогАртефактов(), Каталог);
	Файлы = Новый Массив();

	Если Не ЗначениеЗаполнено(Каталог) Или Экспортеры.Количество() = 0 Тогда
		Возврат Файлы;
	КонецЕсли;
	
	ФС.ОбеспечитьКаталог(Каталог);
	ФС.УдалитьФайлы(Каталог, МаскаФайлов);

	Для Каждого Экспортер Из Экспортеры Цикл

		ИмяФайлаСРасширением = СтрШаблон("%1.%2", ИмяФайла, Экспортер.Расширение());
		ПолноеИмяФайла = ФС.НормализоватьПуть(ОбъединитьПути(Каталог, ИмяФайлаСРасширением));

		Экспортер.Записать(РезультатЗапуска, ПолноеИмяФайла);

		Файлы.Добавить(ПолноеИмяФайла);

	КонецЦикла;

	Возврат Файлы;

КонецФункции

Функция ИмяФайлаОтчета(РезультатЗапуска)

	ДобавленныеТипы = Новый МножествоКарта();
	ПервыйТип = Неопределено;

	Для Каждого ДескрипторБенчмарка Из РезультатЗапуска.ДескрипторыБенчмарков.ВМассив() Цикл

		ТипКласса = ДескрипторБенчмарка.ТипКласса();
		Если ПервыйТип = Неопределено Тогда
			ПервыйТип = ТипКласса;
		КонецЕсли;

		ДобавленныеТипы.Добавить(Строка(ТипКласса));
		Если ДобавленныеТипы.Количество() > 1 Тогда
			Возврат "benchmarks-report";
		КонецЕсли;

	КонецЦикла;

	Если ПервыйТип = Неопределено Тогда
		Возврат "benchmark-report";
	КонецЕсли;

	Возврат СтрШаблон("%1-report", Строка(ПервыйТип));

КонецФункции
