Перем ПутьКЛогу Экспорт;
Перем ЗаписьЛога; // ЗаписьТекста

&Бенчмарк
Процедура Бенчмарк() Экспорт
КонецПроцедуры

&ПередВсеми
Процедура ПередВсеми(Контекст) Экспорт

	Конфигурация = Контекст.Конфигурация;
	ДескрипторыБенчмарков = Контекст.ДескрипторыБенчмарков;

	ПутьКФайлу = Конфигурация.Параметры()[0].Значение();
	ЗаписьЛога = Новый ЗаписьТекста(ПутьКФайлу);
	ЗаписьЛога.ЗаписатьСтроку("ПередВсеми");

КонецПроцедуры

&ПослеВсех
Процедура ПослеВсех(Контекст) Экспорт	

	ДескрипторыБенчмарков = Контекст.ДескрипторыБенчмарков;
	Конфигурация = Контекст.Конфигурация;
	Запуски = Контекст.Запуски;
	Отчет = Контекст.Отчет;
	СредаОкружения = Контекст.СредаОкружения;

	ЗаписьЛога.ЗаписатьСтроку("ПослеВсех");
	ЗаписьЛога.Закрыть();

КонецПроцедуры

&ПередКаждымКейсом
Процедура ПередКаждымКейсом(Контекст) Экспорт

	Кейс = Контекст.Кейс;

	ЗаписьЛога.ЗаписатьСтроку("ПередКаждымКейсом");

КонецПроцедуры

&ПослеКаждогоКейса
Процедура ПослеКаждогоКейса(Контекст) Экспорт

	Кейс = Контекст.Кейс;
	Замеры = Контекст.Замеры;
	Статистика = Контекст.Статистика;

	ЗаписьЛога.ЗаписатьСтроку("ПослеКаждогоКейса");

КонецПроцедуры

// Обратная совместимость
&ПередКаждым
Процедура ПередКаждым(Контекст) Экспорт

	Кейс = Контекст.Кейс;

	ЗаписьЛога.ЗаписатьСтроку("ПередКаждым");
КонецПроцедуры

// Обратная совместимость
&ПослеКаждого
Процедура ПослеКаждого(Контекст) Экспорт

	Кейс = Контекст.Кейс;
	Замеры = Контекст.Замеры;
	Статистика = Контекст.Статистика;

	ЗаписьЛога.ЗаписатьСтроку("ПослеКаждого");

КонецПроцедуры

&ПередИтерацией
Процедура ПередИтерацией(Контекст) Экспорт

	Кейс = Контекст.Кейс;
	Этап = Контекст.Этап;
	НомерИтерации = Контекст.НомерИтерации;

	ЗаписьЛога.ЗаписатьСтроку("ПередИтерацией");

КонецПроцедуры

&ПослеИтерации
Процедура ПослеИтерации(Контекст) Экспорт

	Кейс = Контекст.Кейс;
	Этап = Контекст.Этап;
	НомерИтерации = Контекст.НомерИтерации;
	РезультатИтерации = Контекст.РезультатИтерации;

	ЗаписьЛога.ЗаписатьСтроку("ПослеИтерации");

КонецПроцедуры

Процедура БезАннотации(Контекст) Экспорт
	ЗаписьЛога.ЗаписатьСтроку("БезАннотации");
КонецПроцедуры