#Использовать "../../paramsSources"
#Использовать "../../handlers"

&Параметры(1, 2)
Перем ПолеОбщее Экспорт;

&Бенчмарк
&Параметры(3, 4)
&Параметры(5, 6)
Процедура Бенчмарк(Парам1, Парам2) Экспорт
КонецПроцедуры

Функция СоставныеПараметры() Экспорт

	Результат = Новый Массив();

	// Таблица
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("Колонка");
	Таблица.Добавить().Колонка = 1;
	
	Результат.Добавить(Таблица);

	// Несериализуемый
	Результат.Добавить(Новый ЧтениеXML());

	// Сериализуемый объект класса
	Объект = Новый БенчмаркСПараметрамиМетодаИПоля();
	Объект.ПолеОбщее = Истина;

	Результат.Добавить(Объект);

	Возврат Результат;

КонецФункции
