&ПослеКаждогоКейса
Процедура УстановитьНестабильноеВремя(Контекст) Экспорт

	Для Каждого СтрокаТаблицы Из Контекст.Замеры Цикл
		Если СтрокаТаблицы.Этап = ЭтапыБенчмарка.Измерение Тогда
			Задержка = СтрокаТаблицы.НомерИтерации * ЕдиницыИзмеренийБенчмарков.Миллисекунда.ОтношениеКБазовой;
			СтрокаТаблицы.НаносекундЗаОперацию = Задержка;
			СтрокаТаблицы.Наносекунд = Задержка * СтрокаТаблицы.КоличествоОпераций;
		КонецЕсли;
	КонецЦикла;

	Контекст.Статистика.Прочитать(Контекст.Замеры);

КонецПроцедуры

&Бенчмарк
Процедура Бенчмарк() Экспорт
КонецПроцедуры
