Перем ПутьКЛогу Экспорт;
Перем ЗаписьЛога; // ЗаписьТекста

&Бенчмарк
Процедура Бенчмарк() Экспорт
КонецПроцедуры

&ПередВсеми
Процедура ПередВсеми(Контекст) Экспорт

	Конфигурация = Контекст.Конфигурация;
	ДескрипторыБенчмарков = Контекст.ДескрипторыБенчмарков;

	ПутьКФайлу = Конфигурация.Параметры()[0].Значение();
	ЗаписьЛога = Новый ЗаписьТекста(ПутьКФайлу);
	ЗаписьЛога.ЗаписатьСтроку("ПередВсеми");

КонецПроцедуры

&ПослеВсех
Процедура ПослеВсех(Контекст) Экспорт	

	ДескрипторыБенчмарков = Контекст.ДескрипторыБенчмарков;
	Конфигурация = Контекст.Конфигурация;
	Запуски = Контекст.Запуски;
	Отчет = Контекст.Отчет;
	СредаОкружения = Контекст.СредаОкружения;

	ЗаписьЛога.ЗаписатьСтроку("ПослеВсех");
	ЗаписьЛога.Закрыть();

КонецПроцедуры

&ПередКаждым
Процедура ПередКаждым(Контекст) Экспорт

	ДескрипторБенчмарка = Контекст.ДескрипторБенчмарка;
	ПараметрыМетода = Контекст.ПараметрыМетода;

	ЗаписьЛога.ЗаписатьСтроку("ПередКаждым");
	
КонецПроцедуры

&ПослеКаждого
Процедура ПослеКаждого(Контекст) Экспорт

	ДескрипторБенчмарка = Контекст.ДескрипторБенчмарка;
	Параметры = Контекст.Параметры;
	Замеры = Контекст.Замеры;
	Статистика = Контекст.Статистика;

	ЗаписьЛога.ЗаписатьСтроку("ПослеКаждого");

КонецПроцедуры

Процедура БезАннотации(Контекст) Экспорт
	ЗаписьЛога.ЗаписатьСтроку("БезАннотации");
КонецПроцедуры