&ПослеКаждогоКейса
Процедура ДобавитьСтабильныйЗамерДляСредыStable(Контекст) Экспорт

	Если Контекст.Кейс.ИсполняющаяСреда().Версия <> "stable" Тогда
		Возврат;
	КонецЕсли;

	ИсходныйЗамер = Контекст.Замеры[0];
	ДополнительныйЗамер = Новый РезультатИтерацииКейса();
	ДополнительныйЗамер.Этап = ИсходныйЗамер.Этап;
	ДополнительныйЗамер.НомерИтерации = 2;
	ДополнительныйЗамер.КоличествоОпераций = ИсходныйЗамер.КоличествоОпераций;
	ДополнительныйЗамер.Наносекунд = ИсходныйЗамер.Наносекунд;
	ДополнительныйЗамер.НаносекундЗаОперацию = ИсходныйЗамер.НаносекундЗаОперацию;
	Контекст.Замеры.Добавить(ДополнительныйЗамер);
	Контекст.Статистика.Прочитать(Контекст.Замеры);

КонецПроцедуры

&Бенчмарк
Процедура Бенчмарк() Экспорт
КонецПроцедуры
