// Пример адаптивного подбора числа итераций и статистического сравнения с эталоном.

&КоличествоВызововЗаИтерацию(1)
&КоличествоПрогревочныхИтераций(1)
&АдаптивныеИтерации(
	МаксимальнаяОтносительнаяПогрешность = 0.1,
	МинимальноеКоличествоИтераций = 15,
	МаксимальноеКоличествоИтераций = 30
)
&СтатистическоеСравнение(
	ОтносительныйПорогПрактическойЗначимости = 0.1,
	УровеньЗначимости = 0.00001
)
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&Бенчмарк
&Эталон
Процедура ЭталонныйМетод() Экспорт

	Приостановить(3);

КонецПроцедуры

&Бенчмарк
Процедура БыстрыйМетод() Экспорт

	Приостановить(1);

КонецПроцедуры

&Бенчмарк
Процедура МедленныйМетод() Экспорт

	Приостановить(6);

КонецПроцедуры
