#Использовать fs
#Использовать tempfiles
#Использовать logos
#Использовать fluent

Перем _Конфигурация;          // КонфигурацияБенчмарков
Перем _ДескрипторыБенчмарков; // КоллекцияДескрипторовБенчмарков
Перем _МенеджерПроцессов;     // МенеджерПроцессовБенчмарков, Неопределено
Перем _ПортОтладки;           // Число
Перем _ДиспетчерСобытий;      // ДиспетчерСобытийВыполненияБенчмарков

#Область ОбработчикиСобытий

// Создает выполнение бенчмарков.
//
// Параметры:
//   ИсточникБенчмарков - Тип                             - Тип класса, содержащего бенчмарки
//                      - ДескрипторБенчмарка             - Отдельный дескриптор
//                      - КоллекцияДескрипторовБенчмарков - Коллекция дескрипторов
//   Конфигурация       - КонфигурацияБенчмарков            - Конфигурация бенчмарков
Процедура ПриСозданииОбъекта(ИсточникБенчмарков, Конфигурация = Неопределено)

	АдаптерИсточникаБенчмарков = Новый АдаптерИсточникаБенчмарков(ИсточникБенчмарков);

	_ДескрипторыБенчмарков = АдаптерИсточникаБенчмарков.ПолучитьКоллекциюДескрипторов();
	_ПортОтладки           = 0;
	_ДиспетчерСобытий      = Новый ДиспетчерСобытийВыполненияБенчмарков();

	Если Не Конфигурация = Неопределено Тогда
		_Конфигурация = Конфигурация;
	Иначе
		_Конфигурация = АдаптерИсточникаБенчмарков.СоздатьКонфигурацию();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Запускает бенчмарки, формирует артефакты и публикует итог выполнения.
//
// Возвращаемое значение:
//   РезультатЗапускаБенчмарков
Функция Запустить() Экспорт

	РезультатЗапуска = ЗапуститьБенчмарки();
	_ДиспетчерСобытий.Опубликовать(ФабрикаСобытийВыполненияБенчмарков.СоздатьЗавершениеЗапуска(РезультатЗапуска));

	ЭкспортерРезультатов = Новый ЭкспортерРезультатовБенчмарков();
	Файлы = ЭкспортерРезультатов.Записать(РезультатЗапуска);

	Если Файлы.Количество() > 0 Тогда
		_ДиспетчерСобытий.Опубликовать(ФабрикаСобытийВыполненияБенчмарков.СоздатьАртефакты(Файлы));
	КонецЕсли;

	Возврат РезультатЗапуска;

КонецФункции

// Запускает бенчмарки для последующего объединения результатов.
//
// Возвращаемое значение:
//   РезультатЗапускаБенчмарков
Функция ЗапуститьДляОбъединения() Экспорт

	РезультатЗапуска = ЗапуститьБенчмарки(Ложь);

	Возврат РезультатЗапуска;

КонецФункции

// Устанавливает порт для отладки
//
// Параметры:
//   Порт - Число - Номер порта для отладки
Процедура УстановитьПортОтладки(Порт) Экспорт
	_ПортОтладки = Порт;
КонецПроцедуры

// Устанавливает диспетчер событий запуска.
//
// Параметры:
//   ДиспетчерСобытий - ДиспетчерСобытийВыполненияБенчмарков
Процедура УстановитьДиспетчерСобытий(ДиспетчерСобытий) Экспорт
	_ДиспетчерСобытий = ДиспетчерСобытий;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапуститьБенчмарки(ПубликоватьНачалоЗапуска = Истина)

	Валидатор = Новый ВалидаторЗапускаБенчмарков(_ДескрипторыБенчмарков, _Конфигурация);
	Если Не Валидатор.ЗапускВозможен() Тогда
		ВызватьИсключение Валидатор.ПолучитьТекстОшибок();
	КонецЕсли;

	Если ПубликоватьНачалоЗапуска Тогда
		_ДиспетчерСобытий.Опубликовать(
			ФабрикаСобытийВыполненияБенчмарков.СоздатьНачалоЗапуска(_Конфигурация, _ДескрипторыБенчмарков)
		);
	КонецЕсли;

	РезультатЗапуска = Новый РезультатЗапускаБенчмарков();
	РезультатЗапуска.ДескрипторыБенчмарков = _ДескрипторыБенчмарков;
	РезультатЗапуска.Конфигурация = _Конфигурация;

	_МенеджерПроцессов = Новый МенеджерПроцессовБенчмарков(_ДескрипторыБенчмарков, _Конфигурация);
	_МенеджерПроцессов.УстановитьДиспетчерСобытий(_ДиспетчерСобытий);
	_МенеджерПроцессов.УстановитьПортОтладки(_ПортОтладки);

	ГенераторКейсов = Новый ГенераторКейсовБенчмарков(_ДескрипторыБенчмарков, _Конфигурация);
	Кейсы = ГенераторКейсов.СгенерироватьВсеКейсы();

	ЗапуститьКейсыБенчмарков(Кейсы, РезультатЗапуска);

	Если _Конфигурация.ИсполняющиеСреды().Количество() > 1 Тогда
		РезультатЗапуска.СредаОкружения.ВерсияИсполняющейСреды = "";
	КонецЕсли;

	ВосстановитьКейсыЗапусков(РезультатЗапуска, Кейсы);

	РезультатЗапуска.УстановитьСвязиСЭталонами();
	РезультатЗапуска.ПересчитатьСтатистику();
	РезультатЗапуска.ОценитьДостоверность();
	РезультатЗапуска.СформироватьОтчет();

	Для Каждого Запуск Из РезультатЗапуска.Запуски Цикл
		_ДиспетчерСобытий.Опубликовать(ФабрикаСобытийВыполненияБенчмарков.СоздатьЗавершениеКейса(Запуск));
	КонецЦикла;

	Возврат РезультатЗапуска;

КонецФункции

Процедура ЗапуститьКейсыБенчмарков(Кейсы, РезультатЗапуска)

	ВерсииСред = Новый Соответствие();

	Для Каждого Кейс Из Кейсы Цикл

		ИсполняющаяСреда = Кейс.ИсполняющаяСреда();

		Если ВерсииСред[ИсполняющаяСреда] = Неопределено Тогда
			ВерсииСред[ИсполняющаяСреда] = Новый Массив();
		КонецЕсли;

		ВерсииСред[ИсполняющаяСреда].Добавить(Кейс);

	КонецЦикла;

	Для Каждого Строка Из ВерсииСред Цикл

		ИсполняющаяСреда = Строка.Ключ;
		КейсыСреды = Строка.Значение;

		Если ИсполняющаяСреда <> Неопределено И ЗначениеЗаполнено(ИсполняющаяСреда.Версия) Тогда
			Версия = ИсполняющаяСреда.Версия;
		Иначе
			Версия = Новый СистемнаяИнформация().Версия;
		КонецЕсли;

		_ДиспетчерСобытий.Опубликовать(
			ФабрикаСобытийВыполненияБенчмарков.СоздатьНачалоИсполняющейСреды(Версия, _Конфигурация)
		);

		Если ИзолироватьИтерации() Тогда

			ЗапуститьКейсыВИзолированныхИтерациях(КейсыСреды, РезультатЗапуска);

		Иначе

			ЗапуститьКейсыИсполняющейСреде(КейсыСреды, ИсполняющаяСреда, РезультатЗапуска);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ЗапуститьКейсыИсполняющейСреде(КейсыСреды, ИсполняющаяСреда, РезультатЗапуска)

	ТекущийРезультат = _МенеджерПроцессов.ЗапуститьПроцесс(КейсыСреды, ИсполняющаяСреда);

	Если ТекущийРезультат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	РезультатЗапуска.СредаОкружения = ТекущийРезультат.СредаОкружения;

	ДобавитьВсеЗапускиВРезультат(РезультатЗапуска, ТекущийРезультат);

КонецПроцедуры

Процедура ЗапуститьКейсыВИзолированныхИтерациях(Кейсы, РезультатЗапуска)

	Чекпоинт = Неопределено;

	Для Каждого Кейс Из Кейсы Цикл

		Пока Истина Цикл

			ТекущийРезультат = _МенеджерПроцессов.ЗапуститьПроцесс(Кейс, Кейс.ИсполняющаяСреда(), Чекпоинт);

			Если ТекущийРезультат = Неопределено Тогда
				Прервать;
			КонецЕсли;

			Чекпоинт = ТекущийРезультат.Чекпоинт;
			РезультатЗапуска.СредаОкружения = ТекущийРезультат.СредаОкружения;

			Если ОбработатьИзолированныйЗапускИтерации(РезультатЗапуска, ТекущийРезультат, Чекпоинт) Тогда
				Чекпоинт = ЧекпоинтПослеАдаптивногоЗавершения(Кейс);
			КонецЕсли;

			// Закончились кейсы для запуска
			Если Чекпоинт = Неопределено Тогда
				Прервать;
			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

Функция ОбработатьИзолированныйЗапускИтерации(РезультатЗапуска, ТекущийРезультат, Чекпоинт)

	Если ТекущийРезультат.Запуски.Количество() <> 1 Тогда
		ВызватьИсключение "Ожидался результат запуска одного кейса";
	КонецЕсли;

	ПредыдущийЗапуск  = ПолучитьПоследнийЗапуск(РезультатЗапуска);
	ТекущийЗапуск     = ТекущийРезультат.Запуски[0];
	СледующийЧекпоинт = ТекущийРезультат.Чекпоинт;

	Если ТекущийЗапуск.Замеры.Количество() <> 1 Тогда
		ВызватьИсключение "Ожидался результат одной итерации кейс";
	КонецЕсли;

	Если МожноОбъединитьСПредыдущимЗапуском(ПредыдущийЗапуск, ТекущийЗапуск) Тогда
		ПредыдущийЗапуск.Замеры.Добавить(ТекущийЗапуск.Замеры[0]);
		ОбъединенныйЗапуск = ПредыдущийЗапуск;
	Иначе
		РезультатЗапуска.Запуски.Добавить(ТекущийЗапуск);
		ОбъединенныйЗапуск = ТекущийЗапуск;
	КонецЕсли;

	ДостигнутаЦелеваяПогрешность = ДостигнутаЦелеваяОтносительнаяПогрешность(
		ОбъединенныйЗапуск,
		ТекущийЗапуск.Замеры[0].Этап
	);

	Если ТребуетсяВыводСтатистики(Чекпоинт, СледующийЧекпоинт)
		Или (ДостигнутаЦелеваяПогрешность И Не _Конфигурация.ТребуетсяМониторингПамяти()) Тогда
		Событие = ФабрикаСобытийВыполненияБенчмарков.СоздатьРасчетСтатистикиКейса(ОбъединенныйЗапуск);

		_ДиспетчерСобытий.Опубликовать(Событие);
	КонецЕсли;

	Возврат ДостигнутаЦелеваяПогрешность;

КонецФункции

Функция ДостигнутаЦелеваяОтносительнаяПогрешность(РезультатЗапускаКейса, ЭтапТекущегоЗамера)

	Если Не _Конфигурация.ИспользуютсяАдаптивныеИтерации()
		Или ЭтапТекущегоЗамера <> ЭтапыБенчмарка.Измерение() Тогда
		Возврат Ложь;
	КонецЕсли;

	РезультатЗапускаКейса.ПересчитатьСтатистику();

	Возврат РезультатЗапускаКейса.Статистика.КоличествоИтераций >= _Конфигурация.МинимальноеКоличествоАдаптивныхИтераций()
		И РезультатЗапускаКейса.Статистика.ОтносительнаяПогрешность <> Неопределено
		И РезультатЗапускаКейса.Статистика.ОтносительнаяПогрешность <= _Конфигурация.ЦелеваяОтносительнаяПогрешность();

КонецФункции

Функция ЧекпоинтПослеАдаптивногоЗавершения(Кейс)

	Если Не _Конфигурация.ТребуетсяМониторингПамяти() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Чекпоинт = Новый ЧекпоинтЗапускаБенчмарков();
	Чекпоинт.ИмяМетода = Кейс.ДескрипторБенчмарка().Метод();
	Чекпоинт.ИдентификаторКейса = Кейс.Идентификатор();
	Чекпоинт.Этап = ЭтапыБенчмарка.Память();
	Чекпоинт.НомерИтерации = 1;

	Возврат Чекпоинт;

КонецФункции

Функция ПолучитьПоследнийЗапуск(РезультатЗапуска)

	КоличествоЗапусков = РезультатЗапуска.Запуски.Количество();

	Если КоличествоЗапусков > 0 Тогда
		Возврат РезультатЗапуска.Запуски[КоличествоЗапусков - 1];
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция МожноОбъединитьСПредыдущимЗапуском(ПредыдущийЗапуск, ТекущийЗапуск)

	Если ПредыдущийЗапуск = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ПредыдущийЗапуск.Кейс.Идентификатор() = ТекущийЗапуск.Кейс.Идентификатор();

КонецФункции

Процедура ДобавитьВсеЗапускиВРезультат(РезультатЗапуска, ТекущийРезультат)

	Для Каждого Запуск Из ТекущийРезультат.Запуски Цикл
		РезультатЗапуска.Запуски.Добавить(Запуск);
	КонецЦикла;

КонецПроцедуры

Процедура ВосстановитьКейсыЗапусков(РезультатЗапускаБенчмарка, Кейсы)

	КартаКейсов = Новый Соответствие();

	Для Каждого Кейс Из Кейсы Цикл
		КартаКейсов.Вставить(Кейс.Идентификатор(), Кейс);
	КонецЦикла;

	Для Каждого РезультатЗапускаКейса Из РезультатЗапускаБенчмарка.Запуски Цикл
		РезультатЗапускаКейса.Кейс = КартаКейсов[РезультатЗапускаКейса.Кейс.Идентификатор()];
	КонецЦикла;

КонецПроцедуры

Функция ТребуетсяВыводСтатистики(ЧекпоинтПредыдущий, ЧекпоинтСледующий)

	Если ЧекпоинтПредыдущий = Неопределено И ЧекпоинтСледующий = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	Если ЧекпоинтПредыдущий = Неопределено И ЧекпоинтСледующий <> Неопределено Тогда
		Возврат ЭтоПервыйЗапуск(ЧекпоинтСледующий);
	КонецЕсли;

	Возврат ЧекпоинтПредыдущий.ИдентификаторКейса <> ЧекпоинтСледующий.ИдентификаторКейса;

КонецФункции

Функция ЭтоПервыйЗапуск(Чекпоинт)
	Возврат Чекпоинт = Неопределено
		Или Чекпоинт.Этап = ЭтапыБенчмарка.Измерение() И Чекпоинт.НомерИтерации = 1;
КонецФункции

Функция ИзолироватьИтерации()
	Возврат _Конфигурация.Стратегия() = СтратегииЗапускаБенчмарка.ХолодныйЗапуск();
КонецФункции

#КонецОбласти
