Перем _Тип;   // Строка
Перем _Данные; // Произвольный
Перем _Время; // Дата

#Область ОбработчикиСобытий

// Создает значение события выполнения бенчмарков.
//
// Параметры:
//   Тип - Строка - Тип события.
//   Данные - Произвольный - Данные события.
//   Время - Дата, Неопределено - Время события в UTC; по умолчанию текущая дата UTC.
Процедура ПриСозданииОбъекта(Тип, Данные, Время = Неопределено)

	_Тип = Тип;
	_Данные = Данные;
	_Время = Время;

	Если _Время = Неопределено Тогда
		_Время = ТекущаяУниверсальнаяДата();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает тип события.
//
// Возвращаемое значение:
//  Строка
Функция ТипСобытия() Экспорт
	Возврат _Тип;
КонецФункции

// Возвращает данные события.
//
// Возвращаемое значение:
//  Произвольный
Функция Данные() Экспорт
	Возврат _Данные;
КонецФункции

// Возвращает время события в UTC.
//
// Возвращаемое значение:
//  Дата
Функция Время() Экспорт
	Возврат _Время;
КонецФункции

// Возвращает версию схемы события.
//
// Возвращаемое значение:
//  Число
Функция ВерсияСхемы() Экспорт
	Возврат 1;
КонецФункции

#КонецОбласти
