// Включает статистическое сравнение результатов с эталоном.
//
// Применяется только к методу ПриСозданииОбъекта.
//
// Параметры:
//   ОтносительныйПорогПрактическойЗначимости - Число - Минимальное относительное различие.
//   УровеньЗначимости - Число - Уровень значимости критерия Манна — Уитни.
//
// Примеры:
//   &СтатистическоеСравнение(
//      ОтносительныйПорогПрактическойЗначимости = 0.15,
//      УровеньЗначимости = 0.01
//   )
//   Процедура ПриСозданииОбъекта()
//      // ...
//   КонецПроцедуры
&Аннотация("СтатистическоеСравнение")
Процедура ПриСозданииОбъекта(ОтносительныйПорогПрактическойЗначимости = 0.15, УровеньЗначимости = 0.01)
КонецПроцедуры
