// Включает адаптивный подбор количества измерительных итераций.
//
// Применяется только к методу ПриСозданииОбъекта.
//
// Параметры:
//   МаксимальнаяОтносительнаяПогрешность - Число - Допустимая относительная погрешность.
//   МинимальноеКоличествоИтераций - Число - Минимальное количество измерительных итераций.
//   МаксимальноеКоличествоИтераций - Число - Максимальное количество измерительных итераций.
//
// Примеры:
//   &АдаптивныеИтерации(
//      МаксимальнаяОтносительнаяПогрешность = 0.1,
//      МинимальноеКоличествоИтераций = 15,
//      МаксимальноеКоличествоИтераций = 100
//   )
//   Процедура ПриСозданииОбъекта()
//      // ...
//   КонецПроцедуры
&Аннотация("АдаптивныеИтерации")
Процедура ПриСозданииОбъекта(МаксимальнаяОтносительнаяПогрешность = 0.1, МинимальноеКоличествоИтераций = 15, МаксимальноеКоличествоИтераций = 100)
КонецПроцедуры
