// Задает параметры для бенчмарка, позволяя запускать тесты с разными наборами входных данных.
// Бенчмарк будет выполнен для каждой уникальной комбинации значений параметров.
//
// Применяется к экспортным полям и методам бенчмарков.
//
// Параметры:
//   Значение - Произвольный - Значение параметра бенчмарка. Аннотация принимает
//                             произвольное количество значений, которые передаются
//                             в параметры метода или задают значение экспортного поля.
//
// Примеры:
//   &Параметры(Истина, Ложь)
//   Перем Флаг Экспорт;
//
//   &Параметры(100, 10)
//   &Параметры(200, 20)
//   Процедура Бенчмарк(П1, П2)
//      // ...
//   КонецПроцедуры
&Аннотация("Параметры")
Процедура ПриСозданииОбъекта(&Повторяемый Значение)
КонецПроцедуры
