// Аннотация указывает, что метод должен быть выполнен перед каждым запуском кейса бенчмарка.
//
// Позволяет подготовить контекст для отдельного кейса - например, сбросить состояние объекта,
// сгенерировать тестовые данные или выполнить предварительные проверки.
//
//
// Примеры:
//   // Параметры:
//   //   Контекст - Структура:
//   //     * Кейс - КейсБенчмарка
//   &ПередКаждымКейсом
//   Процедура ПередКаждымКейсом(Контекст) Экспорт
//      // ...
//   КонецПроцедуры
&Аннотация("ПередКаждымКейсом")
Процедура ПриСозданииОбъекта()
КонецПроцедуры
