// Указывает, что метод должен быть выполнен после завершения всех бенчмарков.
//
// Используется для финализации: освобождения ресурсов (закрытие соединений), 
// записи итоговых отчетов или выполнения других действий.
//
// Примеры:
//   // Параметры:
//   //   Контекст - Структура:
//   //     * Конфигурация          - КонфигурацияБенчмарков
//   //     * ДескрипторыБенчмарков - КоллекцияДескрипторовБенчмарков
//   //     * Запуски               - Массив из РезультатЗапускаКейса
//   //     * Отчет                 - ОтчетБенчмарков
//   //     * СредаОкружения        - СредаОкруженияБенчмарков
//   &ПослеВсех
//   Процедура ПослеВсех(Контекст) Экспорт
//      // Очистка данных
//   КонецПроцедуры
&Аннотация("ПослеВсех")
Процедура ПриСозданииОбъекта()
КонецПроцедуры
