Перем События Экспорт;

&Бенчмарк
Процедура Бенчмарк() Экспорт
КонецПроцедуры

&Инициализация
Процедура Инициализация(Контекст) Экспорт
	Конфигурация = Контекст.Конфигурация;
	События.Добавить("Инициализация");
КонецПроцедуры

&Завершение
Процедура Завершение() Экспорт
	События.Добавить("Завершение");
КонецПроцедуры

&Перед
Процедура ПередЗапуском(Контекст) Экспорт
	ДескрипторБенчмарка = Контекст.ДескрипторБенчмарка;
	ПараметрыМетода = Контекст.ПараметрыМетода;
	События.Добавить("ПередЗапуском");
КонецПроцедуры

&После
Процедура ПослеЗапуска(Контекст) Экспорт
	ДескрипторБенчмарка = Контекст.ДескрипторБенчмарка;
	Параметры = Контекст.Параметры;
	Замеры = Контекст.Замеры;
	Статистика = Контекст.Статистика;
	События.Добавить("ПослеЗапуска");
КонецПроцедуры

Процедура ПередЗапускомБезПараметров() Экспорт
	События.Добавить("ПередЗапускомБезПараметров");
КонецПроцедуры

Процедура ПриСозданииОбъекта()
	События = Новый Массив();
КонецПроцедуры