// BSLLS-off

&Параметры(100, 200)
&ИсточникПараметров("ПолучитьЗначения")
Перем ОбщееЗначение Экспорт;

&СтратегияХолодныйЗапуск
&СортировкаОтБыстрыхКМедленным
&МониторингПамяти
&КоличествоИтераций(100)
&КоличествоВызововЗаИтерацию(200)
&КоличествоПрогревочныхИтераций(300)
&МинимальноеВремяИтерации(400)
&МинимальноеКоличествоВызововЗаИтерацию(500)
&КаталогАртефактов("path/to/artifacts")
&ЭкспортMarkdown
&ЭкспортJson
&ЭкспортHtml
&ИсполняющаяСреда("stable")
&ИсполняющаяСреда("1.9.3, 1.9.4")
&ИсполняющаяСреда(Версия = "2.0.0", Наименование = "Новая", ЭтоЭталон = Истина)
&КолонкаМин
&КолонкаМакс
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ПередВсеми
Процедура ПередВсеми(Контекст) Экспорт
КонецПроцедуры

&ПослеВсех
Процедура ПослеВсех(Контекст) Экспорт
КонецПроцедуры

&ПередКаждым
Процедура ПередКаждым(Контекст) Экспорт
КонецПроцедуры

&ПослеКаждого
Процедура ПослеКаждого(Контекст) Экспорт
КонецПроцедуры

&Бенчмарк
&Параметры(1)
&Параметры(2)
&ИсточникПараметров("ПолучитьПараметры")
Процедура Бенчмарк(Парам) Экспорт
КонецПроцедуры