&СтратегияХолодныйЗапуск
&СортировкаОтБыстрыхКМедленным
&МониторингПамяти
&КоличествоИтераций(100)
&КоличествоВызововЗаИтерацию(200)
&КоличествоПрогревочныхИтераций(300)
&МинимальноеВремяИтерации(400)
&МинимальноеКоличествоВызововЗаИтерацию(500)
Процедура ПриСозданииОбъекта()
	
КонецПроцедуры

&Инициализация
Процедура Инициализация(Контекст) Экспорт
	
КонецПроцедуры

&Завершение
Процедура Завершение() Экспорт
	
КонецПроцедуры

&Перед
Процедура ПередЗапуском(Контекст) Экспорт
	
КонецПроцедуры

&После
Процедура ПослеЗапуска(Контекст) Экспорт
	
КонецПроцедуры

&Бенчмарк
Процедура Бенчмарк() Экспорт
КонецПроцедуры