&СтратегияХолодныйЗапуск
&СортировкаОтБыстрыхКМедленным
&МониторингПамяти
&КоличествоИтераций(100)
&КоличествоВызововЗаИтерацию(200)
&КоличествоПрогревочныхИтераций(300)
&МинимальноеВремяИтерации(400)
&МинимальноеКоличествоВызововЗаИтерацию(500)
Процедура ПриСозданииОбъекта()
	
КонецПроцедуры

&Инициализация
Процедура Инициализация(Конфигурация) Экспорт
	
КонецПроцедуры

&Завершение
Процедура Завершение() Экспорт
	
КонецПроцедуры

&Перед
Процедура ПередЗапуском(ДескрипторБенчмарка, ПараметрыМетода) Экспорт
	
КонецПроцедуры

&После
Процедура ПослеЗапуска(ДескрипторБенчмарка) Экспорт
	
КонецПроцедуры

&Бенчмарк
Процедура Бенчмарк() Экспорт
КонецПроцедуры