&СтратегияХолодныйЗапуск
&СортировкаОтБыстрыхКМедленным
&МониторингПамяти
&КоличествоИтераций(100)
&КоличествоВызововЗаИтерацию(200)
&КоличествоПрогревочныхИтераций(300)
&МинимальноеВремяИтерации(400)
&МинимальноеКоличествоВызововЗаИтерацию(500)
&КаталогАртефактов("path/to/artifacts")
&ЭкспортMarkdown
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ПередВсеми
Процедура ПередВсеми(Контекст) Экспорт
КонецПроцедуры

&ПослеВсех
Процедура ПослеВсех(Контекст) Экспорт
КонецПроцедуры

&ПередКаждым
Процедура ПередКаждым(Контекст) Экспорт
КонецПроцедуры

&ПослеКаждого
Процедура ПослеКаждого(Контекст) Экспорт
КонецПроцедуры

&Бенчмарк
Процедура Бенчмарк() Экспорт
КонецПроцедуры