&ИсточникПараметров("ПолучитьЧисловыеЗначения")
Перем Поле Экспорт;

Перем ПолеБезИсточника Экспорт;

&Бенчмарк
Процедура БенчмаркБезПараметров() Экспорт
КонецПроцедуры

&Бенчмарк
&ИсточникПараметров("ПолучитьЗначенияПараметровИзБулево")
Процедура БенчмаркОдинПараметр(Парам) Экспорт
КонецПроцедуры

&Бенчмарк
&ИсточникПараметров("ПолучитьЗначенияПараметровДляБенчмаркаИзКоллекцииМассивов")
Процедура БенчмаркДваПараметра(Парам1, Парам2) Экспорт
КонецПроцедуры

Функция ПолучитьЧисловыеЗначения() Экспорт

	Значения = Новый Массив();
	Значения.Добавить(100);
	Значения.Добавить(200);

	Возврат Значения;

КонецФункции

Функция ПолучитьЗначенияПараметровИзБулево() Экспорт

	Значения = Новый Массив();
	Значения.Добавить(Истина);
	Значения.Добавить(Ложь);

	Возврат Значения;

КонецФункции

Функция ПолучитьЗначенияПараметровДляБенчмаркаИзКоллекцииМассивов() Экспорт

	НаборПараметров = Новый Массив();
	
	Параметры = Новый Массив();
	Параметры.Добавить(13);
	Параметры.Добавить(14);
	НаборПараметров.Добавить(Параметры);
	
	Параметры = Новый Массив();
	Параметры.Добавить(15);
	Параметры.Добавить(16);
	НаборПараметров.Добавить(Параметры);

	Возврат НаборПараметров;

КонецФункции

Функция ПолучитьЗначенияПараметровДляБенчмаркаИзКоллекцииСтруктур() Экспорт

	НаборПараметров = Новый Массив();
	НаборПараметров.Добавить(Новый Структура("Парам1, Парам2", 1, 2));
	НаборПараметров.Добавить(Новый Структура("Парам1, Парам2", 3, 4));

	Возврат НаборПараметров;

КонецФункции

Функция ПолучитьЗначенияПараметровДляБенчмаркаИзКоллекцииСоответствий() Экспорт

	НаборПараметров = Новый Массив();

	Коллекция = Новый Соответствие();
	Коллекция.Вставить("Парам1", 5);
	Коллекция.Вставить("Парам2", 6);
	НаборПараметров.Добавить(Коллекция);

	Коллекция = Новый Соответствие();
	Коллекция.Вставить("Парам1", 7);
	Коллекция.Вставить("Парам2", 8);
	НаборПараметров.Добавить(Коллекция);

	Возврат НаборПараметров;

КонецФункции

Функция ПолучитьЗначенияПараметровДляБенчмаркаИзТаблицыЗначения() Экспорт

	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("Парам1");
	Таблица.Колонки.Добавить("Парам2");

	Строка = Таблица.Добавить();
	Строка.Парам1 = 9;
	Строка.Парам2 = 10;

	Строка = Таблица.Добавить();
	Строка.Парам1 = 11;
	Строка.Парам2 = 12;

	Возврат Таблица;

КонецФункции

Функция ПолучитьЗначенияПараметровДляБенчмаркаИзСтруктуры() Экспорт

	Возврат Новый Структура("Парам1, Парам2", 13, 14);

КонецФункции

Функция ПолучитьНевалидныеЗначенияПараметровДляМетодаБенчмаркаСДвумяПараметрами() Экспорт
		
	Значения = Новый Массив();
	Значения.Добавить("Тест");

	Возврат Значения;

КонецФункции

Функция ПолучитьЗначенияПараметровДляБенчмаркаИзКоллекцииМассивовСНевернымКоличеством() Экспорт

	НаборПараметров = Новый Массив();
	
	Параметры = Новый Массив();
	Параметры.Добавить(1);
	НаборПараметров.Добавить(Параметры);

	Возврат НаборПараметров;

КонецФункции

Функция ПолучитьЗначенияПараметровДляБенчмаркаИзКоллекцииСтруктурБезОдногоПараметра() Экспорт

	НаборПараметров = Новый Массив();
	НаборПараметров.Добавить(Новый Структура("Парам1", 1));

	Возврат НаборПараметров;

КонецФункции

Функция ПолучитьЗначенияПараметровДляБенчмаркаИзТаблицыЗначенияБезОдногоПараметра() Экспорт

	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("Парам1");

	Строка = Таблица.Добавить();
	Строка.Парам1 = 9;

	Возврат Таблица;

КонецФункции