Перем События Экспорт;

&Бенчмарк
Процедура Бенчмарк() Экспорт
КонецПроцедуры

&ПередВсеми
Процедура ПередВсеми(Контекст) Экспорт

	Конфигурация = Контекст.Конфигурация;
	ДескрипторыБенчмарков = Контекст.ДескрипторыБенчмарков;

	События.Добавить("ПередВсеми");
	
КонецПроцедуры

&ПослеВсех
Процедура ПослеВсех(Контекст) Экспорт	

	ДескрипторыБенчмарков = Контекст.ДескрипторыБенчмарков;
	Конфигурация = Контекст.Конфигурация;
	Расшифровка = Контекст.Расшифровка;
	Отчет = Контекст.Отчет;
	СредаОкружения = Контекст.СредаОкружения;

	События.Добавить("ПослеВсех");

КонецПроцедуры

&ПередКаждым
Процедура ПередКаждым(Контекст) Экспорт

	ДескрипторБенчмарка = Контекст.ДескрипторБенчмарка;
	ПараметрыМетода = Контекст.ПараметрыМетода;

	События.Добавить("ПередКаждым");

КонецПроцедуры

&ПослеКаждого
Процедура ПослеЗапуска(Контекст) Экспорт

	ДескрипторБенчмарка = Контекст.ДескрипторБенчмарка;
	Параметры = Контекст.Параметры;
	Замеры = Контекст.Замеры;
	Статистика = Контекст.Статистика;

	События.Добавить("ПослеКаждого");

КонецПроцедуры

Процедура ПередЗапускомБезПараметров(Контекст) Экспорт

	ДескрипторБенчмарка = Контекст.ДескрипторБенчмарка;
	ПараметрыМетода = Контекст.ПараметрыМетода;

	События.Добавить("ПередЗапускомБезПараметров");

КонецПроцедуры

Процедура ПриСозданииОбъекта()
	События = Новый Массив();
КонецПроцедуры