// BSLLS:ExportVariables-off
// BSLLS:MissingVariablesDescription-off

Перем ПередВсеми Экспорт; // Устарела.
Перем ПослеВсех Экспорт; // Устарела.
Перем ПередКаждымКейсом Экспорт; // Устарела.
Перем ПослеКаждогоКейса Экспорт; // Устарела.
Перем ПередИтерацией Экспорт; // Устарела.
Перем ПослеИтерации Экспорт; // Устарела.
Перем ПередКаждым Экспорт; // Устарела.
Перем ПослеКаждого Экспорт; // Устарела.

#Область ПрограммныйИнтерфейс

// Возвращает событие перед запуском всех бенчмарков.
//
// Возвращаемое значение:
//   Строка - Идентификатор события бенчмарка.
Функция ПередВсеми() Экспорт
	Возврат ПередВсеми;
КонецФункции

// Возвращает событие после запуска всех бенчмарков.
//
// Возвращаемое значение:
//   Строка - Идентификатор события бенчмарка.
Функция ПослеВсех() Экспорт
	Возврат ПослеВсех;
КонецФункции

// Возвращает событие перед запуском каждого кейса.
//
// Возвращаемое значение:
//   Строка - Идентификатор события бенчмарка.
Функция ПередКаждымКейсом() Экспорт
	Возврат ПередКаждымКейсом;
КонецФункции

// Возвращает событие после запуска каждого кейса.
//
// Возвращаемое значение:
//   Строка - Идентификатор события бенчмарка.
Функция ПослеКаждогоКейса() Экспорт
	Возврат ПослеКаждогоКейса;
КонецФункции

// Возвращает событие перед запуском итерации.
//
// Возвращаемое значение:
//   Строка - Идентификатор события бенчмарка.
Функция ПередИтерацией() Экспорт
	Возврат ПередИтерацией;
КонецФункции

// Возвращает событие после запуска итерации.
//
// Возвращаемое значение:
//   Строка - Идентификатор события бенчмарка.
Функция ПослеИтерации() Экспорт
	Возврат ПослеИтерации;
КонецФункции

// Возвращает устаревшее событие перед каждым кейсом.
//
// Возвращаемое значение:
//   Строка - Идентификатор события бенчмарка.
Функция ПередКаждым() Экспорт
	Возврат ПередКаждым;
КонецФункции

// Возвращает устаревшее событие после каждого кейса.
//
// Возвращаемое значение:
//   Строка - Идентификатор события бенчмарка.
Функция ПослеКаждого() Экспорт
	Возврат ПослеКаждого;
КонецФункции

#КонецОбласти

ПередВсеми         = "ПередВсеми";
ПослеВсех          = "ПослеВсех";
ПередКаждымКейсом  = "ПередКаждымКейсом";
ПослеКаждогоКейса  = "ПослеКаждогоКейса";
ПередИтерацией     = "ПередИтерацией";
ПослеИтерации      = "ПослеИтерации";
ПередКаждым        = "ПередКаждым";
ПослеКаждого       = "ПослеКаждого";
