// BSLLS:ExportVariables-off
// BSLLS:MissingVariablesDescription-off

// Особенности:
// - Автоматический расчет количества вызовов за итерацию
// - Запуск прогревочных итераций
Перем ПропускнаяСпособность Экспорт; // Устарела.

// Особенности:
// - Количество вызовов за итерацию = 1
// - Отсутствуют прогревочные итерации
Перем ХолодныйЗапуск Экспорт; // Устарела.

#Область ПрограммныйИнтерфейс

// Возвращает стратегию запуска с автоматическим подбором количества вызовов.
//
// Возвращаемое значение:
//   Строка - Идентификатор стратегии запуска.
Функция ПропускнаяСпособность() Экспорт
	Возврат ПропускнаяСпособность;
КонецФункции

// Возвращает стратегию запуска без прогрева и автоматического подбора вызовов.
//
// Возвращаемое значение:
//   Строка - Идентификатор стратегии запуска.
Функция ХолодныйЗапуск() Экспорт
	Возврат ХолодныйЗапуск;
КонецФункции

#КонецОбласти

ПропускнаяСпособность = "ПропускнаяСпособность";
ХолодныйЗапуск = "ХолодныйЗапуск";
