// BSLLS:MissingReturnedValueDescription-off

#Область ПрограммныйИнтерфейс

// Возвращает тип события начала выполнения бенчмарков.
Функция ЗапускБенчмарковНачат() Экспорт
	Возврат "ЗапускБенчмарковНачат";
КонецФункции

// Возвращает тип события начала исполняющей среды.
Функция ИсполняющаяСредаБенчмарковНачата() Экспорт
	Возврат "ИсполняющаяСредаБенчмарковНачата";
КонецФункции

// Возвращает тип события получения вывода дочернего процесса.
Функция ВыводПроцессаПолучен() Экспорт
	Возврат "ВыводПроцессаПолучен";
КонецФункции

// Возвращает тип события начала кейса бенчмарка.
Функция КейсБенчмаркаНачат() Экспорт
	Возврат "КейсБенчмаркаНачат";
КонецФункции

// Возвращает тип события завершения итерации бенчмарка.
Функция ИтерацияБенчмаркаЗавершена() Экспорт
	Возврат "ИтерацияБенчмаркаЗавершена";
КонецФункции

// Возвращает тип события расчета статистики кейса.
Функция СтатистикаКейсаРассчитана() Экспорт
	Возврат "СтатистикаКейсаРассчитана";
КонецФункции

// Возвращает тип события завершения кейса бенчмарка.
Функция КейсБенчмаркаЗавершен() Экспорт
	Возврат "КейсБенчмаркаЗавершен";
КонецФункции

// Возвращает тип события завершения запуска бенчмарков.
Функция ЗапускБенчмарковЗавершен() Экспорт
	Возврат "ЗапускБенчмарковЗавершен";
КонецФункции

// Возвращает тип события формирования артефактов.
Функция АртефактыСформированы() Экспорт
	Возврат "АртефактыСформированы";
КонецФункции

#КонецОбласти
