// BSLLS:ExportVariables-off
// BSLLS:MissingVariablesDescription-off

Перем Оценка Экспорт; // Устарела.
Перем Прогрев Экспорт; // Устарела.
Перем Измерение Экспорт; // Устарела.
Перем Память Экспорт; // Устарела.

#Область ПрограммныйИнтерфейс

// Возвращает этап оценочного запуска.
//
// Возвращаемое значение:
//   Строка - Идентификатор этапа.
Функция Оценка() Экспорт
	Возврат Оценка;
КонецФункции

// Возвращает этап прогрева.
//
// Возвращаемое значение:
//   Строка - Идентификатор этапа.
Функция Прогрев() Экспорт
	Возврат Прогрев;
КонецФункции

// Возвращает этап измерения.
//
// Возвращаемое значение:
//   Строка - Идентификатор этапа.
Функция Измерение() Экспорт
	Возврат Измерение;
КонецФункции

// Возвращает этап измерения памяти.
//
// Возвращаемое значение:
//   Строка - Идентификатор этапа.
Функция Память() Экспорт
	Возврат Память;
КонецФункции

#КонецОбласти

Оценка = "Оценка";
Прогрев = "Прогрев";
Измерение = "Измерение";
Память = "Память";
