// BSLLS:ExportVariables-off
// BSLLS:MissingVariablesDescription-off

Перем Markdown Экспорт; // Устарела.
Перем Json Экспорт; // Устарела.
Перем Html Экспорт; // Устарела.

#Область ПрограммныйИнтерфейс

// Возвращает экспортёр результатов в формате Markdown.
//
// Возвращаемое значение:
//   ЭкспортерРезультатовБенчмарков
Функция Markdown() Экспорт
	Возврат Markdown;
КонецФункции

// Возвращает экспортёр результатов в формате JSON.
//
// Возвращаемое значение:
//   ЭкспортерРезультатовБенчмарков
Функция Json() Экспорт
	Возврат Json;
КонецФункции

// Возвращает экспортёр результатов в формате HTML.
//
// Возвращаемое значение:
//   ЭкспортерРезультатовБенчмарков
Функция Html() Экспорт
	Возврат Html;
КонецФункции

#КонецОбласти

Markdown = Новый ЭкспортерРезультатовБенчмарковВMarkdown();
Json = Новый ЭкспортерРезультатовБенчмарковВJson();
Html = Новый ЭкспортерРезультатовБенчмарковВHtml();
