Перем _Методы;     // Массив из Строка
Перем _Категории;  // Массив из Строка

#Область ОбработчикиСобытий

// Создает пустой фильтр бенчмарков.
Процедура ПриСозданииОбъекта()

	_Методы = Новый Массив();
	_Категории = Новый Массив();

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Устанавливает методы бенчмарков для отбора.
//
// Параметры:
//   Методы - Массив из Строка - Имена методов бенчмарков.
Процедура УстановитьМетоды(Методы) Экспорт
	_Методы = Новый Массив(Новый ФиксированныйМассив(Методы));
КонецПроцедуры

// Устанавливает категории бенчмарков для отбора.
//
// Параметры:
//   Категории - Массив из Строка - Категории бенчмарков.
Процедура УстановитьКатегории(Категории) Экспорт
	_Категории = Новый Массив(Новый ФиксированныйМассив(Категории));
КонецПроцедуры

// Отбирает бенчмарки из источника по условиям фильтра.
//
// Параметры:
//   ИсточникБенчмарков - Тип
//                      - ДескрипторБенчмарка
//                      - КоллекцияДескрипторовБенчмарков
//
// Возвращаемое значение:
//   Тип
//   ДескрипторБенчмарка
//   КоллекцияДескрипторовБенчмарков
Функция Отфильтровать(ИсточникБенчмарков) Экспорт

	Если Не Установлен() Тогда
		Возврат ИсточникБенчмарков;
	КонецЕсли;

	Коллекция = Новый АдаптерИсточникаБенчмарков(ИсточникБенчмарков)
		.ПолучитьКоллекциюДескрипторов()
		.Скопировать();

	Контекст = Новый Структура("Методы, Категории", _Методы, _Категории);
	Коллекция.Фильтровать(
		"Бенчмарк -> (Методы.Количество() = 0 Или Методы.Найти(Бенчмарк.Метод()) <> Неопределено) И (Категории.Количество() = 0 Или Категории.Найти(Бенчмарк.Категория()) <> Неопределено)",
		Контекст
	);

	Возврат Коллекция;

КонецФункции

// Возвращает признак наличия условий отбора.
//
// Возвращаемое значение:
//   Булево
Функция Установлен() Экспорт
	Возврат _Методы.Количество() > 0 Или _Категории.Количество() > 0;
КонецФункции

#КонецОбласти
