#Область ПрограммныйИнтерфейс

// Создает событие начала запуска бенчмарков.
//
// Параметры:
//   Конфигурация          - КонфигурацияБенчмарков
//   ДескрипторыБенчмарков - КоллекцияДескрипторовБенчмарков
//
// Возвращаемое значение:
//   СобытиеВыполненияБенчмарков
Функция СоздатьНачалоЗапуска(Конфигурация, ДескрипторыБенчмарков) Экспорт

	Данные = Новый Структура("Конфигурация, ДескрипторыБенчмарков", Конфигурация, ДескрипторыБенчмарков);
	Возврат Создать(ТипыСобытийВыполненияБенчмарков.ЗапускБенчмарковНачат(), Данные);

КонецФункции

// Создает событие начала исполняющей среды.
//
// Параметры:
//   ВерсияИсполняющейСреды - Строка
//   Конфигурация           - КонфигурацияБенчмарков
//
// Возвращаемое значение:
//   СобытиеВыполненияБенчмарков
Функция СоздатьНачалоИсполняющейСреды(ВерсияИсполняющейСреды, Конфигурация) Экспорт

	Данные = Новый Структура("ВерсияИсполняющейСреды, Конфигурация", ВерсияИсполняющейСреды, Конфигурация);
	Возврат Создать(ТипыСобытийВыполненияБенчмарков.ИсполняющаяСредаБенчмарковНачата(), Данные);

КонецФункции

// Создает событие получения вывода процесса.
//
// Параметры:
//   Текст - Строка
//
// Возвращаемое значение:
//   СобытиеВыполненияБенчмарков
Функция СоздатьВыводПроцесса(Текст) Экспорт

	Возврат Создать(ТипыСобытийВыполненияБенчмарков.ВыводПроцессаПолучен(), Текст);

КонецФункции

// Создает событие начала кейса бенчмарка.
//
// Параметры:
//   Кейс - КейсБенчмарка
//
// Возвращаемое значение:
//   СобытиеВыполненияБенчмарков
Функция СоздатьНачалоКейса(Кейс) Экспорт

	Возврат Создать(ТипыСобытийВыполненияБенчмарков.КейсБенчмаркаНачат(), Кейс);

КонецФункции

// Создает событие завершения итерации бенчмарка.
//
// Параметры:
//   РезультатИтерации - РезультатИтерацииБенчмарка
//
// Возвращаемое значение:
//   СобытиеВыполненияБенчмарков
Функция СоздатьЗавершениеИтерации(РезультатИтерации) Экспорт

	Возврат Создать(ТипыСобытийВыполненияБенчмарков.ИтерацияБенчмаркаЗавершена(), РезультатИтерации);

КонецФункции

// Создает событие расчета статистики кейса.
//
// Параметры:
//   РезультатЗапускаКейса - РезультатЗапускаКейсаБенчмарка
//
// Возвращаемое значение:
//   СобытиеВыполненияБенчмарков
Функция СоздатьРасчетСтатистикиКейса(РезультатЗапускаКейса) Экспорт

	Возврат Создать(ТипыСобытийВыполненияБенчмарков.СтатистикаКейсаРассчитана(), РезультатЗапускаКейса);

КонецФункции

// Создает событие завершения кейса бенчмарка.
//
// Параметры:
//   РезультатЗапускаКейса - РезультатЗапускаКейсаБенчмарка
//
// Возвращаемое значение:
//   СобытиеВыполненияБенчмарков
Функция СоздатьЗавершениеКейса(РезультатЗапускаКейса) Экспорт

	Возврат Создать(ТипыСобытийВыполненияБенчмарков.КейсБенчмаркаЗавершен(), РезультатЗапускаКейса);

КонецФункции

// Создает событие завершения запуска бенчмарков.
//
// Параметры:
//   РезультатЗапуска - РезультатЗапускаБенчмарков - Результат запуска.
//
// Возвращаемое значение:
//   СобытиеВыполненияБенчмарков
Функция СоздатьЗавершениеЗапуска(РезультатЗапуска) Экспорт

	Возврат Создать(ТипыСобытийВыполненияБенчмарков.ЗапускБенчмарковЗавершен(), РезультатЗапуска);

КонецФункции

// Создает событие формирования артефактов.
//
// Параметры:
//   Файлы - Массив - Пути сформированных файлов.
//
// Возвращаемое значение:
//   СобытиеВыполненияБенчмарков
Функция СоздатьАртефакты(Файлы) Экспорт

	Данные = Новый Структура("Файлы", Файлы);
	Возврат Создать(ТипыСобытийВыполненияБенчмарков.АртефактыСформированы(), Данные);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Создать(Тип, Данные)
	Возврат Новый СобытиеВыполненияБенчмарков(Тип, Данные);
КонецФункции

#КонецОбласти
