// BSLLS:MissingVariablesDescription-off

#Область ПрограммныйИнтерфейс

// Возвращает результат сравнения при недостаточном объеме данных.
//
// Возвращаемое значение:
//   Строка - Текстовое представление результата.
Функция НедостаточноДанных() Экспорт

	Возврат "Недостаточно данных";

КонецФункции

// Возвращает результат сравнения практически одинаковых замеров.
//
// Возвращаемое значение:
//   Строка - Текстовое представление результата.
Функция ПрактическиОдинаково() Экспорт

	Возврат "Практически одинаково";

КонецФункции

// Возвращает результат сравнения без обнаруженного различия.
//
// Возвращаемое значение:
//   Строка - Текстовое представление результата.
Функция РазличиеНеОбнаружено() Экспорт

	Возврат "Различие не обнаружено";

КонецФункции

// Возвращает результат сравнения эталонного кейса.
//
// Возвращаемое значение:
//   Строка - Текстовое представление результата.
Функция Эталон() Экспорт

	Возврат "Эталон";

КонецФункции

// Возвращает результат сравнения более быстрого кейса.
//
// Возвращаемое значение:
//   Строка - Текстовое представление результата.
Функция Быстрее() Экспорт

	Возврат "Быстрее";

КонецФункции

// Возвращает результат сравнения более медленного кейса.
//
// Возвращаемое значение:
//   Строка - Текстовое представление результата.
Функция Медленнее() Экспорт

	Возврат "Медленнее";

КонецФункции

#КонецОбласти
