// BSLLS:ExportVariables-off
// BSLLS:MissingVariablesDescription-off

Перем ПоУмолчанию Экспорт; // Устарела.
Перем ОтБыстрыхКМедленным Экспорт; // Устарела.
Перем ОтМедленныхКБыстрым Экспорт; // Устарела.
Перем Метод Экспорт; // Устарела.

#Область ПрограммныйИнтерфейс

// Возвращает сортировку в порядке объявления бенчмарков.
//
// Возвращаемое значение:
//   Строка - Идентификатор сортировки отчёта.
Функция ПоУмолчанию() Экспорт
	Возврат ПоУмолчанию;
КонецФункции

// Возвращает сортировку от быстрых бенчмарков к медленным.
//
// Возвращаемое значение:
//   Строка - Идентификатор сортировки отчёта.
Функция ОтБыстрыхКМедленным() Экспорт
	Возврат ОтБыстрыхКМедленным;
КонецФункции

// Возвращает сортировку от медленных бенчмарков к быстрым.
//
// Возвращаемое значение:
//   Строка - Идентификатор сортировки отчёта.
Функция ОтМедленныхКБыстрым() Экспорт
	Возврат ОтМедленныхКБыстрым;
КонецФункции

// Возвращает сортировку по имени метода.
//
// Возвращаемое значение:
//   Строка - Идентификатор сортировки отчёта.
Функция Метод() Экспорт
	Возврат Метод;
КонецФункции

#КонецОбласти

ПоУмолчанию = "ПоУмолчанию";
ОтБыстрыхКМедленным = "ОтБыстрыхКМедленным";
ОтМедленныхКБыстрым = "ОтМедленныхКБыстрым";
Метод = "Метод";
