// BSLLS:ExportVariables-off
// BSLLS:MissingVariablesDescription-off

Перем Значение Экспорт; // Устарела.
Перем Процент Экспорт; // Устарела.

#Область ПрограммныйИнтерфейс

// Возвращает стиль отображения коэффициента числом.
//
// Возвращаемое значение:
//   Строка - Идентификатор стиля коэффициента.
Функция Значение() Экспорт
	Возврат Значение;
КонецФункции

// Возвращает стиль отображения коэффициента процентом.
//
// Возвращаемое значение:
//   Строка - Идентификатор стиля коэффициента.
Функция Процент() Экспорт
	Возврат Процент;
КонецФункции

#КонецОбласти

Значение = "Значение";
Процент = "Процент";
