
// Создает экземпляр колонки
//
// Возвращаемое значение:
//   КолонкаОтчетаБенчмарков
Функция Создать() Экспорт
	
	Колонка = Новый КолонкаОтчетаБенчмарков(КолонкиОтчетаБенчмарков.ВерхнийКвартиль);
	Колонка.Заголовок = "Q3";
	Колонка.Описание = "Третий (верхний) квартиль (75-й процентиль)";
	Колонка.ЕдиницаИзмерения = ЕдиницыИзмеренийБенчмарков.Наносекунда;

	Возврат Колонка;

КонецФункции

// Возвращает значение колонки
//
// Параметры:
//   РезультатЗапускаКейса - РезультатЗапускаКейса
//   Колонка - КолонкаОтчетаБенчмарков
//
// Возвращаемое значение:
//   Произвольный
Функция Значение(РезультатЗапускаКейса, Колонка) Экспорт // BSLLS:UnusedParameters-off

	Статистика = РезультатЗапускаКейса.Статистика;
	Статистика.УстановитьЕдиницуВремени(ЕдиницыИзмеренийБенчмарков.Наносекунда);
	Возврат Статистика.ВерхнийКвартиль;

КонецФункции
