// Создает экземпляр колонки.
//
// Возвращаемое значение:
//   КолонкаОтчетаБенчмарков
Функция Создать() Экспорт

	Колонка = Новый КолонкаОтчетаБенчмарков(КолонкиОтчетаБенчмарков.ПогрешностьСреднего);
	Колонка.Заголовок = "Error";
	Колонка.Описание = "Половина 99,9% доверительного интервала среднего";
	Колонка.ЕдиницаИзмерения = ЕдиницыИзмеренийБенчмарков.Наносекунда;

	Возврат Колонка;

КонецФункции

// Возвращает значение колонки.
//
// Параметры:
//   РезультатЗапускаКейса - РезультатЗапускаКейса
//   Колонка - КолонкаОтчетаБенчмарков
//
// Возвращаемое значение:
//   Произвольный
Функция Значение(РезультатЗапускаКейса, Колонка) Экспорт // BSLLS:UnusedParameters-off

	Возврат РезультатЗапускаКейса.Статистика.ВНаносекунды().ПогрешностьСреднего;

КонецФункции

// Возвращает строковое представление погрешности.
//
// Параметры:
//   Значение - Произвольный
//   РезультатЗапускаКейса - РезультатЗапускаКейса, Неопределено
//   ПараметрыПредставленияКолонки - ПараметрыПредставленияКолонкиОтчетаБенчмарков
//
// Возвращаемое значение:
//   Строка
Функция ПредставлениеЗначения(Значение, РезультатЗапускаКейса, ПараметрыПредставленияКолонки) Экспорт // BSLLS:UnusedParameters-off

	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Возврат ПредставленияПоказателейБенчмарков.Представление(
		Значение,
		ЕдиницыИзмеренийБенчмарков.Наносекунда,
		ПараметрыПредставленияКолонки.ФорматнаяСтрока);

КонецФункции
