// Создает экземпляр колонки.
//
// Возвращаемое значение:
//   КолонкаОтчетаБенчмарков
Функция Создать() Экспорт

	Колонка = Новый КолонкаОтчетаБенчмарков(КолонкиОтчетаБенчмарков.СтатистическоеСравнение);
	Колонка.Заголовок = "MannWhitney";
	Колонка.Описание = "Вывод сравнения с эталоном по критерию Манна - Уитни";

	Возврат Колонка;

КонецФункции

// Возвращает значение колонки.
//
// Параметры:
//   РезультатЗапускаКейса - РезультатЗапускаКейса
//   Колонка - КолонкаОтчетаБенчмарков
//
// Возвращаемое значение:
//   Произвольный
Функция Значение(РезультатЗапускаКейса, Колонка) Экспорт // BSLLS:UnusedParameters-off

	Возврат РезультатЗапускаКейса.РезультатСтатистическогоСравнения;

КонецФункции
