// Создает экземпляр колонки.
//
// Возвращаемое значение:
//   КолонкаОтчетаБенчмарков
Функция Создать() Экспорт

	Колонка = Новый КолонкаОтчетаБенчмарков(КолонкиОтчетаБенчмарков.ПогрешностьСреднего);
	Колонка.Заголовок = "Error";
	Колонка.Описание = "Погрешность среднего при доверительной вероятности 99,9%";
	Колонка.ЕдиницаИзмерения = ЕдиницыИзмеренийБенчмарков.Наносекунда();
	Колонка.ФункцияСкрытия = "Элемент -> Элемент.Значение = Неопределено";

	Возврат Колонка;

КонецФункции

// Возвращает значение колонки.
//
// Параметры:
//   РезультатЗапускаКейса - РезультатЗапускаКейса
//   Колонка - КолонкаОтчетаБенчмарков
//
// Возвращаемое значение:
//   Произвольный
Функция Значение(РезультатЗапускаКейса, Колонка) Экспорт // BSLLS:UnusedParameters-off

	Возврат РезультатЗапускаКейса.Статистика.ВНаносекунды().ПогрешностьСреднего;

КонецФункции
