&Параметры(10, 100, 1000)
Перем КоличествоКейсов Экспорт; // Число

Перем _РезультатЗапуска; // РезультатЗапускаБенчмарков

#Область ОбработчикиСобытий

// Создает бенчмарк построения отчета.
&КоличествоИтераций(10)
&КоличествоПрогревочныхИтераций(4)
&МониторингПамяти
Процедура ПриСозданииОбъекта()
КонецПроцедуры

// Подготавливает синтетический результат запуска с заданным количеством кейсов.
&ПередКаждымКейсом
Процедура ПодготовитьРезультатЗапуска(Контекст) Экспорт

	_РезультатЗапуска = Новый РезультатЗапускаБенчмарков();
	Дескриптор = Новый ДескрипторБенчмарка(ТипЗнч(ЭтотОбъект), "ПостроитьОтчет");
	_РезультатЗапуска.ДескрипторыБенчмарков.Добавить(Дескриптор);

	Для Идентификатор = 1 По КоличествоКейсов Цикл
		РезультатКейса = Новый РезультатЗапускаКейса();
		РезультатКейса.Кейс = Новый КейсБенчмарка(Идентификатор, Дескриптор);
		РезультатКейса.Статистика = СоздатьСтатистику();
		_РезультатЗапуска.Запуски.Добавить(РезультатКейса);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Бенчмарки

// Формирует отчет по подготовленным результатам запуска кейсов.
&Бенчмарк
Процедура ПостроитьОтчет() Экспорт
	Отчет = Новый ПостроительОтчетаБенчмарков(_РезультатЗапуска).Сформировать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьСтатистику()

	ЗамерыВремени = Новый Массив();
	ЗамерыПамяти = Новый Массив();

	Для Значение = 1 По 5 Цикл
		ЗамерыВремени.Добавить(Значение);
		ЗамерыПамяти.Добавить(Значение * 64);
	КонецЦикла;

	Замеры = Новый Структура(
		"ЗамерыВремени, ЗамерыПамяти",
		ЗамерыВремени,
		ЗамерыПамяти);

	Возврат Новый СтатистикаБенчмарка(Замеры);

КонецФункции

#КонецОбласти
