Перем _Счетчик; // Число

#Область ОбработчикиСобытий

// Создает бенчмарк накладных расходов запуска методов.
&КоличествоИтераций(10)
&КоличествоПрогревочныхИтераций(4)
Процедура ПриСозданииОбъекта()
	_Счетчик = 0;
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Измеряет накладные расходы вызова пустого метода.
&Бенчмарк
Процедура ПустойМетод() Экспорт
КонецПроцедуры

// Измеряет накладные расходы вызова метода с минимальной операцией.
&Бенчмарк
Процедура КонтрольнаяОперация() Экспорт
	_Счетчик = _Счетчик + 1;
КонецПроцедуры

#КонецОбласти
