&Параметры(15, 1000, 10000)
Перем КоличествоЗамеров Экспорт; // Число

Перем _Замеры;   // Структура

#Область ОбработчикиСобытий

// Создает бенчмарк расчета статистики.
&КоличествоИтераций(10)
&КоличествоПрогревочныхИтераций(4)
&МониторингПамяти
Процедура ПриСозданииОбъекта()
КонецПроцедуры

// Подготавливает обратно упорядоченные положительные замеры времени и памяти.
&ПередКаждымКейсом
Процедура ПодготовитьЗамеры(Контекст) Экспорт

	_Замеры = СоздатьЗамеры();

КонецПроцедуры

#КонецОбласти

#Область Бенчмарки

// Рассчитывает статистику по подготовленным замерам времени и памяти.
&Бенчмарк
Процедура РассчитатьСтатистику() Экспорт
	Результат = Новый СтатистикаБенчмарка(_Замеры);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьЗамеры()

	ЗамерыВремени = Новый Массив(КоличествоЗамеров);
	ЗамерыПамяти = Новый Массив(КоличествоЗамеров);

	Для Индекс = 0 По КоличествоЗамеров - 1 Цикл
		Значение = КоличествоЗамеров - Индекс;
		ЗамерыВремени[Индекс] = Значение;
		ЗамерыПамяти[Индекс] = Значение * 64;
	КонецЦикла;

	Возврат Новый Структура(
		"ЗамерыВремени, ЗамерыПамяти",
		ЗамерыВремени,
		ЗамерыПамяти);

КонецФункции

#КонецОбласти
