#Использовать fs
#Использовать logos

Перем _ДополнительныеФайлыКонфигурацииOneScript; // Массив
Перем _ИмяФайлаКонфигурации; // Строка
Перем _ИмяПараметраДополнительныхБиблиотек; // Строка
Перем _ИмяПараметраСистемныхБиблиотек; // Строка
Перем _УчитыватьВсеПараметрыДополнительныхФайлов; // Булево
Перем _Лог; // Лог

#Область ОбработчикиСобытий

// Обеспечивает чтение и запись конфигурационных файлов OneScript
//
// Параметры:
//   ДополнительныеФайлыКонфигурацииOneScript - Строка, Массив из Строка,
//                                              ФиксированныйМассив из Строка, Неопределено -
//                                              Пути к файлам oscript.cfg или каталогам с ними
//                                              в порядке убывания приоритета. По умолчанию из
//                                              этих файлов читаются только параметры lib.system
//                                              и lib.additional.
Процедура ПриСозданииОбъекта(ДополнительныеФайлыКонфигурацииOneScript = Неопределено)

	_ИмяФайлаКонфигурации = "oscript.cfg";
	_ИмяПараметраДополнительныхБиблиотек = "lib.additional";
	_ИмяПараметраСистемныхБиблиотек = "lib.system";
	_УчитыватьВсеПараметрыДополнительныхФайлов = Ложь;
	_ДополнительныеФайлыКонфигурацииOneScript = НормализоватьДополнительныеФайлыКонфигурацииOneScript(
		ДополнительныеФайлыКонфигурацииOneScript
	);
	_Лог = Логирование.ПолучитьЛог("oscript.lib.benchmark.МенеджерПараметровКонфигурацииOneScript");

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Включает чтение всех параметров из дополнительных файлов oscript.cfg.
// По умолчанию из них читаются только параметры lib.system и lib.additional.
//
// Возвращаемое значение:
//   МенеджерПараметровКонфигурацииOneScript - Этот объект
Функция УчитыватьВсеПараметрыДополнительныхФайлов() Экспорт

	_УчитыватьВсеПараметрыДополнительныхФайлов = Истина;

	Возврат ЭтотОбъект;

КонецФункции

// Выполняет поиск и чтение конфигурационных файлов oscript.cfg из всех доступных источников
//
// Порядок приоритета файлов конфигурации:
//   1. Дополнительные файлы конфигурации в переданном порядке
//   2. Текущий каталог
//   3. Каталог программы
//
// Особенности:
//   - Настройки из первого подходящего файла имеют приоритет
//   - Пути к библиотекам (lib.system, lib.additional) автоматически разрешаются
//   - Каталоги lib.additional и lib.system из всех файлов объединяются в
//     lib.additional от локального к глобальному
//
// Возвращаемое значение:
//   Соответствие
Функция Прочитать() Экспорт
		
	ПрочитанныеПараметры = НайтиИПрочитатьФайлы();
	Возврат ПрочитанныеПараметры;

КонецФункции

// Записывает параметры конфигурации в файл oscript.cfg в указанном каталоге
//
// Параметры:
//   Каталог - Строка - Путь к каталогу, в котором будет создан файл oscript.cfg
Процедура ЗаписатьВКаталог(Каталог) Экспорт

	ПутьКФайлу = ОбъединитьПути(Каталог, _ИмяФайлаКонфигурации);
	ЗаписатьВФайл(ПутьКФайлу);

КонецПроцедуры

// Записывает параметры конфигурации в указанный файл
//
// Параметры:
//   ПутьКФайлу - Строка - Полный путь к файлу
Процедура ЗаписатьВФайл(ПутьКФайлу) Экспорт

	ПрочитанныеНастройки = Прочитать();

	МассивСтрок = Новый Массив();
	Для Каждого Строка Из ПрочитанныеНастройки Цикл
		МассивСтрок.Добавить(СтрШаблон("%1=%2", Строка.Ключ, Строка.Значение));
	КонецЦикла;

	ТекстКонфигурации = СтрСоединить(МассивСтрок, Символы.ПС);

	ЗаписьТекста = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	ЗаписьТекста.Записать(ТекстКонфигурации);
	ЗаписьТекста.Закрыть();

	_Лог.Отладка("Записаны параметры конфигурации в <%1>", ПутьКФайлу);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиИПрочитатьФайлы()

	ИсточникиКонфигурации = СформироватьИсточникиКонфигурации();
	ПрочитанныеНастройки = Новый Соответствие();
	КаталогиБиблиотек = Новый Массив();

	Для Каждого ИсточникКонфигурации Из ИсточникиКонфигурации Цикл

		Если Не ФС.ФайлСуществует(ИсточникКонфигурации.ПутьКФайлу) Тогда
			Продолжить;
		КонецЕсли;

		НастройкиФайла = Новый Соответствие();
		ПрочитатьКонфигурационныйФайл(
			ИсточникКонфигурации.ПутьКФайлу,
			НастройкиФайла,
			ИсточникКонфигурации.ТолькоПараметрыБиблиотек
		);
		ДобавитьОтсутствующиеНастройки(ПрочитанныеНастройки, НастройкиФайла);
		ДобавитьКаталогиБиблиотек(
			КаталогиБиблиотек,
			НастройкиФайла[_ИмяПараметраДополнительныхБиблиотек]
		);
		ДобавитьКаталогиБиблиотек(
			КаталогиБиблиотек,
			НастройкиФайла[_ИмяПараметраСистемныхБиблиотек]
		);

	КонецЦикла;

	Если КаталогиБиблиотек.Количество() > 0 Тогда
		ПрочитанныеНастройки.Вставить(
			_ИмяПараметраДополнительныхБиблиотек,
			СтрСоединить(КаталогиБиблиотек, ";")
		);
	КонецЕсли;

	Возврат ПрочитанныеНастройки;
	
КонецФункции

Функция СформироватьИсточникиКонфигурации()

	ИсточникиКонфигурации = Новый Массив();
	Для Каждого ДополнительныйФайлКонфигурацииOneScript Из _ДополнительныеФайлыКонфигурацииOneScript Цикл
		ИсточникиКонфигурации.Добавить(НовыйИсточникКонфигурации(
			ДополнительныйФайлКонфигурацииOneScript,
			Не _УчитыватьВсеПараметрыДополнительныхФайлов
		));
	КонецЦикла;

	ИсточникиКонфигурации.Добавить(НовыйИсточникКонфигурации(
		ОбъединитьПути(СтартовыйСценарий().Каталог, _ИмяФайлаКонфигурации),
		Ложь
	));

	ИсточникиКонфигурации.Добавить(НовыйИсточникКонфигурации(
		ОбъединитьПути(ТекущийКаталог(), _ИмяФайлаКонфигурации),
		Ложь
	));

	ИсточникиКонфигурации.Добавить(НовыйИсточникКонфигурации(
		ОбъединитьПути(КаталогПрограммы(), _ИмяФайлаКонфигурации),
		Ложь
	));

	Возврат ИсточникиКонфигурации;

КонецФункции

Функция НовыйИсточникКонфигурации(ПутьКФайлу, ТолькоПараметрыБиблиотек)

	Возврат Новый Структура(
		"ПутьКФайлу, ТолькоПараметрыБиблиотек",
		ПутьКФайлу,
		ТолькоПараметрыБиблиотек
	);

КонецФункции

Функция НормализоватьДополнительныеФайлыКонфигурацииOneScript(ДополнительныеФайлыКонфигурацииOneScript)

	НормализованныеФайлы = Новый Массив();

	Если ДополнительныеФайлыКонфигурацииOneScript = Неопределено Тогда
		Возврат НормализованныеФайлы;
	КонецЕсли;

	ТипФайлов = ТипЗнч(ДополнительныеФайлыКонфигурацииOneScript);
	Если ТипФайлов = Тип("Строка") Тогда
		ДобавитьНормализованныйФайл(НормализованныеФайлы, ДополнительныеФайлыКонфигурацииOneScript);
	ИначеЕсли ТипФайлов = Тип("Массив") Или ТипФайлов = Тип("ФиксированныйМассив") Тогда
		Для Каждого ДополнительныйФайлКонфигурацииOneScript Из ДополнительныеФайлыКонфигурацииOneScript Цикл
			ДобавитьНормализованныйФайл(НормализованныеФайлы, ДополнительныйФайлКонфигурацииOneScript);
		КонецЦикла;
	Иначе
		ШаблонИсключения = "Дополнительные файлы конфигурации должны иметь тип Строка, Массив из Строка "
			+ "или ФиксированныйМассив из Строка, получен тип <%1>";
		ВызватьИсключение СтрШаблон(
			ШаблонИсключения,
			ТипФайлов
		);
	КонецЕсли;

	Возврат НормализованныеФайлы;

КонецФункции

Процедура ДобавитьНормализованныйФайл(Файлы, ПутьКФайлу)

	Если ФС.КаталогСуществует(ПутьКФайлу) Тогда
		ПутьКФайлу = ОбъединитьПути(ПутьКФайлу, _ИмяФайлаКонфигурации);
	КонецЕсли;

	ПолныйПуть = ФС.НормализоватьПуть(ПутьКФайлу);
	Если Файлы.Найти(ПолныйПуть) = Неопределено Тогда
		Файлы.Добавить(ПолныйПуть);
	КонецЕсли;

КонецПроцедуры

Процедура ПрочитатьКонфигурационныйФайл(
	ПутьКФайлу,
	ПрочитанныеНастройки,
	ТолькоПараметрыБиблиотек = Ложь)
	
	КаталогРазрешенияПутей = Новый Файл(ПутьКФайлу).Путь;

	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	СодержимоеФайла = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	РегулярноеВыражение = Новый РегулярноеВыражение("^(?!\s*#)\s*([^=\r\n]+?)\s*=\s*(.*)$");
	Совпадения = РегулярноеВыражение.НайтиСовпадения(СодержимоеФайла);

	Для Каждого Совпадение Из Совпадения Цикл

		Ключ = НРег(Совпадение.Группы[1].Значение);
		Значение = Совпадение.Группы[2].Значение;
		ЭтоПараметрБиблиотеки = Ключ = _ИмяПараметраСистемныхБиблиотек
			Или Ключ = _ИмяПараметраДополнительныхБиблиотек;

		Если ТолькоПараметрыБиблиотек И Не ЭтоПараметрБиблиотеки Тогда
			Продолжить;
		КонецЕсли;

		Если ЭтоПараметрБиблиотеки Тогда
			Значение = РазрешитьПутиКаталоговБиблиотекИзНастройки(Значение, КаталогРазрешенияПутей);
		КонецЕсли;

		ПрочитанныеНастройки.Вставить(Ключ, Значение);

	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьОтсутствующиеНастройки(Приемник, Источник)

	Для Каждого Параметр Из Источник Цикл
		Если Приемник[Параметр.Ключ] = Неопределено Тогда
			Приемник.Вставить(Параметр.Ключ, Параметр.Значение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьКаталогиБиблиотек(КаталогиБиблиотек, КаталогиСтрокой)

	Если Не ЗначениеЗаполнено(КаталогиСтрокой) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Каталог Из СтрРазделить(КаталогиСтрокой, ";", Ложь) Цикл
		Если КаталогиБиблиотек.Найти(Каталог) = Неопределено Тогда
			КаталогиБиблиотек.Добавить(Каталог);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция РазрешитьПутиКаталоговБиблиотекИзНастройки(КаталогиСтрокой, КаталогРазрешенияПутей)

	Каталоги = СтрРазделить(КаталогиСтрокой, ";", Ложь);
	РазрешенныеКаталоги = Новый Массив();

	Для Каждого Каталог Из Каталоги Цикл
		АбсолютныйПуть = ПолучитьАбсолютныйПуть(СокрЛП(Каталог), КаталогРазрешенияПутей);
		РазрешенныеКаталоги.Добавить(АбсолютныйПуть);
	КонецЦикла;

	Возврат СтрСоединить(РазрешенныеКаталоги, ";");
	
КонецФункции

Функция ПолучитьАбсолютныйПуть(Путь, КаталогРазрешенияПутей)

	Если РаботаСПутямиФайловойСистемы.ЭтоАбсолютныйПуть(Путь) Тогда
		Возврат Путь;
	КонецЕсли;

	Возврат ФС.НормализоватьПуть(ОбъединитьПути(КаталогРазрешенияПутей, Путь));
	
КонецФункции

#КонецОбласти
