
#Использовать "../../.."
#Использовать "../../fixtures"

Функция КонфигурацияПоУмолчанию() Экспорт

	Конфигурация = Новый КонфигурацияБенчмарков();
	НастроитьКонфигурациюПодТесты(Конфигурация);

	Возврат Конфигурация;

КонецФункции

Процедура НастроитьКонфигурациюПодТесты(Конфигурация) Экспорт

	МинимальноеВремяИтерации = 10;

	Конфигурация
		.УстановитьКоличествоВызововЗаИтерацию(1)
		.УстановитьКоличествоИтерацийПрогрева(1)
		.УстановитьКоличествоИтераций(1)
		.УстановитьМинимальноеВремяИтерации(МинимальноеВремяИтерации);

КонецПроцедуры